
*** Dumping AST Record Layout
         0 | VECTOR3
         0 |   F32 X
         4 |   F32 Y
         8 |   F32 Z
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_ADC_SAMPLE_STRUCT
         0 |   S16 X
         2 |   S16 Y
         4 |   S16 Z
           | [sizeof=6, align=2]

*** Dumping AST Record Layout
         0 | PIN_PERIPH_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   U32 pin_config
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PIN_ADC_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_COEFF_STRUCT
         0 |   U32 P
         4 |   BOOLEAN ic
         5 |   BOOLEAN rising_edge
         6 |   BOOLEAN falling_edge
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | MOMENTARY_SWITCH_COEFF_STRUCT
         0 |   U32 debounce_threshold
         4 |   U32 sustain_threshold
         8 |   PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
         8 |     U32 P
        12 |     BOOLEAN ic
        13 |     BOOLEAN rising_edge
        14 |     BOOLEAN falling_edge
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | PIN_GPIO_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:112:5)
         0 |   PIN_GPIO_HW_STRUCT pwr_path_test
         0 |     U32 port
         4 |     U8 pin
         8 |   PIN_GPIO_HW_STRUCT brake_pwr_test
         8 |     U32 port
        12 |     U8 pin
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:156:5)
         0 |   int diag_1
         4 |   int diag_2
         8 |   int diag_3
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:165:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:174:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:183:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_brakes
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | TARGET_VOLTAGE_MONITORS_HW_UNION
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:156:5) schematic
         0 |     int diag_1
         4 |     int diag_2
         8 |     int diag_3
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:165:5) MCPA
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:174:5) MCPB
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:183:5) MCPC
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_brakes
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | PACKET_TYPE_STRUCT
         0 |   ADP2MCP_PACKET_TYPE packet_type
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_STATE_STRUCT
         0 |   BOOLEAN init
         4 |   U32 iteration
         8 |   BOOLEAN prev_input
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_INPUT_STRUCT
         0 |   BOOLEAN input
         1 |   BOOLEAN reset
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_OUTPUT_STRUCT
         0 |   BOOLEAN output
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |   PERSISTENT1SHOT_STATE_STRUCT state
         8 |     BOOLEAN init
        12 |     U32 iteration
        16 |     BOOLEAN prev_input
        20 |   PERSISTENT1SHOT_INPUT_STRUCT input
        20 |     BOOLEAN input
        21 |     BOOLEAN reset
        22 |   PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |     BOOLEAN output
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_COEFF_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
         0 |     U32 P
         4 |     BOOLEAN ic
         5 |     BOOLEAN rising_edge
         6 |     BOOLEAN falling_edge
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_STATE_STRUCT
         0 |   PERSISTENT1SHOT_STRUCT transition_one_shot
         0 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |     PERSISTENT1SHOT_STATE_STRUCT state
         8 |       BOOLEAN init
        12 |       U32 iteration
        16 |       BOOLEAN prev_input
        20 |     PERSISTENT1SHOT_INPUT_STRUCT input
        20 |       BOOLEAN input
        21 |       BOOLEAN reset
        22 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   F32 output_previous
        28 |   F32 transition_deviation_latched
        32 |   F32 selected_input
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_STRUCT
         0 |   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
         8 |   SWITCH_COMMON_STATE_STRUCT state
         8 |     PERSISTENT1SHOT_STRUCT transition_one_shot
         8 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        16 |       PERSISTENT1SHOT_STATE_STRUCT state
        16 |         BOOLEAN init
        20 |         U32 iteration
        24 |         BOOLEAN prev_input
        28 |       PERSISTENT1SHOT_INPUT_STRUCT input
        28 |         BOOLEAN input
        29 |         BOOLEAN reset
        30 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        30 |         BOOLEAN output
        32 |     F32 output_previous
        36 |     F32 transition_deviation_latched
        40 |     F32 selected_input
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | LINTERP_REGION_STRUCT
         0 |   F32 breakpoint
         4 |   F32 value
         8 |   F32 slope
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_STATE_STRUCT
         0 |   F32 delay
         4 |   BOOLEAN reset_on_init
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN run
         9 |   BOOLEAN hold
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_STRUCT
         0 |   REINTICH_COEFF_STRUCT * coeff
         8 |   REINTICH_STATE_STRUCT state
         8 |     F32 delay
        12 |     BOOLEAN reset_on_init
        16 |   REINTICH_INPUT_STRUCT input
        16 |     F32 IC
        20 |     F32 input
        24 |     BOOLEAN run
        25 |     BOOLEAN hold
        28 |   REINTICH_OUTPUT_STRUCT output
        28 |     F32 output
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_STATE_STRUCT
         0 |   SWITCH_COMMON_STRUCT common
         0 |     SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
         8 |     SWITCH_COMMON_STATE_STRUCT state
         8 |       PERSISTENT1SHOT_STRUCT transition_one_shot
         8 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        16 |         PERSISTENT1SHOT_STATE_STRUCT state
        16 |           BOOLEAN init
        20 |           U32 iteration
        24 |           BOOLEAN prev_input
        28 |         PERSISTENT1SHOT_INPUT_STRUCT input
        28 |           BOOLEAN input
        29 |           BOOLEAN reset
        30 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
        30 |           BOOLEAN output
        32 |       F32 output_previous
        36 |       F32 transition_deviation_latched
        40 |       F32 selected_input
        48 |   REINTICH_STRUCT first_integrator
        48 |     REINTICH_COEFF_STRUCT * coeff
        56 |     REINTICH_STATE_STRUCT state
        56 |       F32 delay
        60 |       BOOLEAN reset_on_init
        64 |     REINTICH_INPUT_STRUCT input
        64 |       F32 IC
        68 |       F32 input
        72 |       BOOLEAN run
        73 |       BOOLEAN hold
        76 |     REINTICH_OUTPUT_STRUCT output
        76 |       F32 output
        80 |   REINTICH_STRUCT second_integrator
        80 |     REINTICH_COEFF_STRUCT * coeff
        88 |     REINTICH_STATE_STRUCT state
        88 |       F32 delay
        92 |       BOOLEAN reset_on_init
        96 |     REINTICH_INPUT_STRUCT input
        96 |       F32 IC
       100 |       F32 input
       104 |       BOOLEAN run
       105 |       BOOLEAN hold
       108 |     REINTICH_OUTPUT_STRUCT output
       108 |       F32 output
       112 |   F32 first_feedback_delay
       116 |   F32 second_feedback_delay
           | [sizeof=120, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_INPUT_STRUCT
         0 |   F32 input_one
         4 |   F32 input_two
         8 |   BOOLEAN switch_flag
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_STRUCT
         0 |   SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
         8 |   SWITCH_SECOND_ORDER_STATE_STRUCT state
         8 |     SWITCH_COMMON_STRUCT common
         8 |       SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        16 |       SWITCH_COMMON_STATE_STRUCT state
        16 |         PERSISTENT1SHOT_STRUCT transition_one_shot
        16 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |           PERSISTENT1SHOT_STATE_STRUCT state
        24 |             BOOLEAN init
        28 |             U32 iteration
        32 |             BOOLEAN prev_input
        36 |           PERSISTENT1SHOT_INPUT_STRUCT input
        36 |             BOOLEAN input
        37 |             BOOLEAN reset
        38 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |             BOOLEAN output
        40 |         F32 output_previous
        44 |         F32 transition_deviation_latched
        48 |         F32 selected_input
        56 |     REINTICH_STRUCT first_integrator
        56 |       REINTICH_COEFF_STRUCT * coeff
        64 |       REINTICH_STATE_STRUCT state
        64 |         F32 delay
        68 |         BOOLEAN reset_on_init
        72 |       REINTICH_INPUT_STRUCT input
        72 |         F32 IC
        76 |         F32 input
        80 |         BOOLEAN run
        81 |         BOOLEAN hold
        84 |       REINTICH_OUTPUT_STRUCT output
        84 |         F32 output
        88 |     REINTICH_STRUCT second_integrator
        88 |       REINTICH_COEFF_STRUCT * coeff
        96 |       REINTICH_STATE_STRUCT state
        96 |         F32 delay
       100 |         BOOLEAN reset_on_init
       104 |       REINTICH_INPUT_STRUCT input
       104 |         F32 IC
       108 |         F32 input
       112 |         BOOLEAN run
       113 |         BOOLEAN hold
       116 |       REINTICH_OUTPUT_STRUCT output
       116 |         F32 output
       120 |     F32 first_feedback_delay
       124 |     F32 second_feedback_delay
       128 |   SWITCH_SECOND_ORDER_INPUT_STRUCT input
       128 |     F32 input_one
       132 |     F32 input_two
       136 |     BOOLEAN switch_flag
       140 |   SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       140 |     F32 output
           | [sizeof=144, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_INPUT_STRUCT
         0 |   F32 rate_cross_axis
         4 |   F32 rate_near_axis
         8 |   F32 attitude_near_axis
        12 |   F32 adp_roll_cmd
        16 |   F32 adp_pitch_cmd
        20 |   BOOLEAN run_mode
        21 |   BOOLEAN uar_mode
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_STATE_STRUCT
         0 |   F32 delay
         4 |   BOOLEAN reset_on_init
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN inv
         5 |   BOOLEAN satLo
         6 |   BOOLEAN satHi
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_STRUCT
         0 |   SATURATIONVF_COEFF_STRUCT * coeff
         8 |   SATURATIONVF_STATE_STRUCT state
         8 |     F32 delay
        12 |     BOOLEAN reset_on_init
        16 |   SATURATIONVF_INPUT_STRUCT input
        16 |     F32 IC
        20 |     F32 input
        24 |     BOOLEAN reset
        28 |   SATURATIONVF_OUTPUT_STRUCT output
        28 |     F32 output
        32 |     BOOLEAN inv
        33 |     BOOLEAN satLo
        34 |     BOOLEAN satHi
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | REINTICHS_STATE_STRUCT
         0 |   F32 IC_delay
         4 |   F32 rail_bounce
         8 |   BOOLEAN prev_sat_UL
         9 |   BOOLEAN prev_sat_LL
        10 |   BOOLEAN prev_sat_inv
        11 |   BOOLEAN prev_reset_int
        12 |   BOOLEAN prev_reset_sat
        16 |   REINTICH_STRUCT integrator
        16 |     REINTICH_COEFF_STRUCT * coeff
        24 |     REINTICH_STATE_STRUCT state
        24 |       F32 delay
        28 |       BOOLEAN reset_on_init
        32 |     REINTICH_INPUT_STRUCT input
        32 |       F32 IC
        36 |       F32 input
        40 |       BOOLEAN run
        41 |       BOOLEAN hold
        44 |     REINTICH_OUTPUT_STRUCT output
        44 |       F32 output
        48 |   SATURATIONVF_STRUCT sat
        48 |     SATURATIONVF_COEFF_STRUCT * coeff
        56 |     SATURATIONVF_STATE_STRUCT state
        56 |       F32 delay
        60 |       BOOLEAN reset_on_init
        64 |     SATURATIONVF_INPUT_STRUCT input
        64 |       F32 IC
        68 |       F32 input
        72 |       BOOLEAN reset
        76 |     SATURATIONVF_OUTPUT_STRUCT output
        76 |       F32 output
        80 |       BOOLEAN inv
        81 |       BOOLEAN satLo
        82 |       BOOLEAN satHi
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | REINTICHS_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN run
         9 |   BOOLEAN hold
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN sat_UL
         5 |   BOOLEAN sat_LL
         6 |   BOOLEAN inv
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_STRUCT
         0 |   REINTICHS_COEFF_STRUCT * coeff
         8 |   REINTICHS_STATE_STRUCT state
         8 |     F32 IC_delay
        12 |     F32 rail_bounce
        16 |     BOOLEAN prev_sat_UL
        17 |     BOOLEAN prev_sat_LL
        18 |     BOOLEAN prev_sat_inv
        19 |     BOOLEAN prev_reset_int
        20 |     BOOLEAN prev_reset_sat
        24 |     REINTICH_STRUCT integrator
        24 |       REINTICH_COEFF_STRUCT * coeff
        32 |       REINTICH_STATE_STRUCT state
        32 |         F32 delay
        36 |         BOOLEAN reset_on_init
        40 |       REINTICH_INPUT_STRUCT input
        40 |         F32 IC
        44 |         F32 input
        48 |         BOOLEAN run
        49 |         BOOLEAN hold
        52 |       REINTICH_OUTPUT_STRUCT output
        52 |         F32 output
        56 |     SATURATIONVF_STRUCT sat
        56 |       SATURATIONVF_COEFF_STRUCT * coeff
        64 |       SATURATIONVF_STATE_STRUCT state
        64 |         F32 delay
        68 |         BOOLEAN reset_on_init
        72 |       SATURATIONVF_INPUT_STRUCT input
        72 |         F32 IC
        76 |         F32 input
        80 |         BOOLEAN reset
        84 |       SATURATIONVF_OUTPUT_STRUCT output
        84 |         F32 output
        88 |         BOOLEAN inv
        89 |         BOOLEAN satLo
        90 |         BOOLEAN satHi
        96 |   REINTICHS_INPUT_STRUCT input
        96 |     F32 IC
       100 |     F32 input
       104 |     BOOLEAN run
       105 |     BOOLEAN hold
       108 |   REINTICHS_OUTPUT_STRUCT output
       108 |     F32 output
       112 |     BOOLEAN sat_UL
       113 |     BOOLEAN sat_LL
       114 |     BOOLEAN inv
           | [sizeof=120, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_STATE_STRUCT
         0 |   SWITCH_SECOND_ORDER_STRUCT rate_switch
         0 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
         8 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
         8 |       SWITCH_COMMON_STRUCT common
         8 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        16 |         SWITCH_COMMON_STATE_STRUCT state
        16 |           PERSISTENT1SHOT_STRUCT transition_one_shot
        16 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |             PERSISTENT1SHOT_STATE_STRUCT state
        24 |               BOOLEAN init
        28 |               U32 iteration
        32 |               BOOLEAN prev_input
        36 |             PERSISTENT1SHOT_INPUT_STRUCT input
        36 |               BOOLEAN input
        37 |               BOOLEAN reset
        38 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |               BOOLEAN output
        40 |           F32 output_previous
        44 |           F32 transition_deviation_latched
        48 |           F32 selected_input
        56 |       REINTICH_STRUCT first_integrator
        56 |         REINTICH_COEFF_STRUCT * coeff
        64 |         REINTICH_STATE_STRUCT state
        64 |           F32 delay
        68 |           BOOLEAN reset_on_init
        72 |         REINTICH_INPUT_STRUCT input
        72 |           F32 IC
        76 |           F32 input
        80 |           BOOLEAN run
        81 |           BOOLEAN hold
        84 |         REINTICH_OUTPUT_STRUCT output
        84 |           F32 output
        88 |       REINTICH_STRUCT second_integrator
        88 |         REINTICH_COEFF_STRUCT * coeff
        96 |         REINTICH_STATE_STRUCT state
        96 |           F32 delay
       100 |           BOOLEAN reset_on_init
       104 |         REINTICH_INPUT_STRUCT input
       104 |           F32 IC
       108 |           F32 input
       112 |           BOOLEAN run
       113 |           BOOLEAN hold
       116 |         REINTICH_OUTPUT_STRUCT output
       116 |           F32 output
       120 |       F32 first_feedback_delay
       124 |       F32 second_feedback_delay
       128 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
       128 |       F32 input_one
       132 |       F32 input_two
       136 |       BOOLEAN switch_flag
       140 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       140 |       F32 output
       144 |   SWITCH_SECOND_ORDER_STRUCT attitude_switch
       144 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       152 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
       152 |       SWITCH_COMMON_STRUCT common
       152 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       160 |         SWITCH_COMMON_STATE_STRUCT state
       160 |           PERSISTENT1SHOT_STRUCT transition_one_shot
       160 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       168 |             PERSISTENT1SHOT_STATE_STRUCT state
       168 |               BOOLEAN init
       172 |               U32 iteration
       176 |               BOOLEAN prev_input
       180 |             PERSISTENT1SHOT_INPUT_STRUCT input
       180 |               BOOLEAN input
       181 |               BOOLEAN reset
       182 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
       182 |               BOOLEAN output
       184 |           F32 output_previous
       188 |           F32 transition_deviation_latched
       192 |           F32 selected_input
       200 |       REINTICH_STRUCT first_integrator
       200 |         REINTICH_COEFF_STRUCT * coeff
       208 |         REINTICH_STATE_STRUCT state
       208 |           F32 delay
       212 |           BOOLEAN reset_on_init
       216 |         REINTICH_INPUT_STRUCT input
       216 |           F32 IC
       220 |           F32 input
       224 |           BOOLEAN run
       225 |           BOOLEAN hold
       228 |         REINTICH_OUTPUT_STRUCT output
       228 |           F32 output
       232 |       REINTICH_STRUCT second_integrator
       232 |         REINTICH_COEFF_STRUCT * coeff
       240 |         REINTICH_STATE_STRUCT state
       240 |           F32 delay
       244 |           BOOLEAN reset_on_init
       248 |         REINTICH_INPUT_STRUCT input
       248 |           F32 IC
       252 |           F32 input
       256 |           BOOLEAN run
       257 |           BOOLEAN hold
       260 |         REINTICH_OUTPUT_STRUCT output
       260 |           F32 output
       264 |       F32 first_feedback_delay
       268 |       F32 second_feedback_delay
       272 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
       272 |       F32 input_one
       276 |       F32 input_two
       280 |       BOOLEAN switch_flag
       284 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       284 |       F32 output
       288 |   REINTICH_STRUCT reintich
       288 |     REINTICH_COEFF_STRUCT * coeff
       296 |     REINTICH_STATE_STRUCT state
       296 |       F32 delay
       300 |       BOOLEAN reset_on_init
       304 |     REINTICH_INPUT_STRUCT input
       304 |       F32 IC
       308 |       F32 input
       312 |       BOOLEAN run
       313 |       BOOLEAN hold
       316 |     REINTICH_OUTPUT_STRUCT output
       316 |       F32 output
       320 |   REINTICHS_STRUCT reintichs
       320 |     REINTICHS_COEFF_STRUCT * coeff
       328 |     REINTICHS_STATE_STRUCT state
       328 |       F32 IC_delay
       332 |       F32 rail_bounce
       336 |       BOOLEAN prev_sat_UL
       337 |       BOOLEAN prev_sat_LL
       338 |       BOOLEAN prev_sat_inv
       339 |       BOOLEAN prev_reset_int
       340 |       BOOLEAN prev_reset_sat
       344 |       REINTICH_STRUCT integrator
       344 |         REINTICH_COEFF_STRUCT * coeff
       352 |         REINTICH_STATE_STRUCT state
       352 |           F32 delay
       356 |           BOOLEAN reset_on_init
       360 |         REINTICH_INPUT_STRUCT input
       360 |           F32 IC
       364 |           F32 input
       368 |           BOOLEAN run
       369 |           BOOLEAN hold
       372 |         REINTICH_OUTPUT_STRUCT output
       372 |           F32 output
       376 |       SATURATIONVF_STRUCT sat
       376 |         SATURATIONVF_COEFF_STRUCT * coeff
       384 |         SATURATIONVF_STATE_STRUCT state
       384 |           F32 delay
       388 |           BOOLEAN reset_on_init
       392 |         SATURATIONVF_INPUT_STRUCT input
       392 |           F32 IC
       396 |           F32 input
       400 |           BOOLEAN reset
       404 |         SATURATIONVF_OUTPUT_STRUCT output
       404 |           F32 output
       408 |           BOOLEAN inv
       409 |           BOOLEAN satLo
       410 |           BOOLEAN satHi
       416 |     REINTICHS_INPUT_STRUCT input
       416 |       F32 IC
       420 |       F32 input
       424 |       BOOLEAN run
       425 |       BOOLEAN hold
       428 |     REINTICHS_OUTPUT_STRUCT output
       428 |       F32 output
       432 |       BOOLEAN sat_UL
       433 |       BOOLEAN sat_LL
       434 |       BOOLEAN inv
       440 |   BOOLEAN prev_run
       441 |   BOOLEAN integ_sat
           | [sizeof=448, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_STRUCT
         0 |   ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
         8 |   ATTITUDE_CONTROLLER_INPUT_STRUCT input
         8 |     F32 rate_cross_axis
        12 |     F32 rate_near_axis
        16 |     F32 attitude_near_axis
        20 |     F32 adp_roll_cmd
        24 |     F32 adp_pitch_cmd
        28 |     BOOLEAN run_mode
        29 |     BOOLEAN uar_mode
        32 |   ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        32 |     F32 output
        40 |   ATTITUDE_CONTROLLER_STATE_STRUCT state
        40 |     SWITCH_SECOND_ORDER_STRUCT rate_switch
        40 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        48 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
        48 |         SWITCH_COMMON_STRUCT common
        48 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        56 |           SWITCH_COMMON_STATE_STRUCT state
        56 |             PERSISTENT1SHOT_STRUCT transition_one_shot
        56 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        64 |               PERSISTENT1SHOT_STATE_STRUCT state
        64 |                 BOOLEAN init
        68 |                 U32 iteration
        72 |                 BOOLEAN prev_input
        76 |               PERSISTENT1SHOT_INPUT_STRUCT input
        76 |                 BOOLEAN input
        77 |                 BOOLEAN reset
        78 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
        78 |                 BOOLEAN output
        80 |             F32 output_previous
        84 |             F32 transition_deviation_latched
        88 |             F32 selected_input
        96 |         REINTICH_STRUCT first_integrator
        96 |           REINTICH_COEFF_STRUCT * coeff
       104 |           REINTICH_STATE_STRUCT state
       104 |             F32 delay
       108 |             BOOLEAN reset_on_init
       112 |           REINTICH_INPUT_STRUCT input
       112 |             F32 IC
       116 |             F32 input
       120 |             BOOLEAN run
       121 |             BOOLEAN hold
       124 |           REINTICH_OUTPUT_STRUCT output
       124 |             F32 output
       128 |         REINTICH_STRUCT second_integrator
       128 |           REINTICH_COEFF_STRUCT * coeff
       136 |           REINTICH_STATE_STRUCT state
       136 |             F32 delay
       140 |             BOOLEAN reset_on_init
       144 |           REINTICH_INPUT_STRUCT input
       144 |             F32 IC
       148 |             F32 input
       152 |             BOOLEAN run
       153 |             BOOLEAN hold
       156 |           REINTICH_OUTPUT_STRUCT output
       156 |             F32 output
       160 |         F32 first_feedback_delay
       164 |         F32 second_feedback_delay
       168 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
       168 |         F32 input_one
       172 |         F32 input_two
       176 |         BOOLEAN switch_flag
       180 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       180 |         F32 output
       184 |     SWITCH_SECOND_ORDER_STRUCT attitude_switch
       184 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       192 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
       192 |         SWITCH_COMMON_STRUCT common
       192 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       200 |           SWITCH_COMMON_STATE_STRUCT state
       200 |             PERSISTENT1SHOT_STRUCT transition_one_shot
       200 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       208 |               PERSISTENT1SHOT_STATE_STRUCT state
       208 |                 BOOLEAN init
       212 |                 U32 iteration
       216 |                 BOOLEAN prev_input
       220 |               PERSISTENT1SHOT_INPUT_STRUCT input
       220 |                 BOOLEAN input
       221 |                 BOOLEAN reset
       222 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
       222 |                 BOOLEAN output
       224 |             F32 output_previous
       228 |             F32 transition_deviation_latched
       232 |             F32 selected_input
       240 |         REINTICH_STRUCT first_integrator
       240 |           REINTICH_COEFF_STRUCT * coeff
       248 |           REINTICH_STATE_STRUCT state
       248 |             F32 delay
       252 |             BOOLEAN reset_on_init
       256 |           REINTICH_INPUT_STRUCT input
       256 |             F32 IC
       260 |             F32 input
       264 |             BOOLEAN run
       265 |             BOOLEAN hold
       268 |           REINTICH_OUTPUT_STRUCT output
       268 |             F32 output
       272 |         REINTICH_STRUCT second_integrator
       272 |           REINTICH_COEFF_STRUCT * coeff
       280 |           REINTICH_STATE_STRUCT state
       280 |             F32 delay
       284 |             BOOLEAN reset_on_init
       288 |           REINTICH_INPUT_STRUCT input
       288 |             F32 IC
       292 |             F32 input
       296 |             BOOLEAN run
       297 |             BOOLEAN hold
       300 |           REINTICH_OUTPUT_STRUCT output
       300 |             F32 output
       304 |         F32 first_feedback_delay
       308 |         F32 second_feedback_delay
       312 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
       312 |         F32 input_one
       316 |         F32 input_two
       320 |         BOOLEAN switch_flag
       324 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       324 |         F32 output
       328 |     REINTICH_STRUCT reintich
       328 |       REINTICH_COEFF_STRUCT * coeff
       336 |       REINTICH_STATE_STRUCT state
       336 |         F32 delay
       340 |         BOOLEAN reset_on_init
       344 |       REINTICH_INPUT_STRUCT input
       344 |         F32 IC
       348 |         F32 input
       352 |         BOOLEAN run
       353 |         BOOLEAN hold
       356 |       REINTICH_OUTPUT_STRUCT output
       356 |         F32 output
       360 |     REINTICHS_STRUCT reintichs
       360 |       REINTICHS_COEFF_STRUCT * coeff
       368 |       REINTICHS_STATE_STRUCT state
       368 |         F32 IC_delay
       372 |         F32 rail_bounce
       376 |         BOOLEAN prev_sat_UL
       377 |         BOOLEAN prev_sat_LL
       378 |         BOOLEAN prev_sat_inv
       379 |         BOOLEAN prev_reset_int
       380 |         BOOLEAN prev_reset_sat
       384 |         REINTICH_STRUCT integrator
       384 |           REINTICH_COEFF_STRUCT * coeff
       392 |           REINTICH_STATE_STRUCT state
       392 |             F32 delay
       396 |             BOOLEAN reset_on_init
       400 |           REINTICH_INPUT_STRUCT input
       400 |             F32 IC
       404 |             F32 input
       408 |             BOOLEAN run
       409 |             BOOLEAN hold
       412 |           REINTICH_OUTPUT_STRUCT output
       412 |             F32 output
       416 |         SATURATIONVF_STRUCT sat
       416 |           SATURATIONVF_COEFF_STRUCT * coeff
       424 |           SATURATIONVF_STATE_STRUCT state
       424 |             F32 delay
       428 |             BOOLEAN reset_on_init
       432 |           SATURATIONVF_INPUT_STRUCT input
       432 |             F32 IC
       436 |             F32 input
       440 |             BOOLEAN reset
       444 |           SATURATIONVF_OUTPUT_STRUCT output
       444 |             F32 output
       448 |             BOOLEAN inv
       449 |             BOOLEAN satLo
       450 |             BOOLEAN satHi
       456 |       REINTICHS_INPUT_STRUCT input
       456 |         F32 IC
       460 |         F32 input
       464 |         BOOLEAN run
       465 |         BOOLEAN hold
       468 |       REINTICHS_OUTPUT_STRUCT output
       468 |         F32 output
       472 |         BOOLEAN sat_UL
       473 |         BOOLEAN sat_LL
       474 |         BOOLEAN inv
       480 |     BOOLEAN prev_run
       481 |     BOOLEAN integ_sat
           | [sizeof=488, align=8]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_STATE_STRUCT
         0 |   F32 s1
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_INPUT_STRUCT
         0 |   BOOLEAN set
         1 |   BOOLEAN reset
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_OUTPUT_STRUCT
         0 |   BOOLEAN output
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_STRUCT
         0 |   ROS_FLIPFLOP_STATE_STRUCT state
         0 |     F32 s1
         4 |   ROS_FLIPFLOP_INPUT_STRUCT input
         4 |     BOOLEAN set
         5 |     BOOLEAN reset
         6 |   ROS_FLIPFLOP_OUTPUT_STRUCT output
         6 |     BOOLEAN output
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_COEFF_STRUCT
         0 |   F32 K_Ts
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_COEFF_STRUCT
         0 |   SWITCH_COMMON_COEFF_STRUCT common_coeff
         0 |     PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
         0 |       U32 P
         4 |       BOOLEAN ic
         5 |       BOOLEAN rising_edge
         6 |       BOOLEAN falling_edge
         8 |   REINTICH_COEFF_STRUCT first_integrator_coeff
         8 |     F32 K_Ts
        12 |   REINTICH_COEFF_STRUCT second_integrator_coeff
        12 |     F32 K_Ts
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_COEFF_STRUCT
         0 |   F32 epsilon
         4 |   F32 upper_sat_limit
         8 |   F32 lower_sat_limit
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_COEFF_STRUCT
         0 |   F32 K_Ts
         4 |   F32 Gain
         8 |   F32 UL
        12 |   F32 LL
        16 |   F32 rail_bounce_divisor
        20 |   REINTICH_COEFF_STRUCT integrator_coeff
        20 |     F32 K_Ts
        24 |   SATURATIONVF_COEFF_STRUCT sat_coeff
        24 |     F32 epsilon
        28 |     F32 upper_sat_limit
        32 |     F32 lower_sat_limit
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_COEFF_STRUCT
         0 |   F32 c_reintichs_IC
         4 |   F32 c_gamma
         8 |   F32 null_attitude
        12 |   F32 upper_sat_limit
        16 |   F32 lower_sat_limit
        20 |   F32 k_rate_to_ang_accel_cross
        24 |   F32 k_rate_to_ang_accel_uar
        28 |   F32 k_rate_to_ang_accel_normal
        32 |   F32 k_attitude_to_ang_accel_uar
        36 |   F32 k_attitude_to_ang_accel_normal
        40 |   F32 k_attitude_to_ang_accel_integral_normal
        44 |   F32 k_compensation
        48 |   F32 k_ang_accel_to_cyclic
        52 |   F32 k_integrator_curve_magnitude
        56 |   SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        56 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
        56 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        56 |         U32 P
        60 |         BOOLEAN ic
        61 |         BOOLEAN rising_edge
        62 |         BOOLEAN falling_edge
        64 |     REINTICH_COEFF_STRUCT first_integrator_coeff
        64 |       F32 K_Ts
        68 |     REINTICH_COEFF_STRUCT second_integrator_coeff
        68 |       F32 K_Ts
        72 |   SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        72 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
        72 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        72 |         U32 P
        76 |         BOOLEAN ic
        77 |         BOOLEAN rising_edge
        78 |         BOOLEAN falling_edge
        80 |     REINTICH_COEFF_STRUCT first_integrator_coeff
        80 |       F32 K_Ts
        84 |     REINTICH_COEFF_STRUCT second_integrator_coeff
        84 |       F32 K_Ts
        88 |   REINTICH_COEFF_STRUCT reintich
        88 |     F32 K_Ts
        92 |   REINTICHS_COEFF_STRUCT reintichs
        92 |     F32 K_Ts
        96 |     F32 Gain
       100 |     F32 UL
       104 |     F32 LL
       108 |     F32 rail_bounce_divisor
       112 |     REINTICH_COEFF_STRUCT integrator_coeff
       112 |       F32 K_Ts
       116 |     SATURATIONVF_COEFF_STRUCT sat_coeff
       116 |       F32 epsilon
       120 |       F32 upper_sat_limit
       124 |       F32 lower_sat_limit
       128 |   SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       128 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       128 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       128 |         U32 P
       132 |         BOOLEAN ic
       133 |         BOOLEAN rising_edge
       134 |         BOOLEAN falling_edge
       136 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       136 |       F32 K_Ts
       140 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       140 |       F32 K_Ts
           | [sizeof=144, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_COEFF_STRUCT
         0 |   F32 gain
         4 |   F32 bias
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | LINTERP_STRUCT
         0 |   U8 n_regions
         4 |   LINTERP_REGION_STRUCT [10] regions
           | [sizeof=124, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_COEFF_STRUCT
         0 |   F32 pitch_bias
         4 |   F32 roll_rate_limiter_upper_limit
         8 |   F32 roll_rate_limiter_lower_limit
        12 |   F32 pitch_rate_limiter_upper_limit
        16 |   F32 pitch_rate_limiter_lower_limit
        20 |   ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |     F32 c_reintichs_IC
        24 |     F32 c_gamma
        28 |     F32 null_attitude
        32 |     F32 upper_sat_limit
        36 |     F32 lower_sat_limit
        40 |     F32 k_rate_to_ang_accel_cross
        44 |     F32 k_rate_to_ang_accel_uar
        48 |     F32 k_rate_to_ang_accel_normal
        52 |     F32 k_attitude_to_ang_accel_uar
        56 |     F32 k_attitude_to_ang_accel_normal
        60 |     F32 k_attitude_to_ang_accel_integral_normal
        64 |     F32 k_compensation
        68 |     F32 k_ang_accel_to_cyclic
        72 |     F32 k_integrator_curve_magnitude
        76 |     SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        76 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
        76 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        76 |           U32 P
        80 |           BOOLEAN ic
        81 |           BOOLEAN rising_edge
        82 |           BOOLEAN falling_edge
        84 |       REINTICH_COEFF_STRUCT first_integrator_coeff
        84 |         F32 K_Ts
        88 |       REINTICH_COEFF_STRUCT second_integrator_coeff
        88 |         F32 K_Ts
        92 |     SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        92 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
        92 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        92 |           U32 P
        96 |           BOOLEAN ic
        97 |           BOOLEAN rising_edge
        98 |           BOOLEAN falling_edge
       100 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       100 |         F32 K_Ts
       104 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       104 |         F32 K_Ts
       108 |     REINTICH_COEFF_STRUCT reintich
       108 |       F32 K_Ts
       112 |     REINTICHS_COEFF_STRUCT reintichs
       112 |       F32 K_Ts
       116 |       F32 Gain
       120 |       F32 UL
       124 |       F32 LL
       128 |       F32 rail_bounce_divisor
       132 |       REINTICH_COEFF_STRUCT integrator_coeff
       132 |         F32 K_Ts
       136 |       SATURATIONVF_COEFF_STRUCT sat_coeff
       136 |         F32 epsilon
       140 |         F32 upper_sat_limit
       144 |         F32 lower_sat_limit
       148 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       148 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       148 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       148 |           U32 P
       152 |           BOOLEAN ic
       153 |           BOOLEAN rising_edge
       154 |           BOOLEAN falling_edge
       156 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       156 |         F32 K_Ts
       160 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       160 |         F32 K_Ts
       164 |   ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       164 |     F32 c_reintichs_IC
       168 |     F32 c_gamma
       172 |     F32 null_attitude
       176 |     F32 upper_sat_limit
       180 |     F32 lower_sat_limit
       184 |     F32 k_rate_to_ang_accel_cross
       188 |     F32 k_rate_to_ang_accel_uar
       192 |     F32 k_rate_to_ang_accel_normal
       196 |     F32 k_attitude_to_ang_accel_uar
       200 |     F32 k_attitude_to_ang_accel_normal
       204 |     F32 k_attitude_to_ang_accel_integral_normal
       208 |     F32 k_compensation
       212 |     F32 k_ang_accel_to_cyclic
       216 |     F32 k_integrator_curve_magnitude
       220 |     SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
       220 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       220 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       220 |           U32 P
       224 |           BOOLEAN ic
       225 |           BOOLEAN rising_edge
       226 |           BOOLEAN falling_edge
       228 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       228 |         F32 K_Ts
       232 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       232 |         F32 K_Ts
       236 |     SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
       236 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       236 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       236 |           U32 P
       240 |           BOOLEAN ic
       241 |           BOOLEAN rising_edge
       242 |           BOOLEAN falling_edge
       244 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       244 |         F32 K_Ts
       248 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       248 |         F32 K_Ts
       252 |     REINTICH_COEFF_STRUCT reintich
       252 |       F32 K_Ts
       256 |     REINTICHS_COEFF_STRUCT reintichs
       256 |       F32 K_Ts
       260 |       F32 Gain
       264 |       F32 UL
       268 |       F32 LL
       272 |       F32 rail_bounce_divisor
       276 |       REINTICH_COEFF_STRUCT integrator_coeff
       276 |         F32 K_Ts
       280 |       SATURATIONVF_COEFF_STRUCT sat_coeff
       280 |         F32 epsilon
       284 |         F32 upper_sat_limit
       288 |         F32 lower_sat_limit
       292 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       292 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       292 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       292 |           U32 P
       296 |           BOOLEAN ic
       297 |           BOOLEAN rising_edge
       298 |           BOOLEAN falling_edge
       300 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       300 |         F32 K_Ts
       304 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       304 |         F32 K_Ts
       308 |   SWITCH_SECOND_ORDER_COEFF_STRUCT adp_roll_cmd_switch
       308 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       308 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       308 |         U32 P
       312 |         BOOLEAN ic
       313 |         BOOLEAN rising_edge
       314 |         BOOLEAN falling_edge
       316 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       316 |       F32 K_Ts
       320 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       320 |       F32 K_Ts
       324 |   SWITCH_SECOND_ORDER_COEFF_STRUCT adp_pitch_cmd_switch
       324 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       324 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       324 |         U32 P
       328 |         BOOLEAN ic
       329 |         BOOLEAN rising_edge
       330 |         BOOLEAN falling_edge
       332 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       332 |       F32 K_Ts
       336 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       336 |       F32 K_Ts
       340 |   TEST_PORT_COEFF_STRUCT roll_testport
       340 |     F32 gain
       344 |     F32 bias
       348 |   TEST_PORT_COEFF_STRUCT pitch_testport
       348 |     F32 gain
       352 |     F32 bias
       356 |   F32 K_heading_rate_to_ang_accel_uar
       360 |   SWITCH_SECOND_ORDER_COEFF_STRUCT heading_rate_switch
       360 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       360 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       360 |         U32 P
       364 |         BOOLEAN ic
       365 |         BOOLEAN rising_edge
       366 |         BOOLEAN falling_edge
       368 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       368 |       F32 K_Ts
       372 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       372 |       F32 K_Ts
       376 |   LINTERP_STRUCT pitch_bias_linterp
       376 |     U8 n_regions
       380 |     LINTERP_REGION_STRUCT [10] regions
       500 |   F32 tune_mode
           | [sizeof=504, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_STRUCT
         0 |   F32 roll
         4 |   F32 pitch
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_INPUT_STRUCT
         0 |   F32 input
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_STRUCT
         0 |   TEST_PORT_COEFF_STRUCT * coeff
         8 |   TEST_PORT_INPUT_STRUCT input
         8 |     F32 input
        12 |   TEST_PORT_OUTPUT_STRUCT output
        12 |     F32 output
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_STATE_STRUCT
         0 |   ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         0 |     ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
         8 |     ATTITUDE_CONTROLLER_INPUT_STRUCT input
         8 |       F32 rate_cross_axis
        12 |       F32 rate_near_axis
        16 |       F32 attitude_near_axis
        20 |       F32 adp_roll_cmd
        24 |       F32 adp_pitch_cmd
        28 |       BOOLEAN run_mode
        29 |       BOOLEAN uar_mode
        32 |     ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        32 |       F32 output
        40 |     ATTITUDE_CONTROLLER_STATE_STRUCT state
        40 |       SWITCH_SECOND_ORDER_STRUCT rate_switch
        40 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        48 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
        48 |           SWITCH_COMMON_STRUCT common
        48 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        56 |             SWITCH_COMMON_STATE_STRUCT state
        56 |               PERSISTENT1SHOT_STRUCT transition_one_shot
        56 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        64 |                 PERSISTENT1SHOT_STATE_STRUCT state
        64 |                   BOOLEAN init
        68 |                   U32 iteration
        72 |                   BOOLEAN prev_input
        76 |                 PERSISTENT1SHOT_INPUT_STRUCT input
        76 |                   BOOLEAN input
        77 |                   BOOLEAN reset
        78 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
        78 |                   BOOLEAN output
        80 |               F32 output_previous
        84 |               F32 transition_deviation_latched
        88 |               F32 selected_input
        96 |           REINTICH_STRUCT first_integrator
        96 |             REINTICH_COEFF_STRUCT * coeff
       104 |             REINTICH_STATE_STRUCT state
       104 |               F32 delay
       108 |               BOOLEAN reset_on_init
       112 |             REINTICH_INPUT_STRUCT input
       112 |               F32 IC
       116 |               F32 input
       120 |               BOOLEAN run
       121 |               BOOLEAN hold
       124 |             REINTICH_OUTPUT_STRUCT output
       124 |               F32 output
       128 |           REINTICH_STRUCT second_integrator
       128 |             REINTICH_COEFF_STRUCT * coeff
       136 |             REINTICH_STATE_STRUCT state
       136 |               F32 delay
       140 |               BOOLEAN reset_on_init
       144 |             REINTICH_INPUT_STRUCT input
       144 |               F32 IC
       148 |               F32 input
       152 |               BOOLEAN run
       153 |               BOOLEAN hold
       156 |             REINTICH_OUTPUT_STRUCT output
       156 |               F32 output
       160 |           F32 first_feedback_delay
       164 |           F32 second_feedback_delay
       168 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       168 |           F32 input_one
       172 |           F32 input_two
       176 |           BOOLEAN switch_flag
       180 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       180 |           F32 output
       184 |       SWITCH_SECOND_ORDER_STRUCT attitude_switch
       184 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       192 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
       192 |           SWITCH_COMMON_STRUCT common
       192 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       200 |             SWITCH_COMMON_STATE_STRUCT state
       200 |               PERSISTENT1SHOT_STRUCT transition_one_shot
       200 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       208 |                 PERSISTENT1SHOT_STATE_STRUCT state
       208 |                   BOOLEAN init
       212 |                   U32 iteration
       216 |                   BOOLEAN prev_input
       220 |                 PERSISTENT1SHOT_INPUT_STRUCT input
       220 |                   BOOLEAN input
       221 |                   BOOLEAN reset
       222 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
       222 |                   BOOLEAN output
       224 |               F32 output_previous
       228 |               F32 transition_deviation_latched
       232 |               F32 selected_input
       240 |           REINTICH_STRUCT first_integrator
       240 |             REINTICH_COEFF_STRUCT * coeff
       248 |             REINTICH_STATE_STRUCT state
       248 |               F32 delay
       252 |               BOOLEAN reset_on_init
       256 |             REINTICH_INPUT_STRUCT input
       256 |               F32 IC
       260 |               F32 input
       264 |               BOOLEAN run
       265 |               BOOLEAN hold
       268 |             REINTICH_OUTPUT_STRUCT output
       268 |               F32 output
       272 |           REINTICH_STRUCT second_integrator
       272 |             REINTICH_COEFF_STRUCT * coeff
       280 |             REINTICH_STATE_STRUCT state
       280 |               F32 delay
       284 |               BOOLEAN reset_on_init
       288 |             REINTICH_INPUT_STRUCT input
       288 |               F32 IC
       292 |               F32 input
       296 |               BOOLEAN run
       297 |               BOOLEAN hold
       300 |             REINTICH_OUTPUT_STRUCT output
       300 |               F32 output
       304 |           F32 first_feedback_delay
       308 |           F32 second_feedback_delay
       312 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       312 |           F32 input_one
       316 |           F32 input_two
       320 |           BOOLEAN switch_flag
       324 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       324 |           F32 output
       328 |       REINTICH_STRUCT reintich
       328 |         REINTICH_COEFF_STRUCT * coeff
       336 |         REINTICH_STATE_STRUCT state
       336 |           F32 delay
       340 |           BOOLEAN reset_on_init
       344 |         REINTICH_INPUT_STRUCT input
       344 |           F32 IC
       348 |           F32 input
       352 |           BOOLEAN run
       353 |           BOOLEAN hold
       356 |         REINTICH_OUTPUT_STRUCT output
       356 |           F32 output
       360 |       REINTICHS_STRUCT reintichs
       360 |         REINTICHS_COEFF_STRUCT * coeff
       368 |         REINTICHS_STATE_STRUCT state
       368 |           F32 IC_delay
       372 |           F32 rail_bounce
       376 |           BOOLEAN prev_sat_UL
       377 |           BOOLEAN prev_sat_LL
       378 |           BOOLEAN prev_sat_inv
       379 |           BOOLEAN prev_reset_int
       380 |           BOOLEAN prev_reset_sat
       384 |           REINTICH_STRUCT integrator
       384 |             REINTICH_COEFF_STRUCT * coeff
       392 |             REINTICH_STATE_STRUCT state
       392 |               F32 delay
       396 |               BOOLEAN reset_on_init
       400 |             REINTICH_INPUT_STRUCT input
       400 |               F32 IC
       404 |               F32 input
       408 |               BOOLEAN run
       409 |               BOOLEAN hold
       412 |             REINTICH_OUTPUT_STRUCT output
       412 |               F32 output
       416 |           SATURATIONVF_STRUCT sat
       416 |             SATURATIONVF_COEFF_STRUCT * coeff
       424 |             SATURATIONVF_STATE_STRUCT state
       424 |               F32 delay
       428 |               BOOLEAN reset_on_init
       432 |             SATURATIONVF_INPUT_STRUCT input
       432 |               F32 IC
       436 |               F32 input
       440 |               BOOLEAN reset
       444 |             SATURATIONVF_OUTPUT_STRUCT output
       444 |               F32 output
       448 |               BOOLEAN inv
       449 |               BOOLEAN satLo
       450 |               BOOLEAN satHi
       456 |         REINTICHS_INPUT_STRUCT input
       456 |           F32 IC
       460 |           F32 input
       464 |           BOOLEAN run
       465 |           BOOLEAN hold
       468 |         REINTICHS_OUTPUT_STRUCT output
       468 |           F32 output
       472 |           BOOLEAN sat_UL
       473 |           BOOLEAN sat_LL
       474 |           BOOLEAN inv
       480 |       BOOLEAN prev_run
       481 |       BOOLEAN integ_sat
       488 |   ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       488 |     ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       496 |     ATTITUDE_CONTROLLER_INPUT_STRUCT input
       496 |       F32 rate_cross_axis
       500 |       F32 rate_near_axis
       504 |       F32 attitude_near_axis
       508 |       F32 adp_roll_cmd
       512 |       F32 adp_pitch_cmd
       516 |       BOOLEAN run_mode
       517 |       BOOLEAN uar_mode
       520 |     ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       520 |       F32 output
       528 |     ATTITUDE_CONTROLLER_STATE_STRUCT state
       528 |       SWITCH_SECOND_ORDER_STRUCT rate_switch
       528 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       536 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
       536 |           SWITCH_COMMON_STRUCT common
       536 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       544 |             SWITCH_COMMON_STATE_STRUCT state
       544 |               PERSISTENT1SHOT_STRUCT transition_one_shot
       544 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       552 |                 PERSISTENT1SHOT_STATE_STRUCT state
       552 |                   BOOLEAN init
       556 |                   U32 iteration
       560 |                   BOOLEAN prev_input
       564 |                 PERSISTENT1SHOT_INPUT_STRUCT input
       564 |                   BOOLEAN input
       565 |                   BOOLEAN reset
       566 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
       566 |                   BOOLEAN output
       568 |               F32 output_previous
       572 |               F32 transition_deviation_latched
       576 |               F32 selected_input
       584 |           REINTICH_STRUCT first_integrator
       584 |             REINTICH_COEFF_STRUCT * coeff
       592 |             REINTICH_STATE_STRUCT state
       592 |               F32 delay
       596 |               BOOLEAN reset_on_init
       600 |             REINTICH_INPUT_STRUCT input
       600 |               F32 IC
       604 |               F32 input
       608 |               BOOLEAN run
       609 |               BOOLEAN hold
       612 |             REINTICH_OUTPUT_STRUCT output
       612 |               F32 output
       616 |           REINTICH_STRUCT second_integrator
       616 |             REINTICH_COEFF_STRUCT * coeff
       624 |             REINTICH_STATE_STRUCT state
       624 |               F32 delay
       628 |               BOOLEAN reset_on_init
       632 |             REINTICH_INPUT_STRUCT input
       632 |               F32 IC
       636 |               F32 input
       640 |               BOOLEAN run
       641 |               BOOLEAN hold
       644 |             REINTICH_OUTPUT_STRUCT output
       644 |               F32 output
       648 |           F32 first_feedback_delay
       652 |           F32 second_feedback_delay
       656 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       656 |           F32 input_one
       660 |           F32 input_two
       664 |           BOOLEAN switch_flag
       668 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       668 |           F32 output
       672 |       SWITCH_SECOND_ORDER_STRUCT attitude_switch
       672 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       680 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
       680 |           SWITCH_COMMON_STRUCT common
       680 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       688 |             SWITCH_COMMON_STATE_STRUCT state
       688 |               PERSISTENT1SHOT_STRUCT transition_one_shot
       688 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       696 |                 PERSISTENT1SHOT_STATE_STRUCT state
       696 |                   BOOLEAN init
       700 |                   U32 iteration
       704 |                   BOOLEAN prev_input
       708 |                 PERSISTENT1SHOT_INPUT_STRUCT input
       708 |                   BOOLEAN input
       709 |                   BOOLEAN reset
       710 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
       710 |                   BOOLEAN output
       712 |               F32 output_previous
       716 |               F32 transition_deviation_latched
       720 |               F32 selected_input
       728 |           REINTICH_STRUCT first_integrator
       728 |             REINTICH_COEFF_STRUCT * coeff
       736 |             REINTICH_STATE_STRUCT state
       736 |               F32 delay
       740 |               BOOLEAN reset_on_init
       744 |             REINTICH_INPUT_STRUCT input
       744 |               F32 IC
       748 |               F32 input
       752 |               BOOLEAN run
       753 |               BOOLEAN hold
       756 |             REINTICH_OUTPUT_STRUCT output
       756 |               F32 output
       760 |           REINTICH_STRUCT second_integrator
       760 |             REINTICH_COEFF_STRUCT * coeff
       768 |             REINTICH_STATE_STRUCT state
       768 |               F32 delay
       772 |               BOOLEAN reset_on_init
       776 |             REINTICH_INPUT_STRUCT input
       776 |               F32 IC
       780 |               F32 input
       784 |               BOOLEAN run
       785 |               BOOLEAN hold
       788 |             REINTICH_OUTPUT_STRUCT output
       788 |               F32 output
       792 |           F32 first_feedback_delay
       796 |           F32 second_feedback_delay
       800 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       800 |           F32 input_one
       804 |           F32 input_two
       808 |           BOOLEAN switch_flag
       812 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       812 |           F32 output
       816 |       REINTICH_STRUCT reintich
       816 |         REINTICH_COEFF_STRUCT * coeff
       824 |         REINTICH_STATE_STRUCT state
       824 |           F32 delay
       828 |           BOOLEAN reset_on_init
       832 |         REINTICH_INPUT_STRUCT input
       832 |           F32 IC
       836 |           F32 input
       840 |           BOOLEAN run
       841 |           BOOLEAN hold
       844 |         REINTICH_OUTPUT_STRUCT output
       844 |           F32 output
       848 |       REINTICHS_STRUCT reintichs
       848 |         REINTICHS_COEFF_STRUCT * coeff
       856 |         REINTICHS_STATE_STRUCT state
       856 |           F32 IC_delay
       860 |           F32 rail_bounce
       864 |           BOOLEAN prev_sat_UL
       865 |           BOOLEAN prev_sat_LL
       866 |           BOOLEAN prev_sat_inv
       867 |           BOOLEAN prev_reset_int
       868 |           BOOLEAN prev_reset_sat
       872 |           REINTICH_STRUCT integrator
       872 |             REINTICH_COEFF_STRUCT * coeff
       880 |             REINTICH_STATE_STRUCT state
       880 |               F32 delay
       884 |               BOOLEAN reset_on_init
       888 |             REINTICH_INPUT_STRUCT input
       888 |               F32 IC
       892 |               F32 input
       896 |               BOOLEAN run
       897 |               BOOLEAN hold
       900 |             REINTICH_OUTPUT_STRUCT output
       900 |               F32 output
       904 |           SATURATIONVF_STRUCT sat
       904 |             SATURATIONVF_COEFF_STRUCT * coeff
       912 |             SATURATIONVF_STATE_STRUCT state
       912 |               F32 delay
       916 |               BOOLEAN reset_on_init
       920 |             SATURATIONVF_INPUT_STRUCT input
       920 |               F32 IC
       924 |               F32 input
       928 |               BOOLEAN reset
       932 |             SATURATIONVF_OUTPUT_STRUCT output
       932 |               F32 output
       936 |               BOOLEAN inv
       937 |               BOOLEAN satLo
       938 |               BOOLEAN satHi
       944 |         REINTICHS_INPUT_STRUCT input
       944 |           F32 IC
       948 |           F32 input
       952 |           BOOLEAN run
       953 |           BOOLEAN hold
       956 |         REINTICHS_OUTPUT_STRUCT output
       956 |           F32 output
       960 |           BOOLEAN sat_UL
       961 |           BOOLEAN sat_LL
       962 |           BOOLEAN inv
       968 |       BOOLEAN prev_run
       969 |       BOOLEAN integ_sat
       976 |   F32 roll_rate_limiter_previous_state
       980 |   F32 pitch_rate_limiter_previous_state
       984 |   SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
       984 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       992 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
       992 |       SWITCH_COMMON_STRUCT common
       992 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1000 |         SWITCH_COMMON_STATE_STRUCT state
      1000 |           PERSISTENT1SHOT_STRUCT transition_one_shot
      1000 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1008 |             PERSISTENT1SHOT_STATE_STRUCT state
      1008 |               BOOLEAN init
      1012 |               U32 iteration
      1016 |               BOOLEAN prev_input
      1020 |             PERSISTENT1SHOT_INPUT_STRUCT input
      1020 |               BOOLEAN input
      1021 |               BOOLEAN reset
      1022 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
      1022 |               BOOLEAN output
      1024 |           F32 output_previous
      1028 |           F32 transition_deviation_latched
      1032 |           F32 selected_input
      1040 |       REINTICH_STRUCT first_integrator
      1040 |         REINTICH_COEFF_STRUCT * coeff
      1048 |         REINTICH_STATE_STRUCT state
      1048 |           F32 delay
      1052 |           BOOLEAN reset_on_init
      1056 |         REINTICH_INPUT_STRUCT input
      1056 |           F32 IC
      1060 |           F32 input
      1064 |           BOOLEAN run
      1065 |           BOOLEAN hold
      1068 |         REINTICH_OUTPUT_STRUCT output
      1068 |           F32 output
      1072 |       REINTICH_STRUCT second_integrator
      1072 |         REINTICH_COEFF_STRUCT * coeff
      1080 |         REINTICH_STATE_STRUCT state
      1080 |           F32 delay
      1084 |           BOOLEAN reset_on_init
      1088 |         REINTICH_INPUT_STRUCT input
      1088 |           F32 IC
      1092 |           F32 input
      1096 |           BOOLEAN run
      1097 |           BOOLEAN hold
      1100 |         REINTICH_OUTPUT_STRUCT output
      1100 |           F32 output
      1104 |       F32 first_feedback_delay
      1108 |       F32 second_feedback_delay
      1112 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1112 |       F32 input_one
      1116 |       F32 input_two
      1120 |       BOOLEAN switch_flag
      1124 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1124 |       F32 output
      1128 |   SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1128 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1136 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
      1136 |       SWITCH_COMMON_STRUCT common
      1136 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1144 |         SWITCH_COMMON_STATE_STRUCT state
      1144 |           PERSISTENT1SHOT_STRUCT transition_one_shot
      1144 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1152 |             PERSISTENT1SHOT_STATE_STRUCT state
      1152 |               BOOLEAN init
      1156 |               U32 iteration
      1160 |               BOOLEAN prev_input
      1164 |             PERSISTENT1SHOT_INPUT_STRUCT input
      1164 |               BOOLEAN input
      1165 |               BOOLEAN reset
      1166 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
      1166 |               BOOLEAN output
      1168 |           F32 output_previous
      1172 |           F32 transition_deviation_latched
      1176 |           F32 selected_input
      1184 |       REINTICH_STRUCT first_integrator
      1184 |         REINTICH_COEFF_STRUCT * coeff
      1192 |         REINTICH_STATE_STRUCT state
      1192 |           F32 delay
      1196 |           BOOLEAN reset_on_init
      1200 |         REINTICH_INPUT_STRUCT input
      1200 |           F32 IC
      1204 |           F32 input
      1208 |           BOOLEAN run
      1209 |           BOOLEAN hold
      1212 |         REINTICH_OUTPUT_STRUCT output
      1212 |           F32 output
      1216 |       REINTICH_STRUCT second_integrator
      1216 |         REINTICH_COEFF_STRUCT * coeff
      1224 |         REINTICH_STATE_STRUCT state
      1224 |           F32 delay
      1228 |           BOOLEAN reset_on_init
      1232 |         REINTICH_INPUT_STRUCT input
      1232 |           F32 IC
      1236 |           F32 input
      1240 |           BOOLEAN run
      1241 |           BOOLEAN hold
      1244 |         REINTICH_OUTPUT_STRUCT output
      1244 |           F32 output
      1248 |       F32 first_feedback_delay
      1252 |       F32 second_feedback_delay
      1256 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1256 |       F32 input_one
      1260 |       F32 input_two
      1264 |       BOOLEAN switch_flag
      1268 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1268 |       F32 output
      1272 |   TEST_PORT_STRUCT roll_testport
      1272 |     TEST_PORT_COEFF_STRUCT * coeff
      1280 |     TEST_PORT_INPUT_STRUCT input
      1280 |       F32 input
      1284 |     TEST_PORT_OUTPUT_STRUCT output
      1284 |       F32 output
      1288 |   TEST_PORT_STRUCT pitch_testport
      1288 |     TEST_PORT_COEFF_STRUCT * coeff
      1296 |     TEST_PORT_INPUT_STRUCT input
      1296 |       F32 input
      1300 |     TEST_PORT_OUTPUT_STRUCT output
      1300 |       F32 output
      1304 |   BOOLEAN first_frame
      1305 |   BOOLEAN adp_roll_rate_limited
      1306 |   BOOLEAN adp_pitch_rate_limited
      1312 |   SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1312 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1320 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
      1320 |       SWITCH_COMMON_STRUCT common
      1320 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1328 |         SWITCH_COMMON_STATE_STRUCT state
      1328 |           PERSISTENT1SHOT_STRUCT transition_one_shot
      1328 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1336 |             PERSISTENT1SHOT_STATE_STRUCT state
      1336 |               BOOLEAN init
      1340 |               U32 iteration
      1344 |               BOOLEAN prev_input
      1348 |             PERSISTENT1SHOT_INPUT_STRUCT input
      1348 |               BOOLEAN input
      1349 |               BOOLEAN reset
      1350 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
      1350 |               BOOLEAN output
      1352 |           F32 output_previous
      1356 |           F32 transition_deviation_latched
      1360 |           F32 selected_input
      1368 |       REINTICH_STRUCT first_integrator
      1368 |         REINTICH_COEFF_STRUCT * coeff
      1376 |         REINTICH_STATE_STRUCT state
      1376 |           F32 delay
      1380 |           BOOLEAN reset_on_init
      1384 |         REINTICH_INPUT_STRUCT input
      1384 |           F32 IC
      1388 |           F32 input
      1392 |           BOOLEAN run
      1393 |           BOOLEAN hold
      1396 |         REINTICH_OUTPUT_STRUCT output
      1396 |           F32 output
      1400 |       REINTICH_STRUCT second_integrator
      1400 |         REINTICH_COEFF_STRUCT * coeff
      1408 |         REINTICH_STATE_STRUCT state
      1408 |           F32 delay
      1412 |           BOOLEAN reset_on_init
      1416 |         REINTICH_INPUT_STRUCT input
      1416 |           F32 IC
      1420 |           F32 input
      1424 |           BOOLEAN run
      1425 |           BOOLEAN hold
      1428 |         REINTICH_OUTPUT_STRUCT output
      1428 |           F32 output
      1432 |       F32 first_feedback_delay
      1436 |       F32 second_feedback_delay
      1440 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1440 |       F32 input_one
      1444 |       F32 input_two
      1448 |       BOOLEAN switch_flag
      1452 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1452 |       F32 output
      1456 |   F32 switched_heading_rate
      1460 |   F32 roll_test_input
      1464 |   F32 pitch_test_input
           | [sizeof=1472, align=8]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_INPUT_STRUCT
         0 |   F32 adp_phi_cmd
         4 |   F32 adp_theta_cmd
         8 |   F32 phi
        12 |   F32 phi_dot
        16 |   F32 psi_dot
        20 |   F32 theta
        24 |   F32 theta_dot
        28 |   F32 p
        32 |   F32 q
        36 |   BOOLEAN reset
        37 |   BOOLEAN UAR_mode
        38 |   BOOLEAN triplex_fault
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_STRUCT
         0 |   CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
         8 |   CYCLIC_FEEDBACK_STATE_STRUCT state
         8 |     ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         8 |       ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        16 |       ATTITUDE_CONTROLLER_INPUT_STRUCT input
        16 |         F32 rate_cross_axis
        20 |         F32 rate_near_axis
        24 |         F32 attitude_near_axis
        28 |         F32 adp_roll_cmd
        32 |         F32 adp_pitch_cmd
        36 |         BOOLEAN run_mode
        37 |         BOOLEAN uar_mode
        40 |       ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        40 |         F32 output
        48 |       ATTITUDE_CONTROLLER_STATE_STRUCT state
        48 |         SWITCH_SECOND_ORDER_STRUCT rate_switch
        48 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        56 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
        56 |             SWITCH_COMMON_STRUCT common
        56 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        64 |               SWITCH_COMMON_STATE_STRUCT state
        64 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
        64 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        72 |                   PERSISTENT1SHOT_STATE_STRUCT state
        72 |                     BOOLEAN init
        76 |                     U32 iteration
        80 |                     BOOLEAN prev_input
        84 |                   PERSISTENT1SHOT_INPUT_STRUCT input
        84 |                     BOOLEAN input
        85 |                     BOOLEAN reset
        86 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
        86 |                     BOOLEAN output
        88 |                 F32 output_previous
        92 |                 F32 transition_deviation_latched
        96 |                 F32 selected_input
       104 |             REINTICH_STRUCT first_integrator
       104 |               REINTICH_COEFF_STRUCT * coeff
       112 |               REINTICH_STATE_STRUCT state
       112 |                 F32 delay
       116 |                 BOOLEAN reset_on_init
       120 |               REINTICH_INPUT_STRUCT input
       120 |                 F32 IC
       124 |                 F32 input
       128 |                 BOOLEAN run
       129 |                 BOOLEAN hold
       132 |               REINTICH_OUTPUT_STRUCT output
       132 |                 F32 output
       136 |             REINTICH_STRUCT second_integrator
       136 |               REINTICH_COEFF_STRUCT * coeff
       144 |               REINTICH_STATE_STRUCT state
       144 |                 F32 delay
       148 |                 BOOLEAN reset_on_init
       152 |               REINTICH_INPUT_STRUCT input
       152 |                 F32 IC
       156 |                 F32 input
       160 |                 BOOLEAN run
       161 |                 BOOLEAN hold
       164 |               REINTICH_OUTPUT_STRUCT output
       164 |                 F32 output
       168 |             F32 first_feedback_delay
       172 |             F32 second_feedback_delay
       176 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       176 |             F32 input_one
       180 |             F32 input_two
       184 |             BOOLEAN switch_flag
       188 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       188 |             F32 output
       192 |         SWITCH_SECOND_ORDER_STRUCT attitude_switch
       192 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       200 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
       200 |             SWITCH_COMMON_STRUCT common
       200 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       208 |               SWITCH_COMMON_STATE_STRUCT state
       208 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
       208 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       216 |                   PERSISTENT1SHOT_STATE_STRUCT state
       216 |                     BOOLEAN init
       220 |                     U32 iteration
       224 |                     BOOLEAN prev_input
       228 |                   PERSISTENT1SHOT_INPUT_STRUCT input
       228 |                     BOOLEAN input
       229 |                     BOOLEAN reset
       230 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
       230 |                     BOOLEAN output
       232 |                 F32 output_previous
       236 |                 F32 transition_deviation_latched
       240 |                 F32 selected_input
       248 |             REINTICH_STRUCT first_integrator
       248 |               REINTICH_COEFF_STRUCT * coeff
       256 |               REINTICH_STATE_STRUCT state
       256 |                 F32 delay
       260 |                 BOOLEAN reset_on_init
       264 |               REINTICH_INPUT_STRUCT input
       264 |                 F32 IC
       268 |                 F32 input
       272 |                 BOOLEAN run
       273 |                 BOOLEAN hold
       276 |               REINTICH_OUTPUT_STRUCT output
       276 |                 F32 output
       280 |             REINTICH_STRUCT second_integrator
       280 |               REINTICH_COEFF_STRUCT * coeff
       288 |               REINTICH_STATE_STRUCT state
       288 |                 F32 delay
       292 |                 BOOLEAN reset_on_init
       296 |               REINTICH_INPUT_STRUCT input
       296 |                 F32 IC
       300 |                 F32 input
       304 |                 BOOLEAN run
       305 |                 BOOLEAN hold
       308 |               REINTICH_OUTPUT_STRUCT output
       308 |                 F32 output
       312 |             F32 first_feedback_delay
       316 |             F32 second_feedback_delay
       320 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       320 |             F32 input_one
       324 |             F32 input_two
       328 |             BOOLEAN switch_flag
       332 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       332 |             F32 output
       336 |         REINTICH_STRUCT reintich
       336 |           REINTICH_COEFF_STRUCT * coeff
       344 |           REINTICH_STATE_STRUCT state
       344 |             F32 delay
       348 |             BOOLEAN reset_on_init
       352 |           REINTICH_INPUT_STRUCT input
       352 |             F32 IC
       356 |             F32 input
       360 |             BOOLEAN run
       361 |             BOOLEAN hold
       364 |           REINTICH_OUTPUT_STRUCT output
       364 |             F32 output
       368 |         REINTICHS_STRUCT reintichs
       368 |           REINTICHS_COEFF_STRUCT * coeff
       376 |           REINTICHS_STATE_STRUCT state
       376 |             F32 IC_delay
       380 |             F32 rail_bounce
       384 |             BOOLEAN prev_sat_UL
       385 |             BOOLEAN prev_sat_LL
       386 |             BOOLEAN prev_sat_inv
       387 |             BOOLEAN prev_reset_int
       388 |             BOOLEAN prev_reset_sat
       392 |             REINTICH_STRUCT integrator
       392 |               REINTICH_COEFF_STRUCT * coeff
       400 |               REINTICH_STATE_STRUCT state
       400 |                 F32 delay
       404 |                 BOOLEAN reset_on_init
       408 |               REINTICH_INPUT_STRUCT input
       408 |                 F32 IC
       412 |                 F32 input
       416 |                 BOOLEAN run
       417 |                 BOOLEAN hold
       420 |               REINTICH_OUTPUT_STRUCT output
       420 |                 F32 output
       424 |             SATURATIONVF_STRUCT sat
       424 |               SATURATIONVF_COEFF_STRUCT * coeff
       432 |               SATURATIONVF_STATE_STRUCT state
       432 |                 F32 delay
       436 |                 BOOLEAN reset_on_init
       440 |               SATURATIONVF_INPUT_STRUCT input
       440 |                 F32 IC
       444 |                 F32 input
       448 |                 BOOLEAN reset
       452 |               SATURATIONVF_OUTPUT_STRUCT output
       452 |                 F32 output
       456 |                 BOOLEAN inv
       457 |                 BOOLEAN satLo
       458 |                 BOOLEAN satHi
       464 |           REINTICHS_INPUT_STRUCT input
       464 |             F32 IC
       468 |             F32 input
       472 |             BOOLEAN run
       473 |             BOOLEAN hold
       476 |           REINTICHS_OUTPUT_STRUCT output
       476 |             F32 output
       480 |             BOOLEAN sat_UL
       481 |             BOOLEAN sat_LL
       482 |             BOOLEAN inv
       488 |         BOOLEAN prev_run
       489 |         BOOLEAN integ_sat
       496 |     ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       496 |       ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       504 |       ATTITUDE_CONTROLLER_INPUT_STRUCT input
       504 |         F32 rate_cross_axis
       508 |         F32 rate_near_axis
       512 |         F32 attitude_near_axis
       516 |         F32 adp_roll_cmd
       520 |         F32 adp_pitch_cmd
       524 |         BOOLEAN run_mode
       525 |         BOOLEAN uar_mode
       528 |       ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       528 |         F32 output
       536 |       ATTITUDE_CONTROLLER_STATE_STRUCT state
       536 |         SWITCH_SECOND_ORDER_STRUCT rate_switch
       536 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       544 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
       544 |             SWITCH_COMMON_STRUCT common
       544 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       552 |               SWITCH_COMMON_STATE_STRUCT state
       552 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
       552 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       560 |                   PERSISTENT1SHOT_STATE_STRUCT state
       560 |                     BOOLEAN init
       564 |                     U32 iteration
       568 |                     BOOLEAN prev_input
       572 |                   PERSISTENT1SHOT_INPUT_STRUCT input
       572 |                     BOOLEAN input
       573 |                     BOOLEAN reset
       574 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
       574 |                     BOOLEAN output
       576 |                 F32 output_previous
       580 |                 F32 transition_deviation_latched
       584 |                 F32 selected_input
       592 |             REINTICH_STRUCT first_integrator
       592 |               REINTICH_COEFF_STRUCT * coeff
       600 |               REINTICH_STATE_STRUCT state
       600 |                 F32 delay
       604 |                 BOOLEAN reset_on_init
       608 |               REINTICH_INPUT_STRUCT input
       608 |                 F32 IC
       612 |                 F32 input
       616 |                 BOOLEAN run
       617 |                 BOOLEAN hold
       620 |               REINTICH_OUTPUT_STRUCT output
       620 |                 F32 output
       624 |             REINTICH_STRUCT second_integrator
       624 |               REINTICH_COEFF_STRUCT * coeff
       632 |               REINTICH_STATE_STRUCT state
       632 |                 F32 delay
       636 |                 BOOLEAN reset_on_init
       640 |               REINTICH_INPUT_STRUCT input
       640 |                 F32 IC
       644 |                 F32 input
       648 |                 BOOLEAN run
       649 |                 BOOLEAN hold
       652 |               REINTICH_OUTPUT_STRUCT output
       652 |                 F32 output
       656 |             F32 first_feedback_delay
       660 |             F32 second_feedback_delay
       664 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       664 |             F32 input_one
       668 |             F32 input_two
       672 |             BOOLEAN switch_flag
       676 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       676 |             F32 output
       680 |         SWITCH_SECOND_ORDER_STRUCT attitude_switch
       680 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       688 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
       688 |             SWITCH_COMMON_STRUCT common
       688 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       696 |               SWITCH_COMMON_STATE_STRUCT state
       696 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
       696 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       704 |                   PERSISTENT1SHOT_STATE_STRUCT state
       704 |                     BOOLEAN init
       708 |                     U32 iteration
       712 |                     BOOLEAN prev_input
       716 |                   PERSISTENT1SHOT_INPUT_STRUCT input
       716 |                     BOOLEAN input
       717 |                     BOOLEAN reset
       718 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
       718 |                     BOOLEAN output
       720 |                 F32 output_previous
       724 |                 F32 transition_deviation_latched
       728 |                 F32 selected_input
       736 |             REINTICH_STRUCT first_integrator
       736 |               REINTICH_COEFF_STRUCT * coeff
       744 |               REINTICH_STATE_STRUCT state
       744 |                 F32 delay
       748 |                 BOOLEAN reset_on_init
       752 |               REINTICH_INPUT_STRUCT input
       752 |                 F32 IC
       756 |                 F32 input
       760 |                 BOOLEAN run
       761 |                 BOOLEAN hold
       764 |               REINTICH_OUTPUT_STRUCT output
       764 |                 F32 output
       768 |             REINTICH_STRUCT second_integrator
       768 |               REINTICH_COEFF_STRUCT * coeff
       776 |               REINTICH_STATE_STRUCT state
       776 |                 F32 delay
       780 |                 BOOLEAN reset_on_init
       784 |               REINTICH_INPUT_STRUCT input
       784 |                 F32 IC
       788 |                 F32 input
       792 |                 BOOLEAN run
       793 |                 BOOLEAN hold
       796 |               REINTICH_OUTPUT_STRUCT output
       796 |                 F32 output
       800 |             F32 first_feedback_delay
       804 |             F32 second_feedback_delay
       808 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       808 |             F32 input_one
       812 |             F32 input_two
       816 |             BOOLEAN switch_flag
       820 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       820 |             F32 output
       824 |         REINTICH_STRUCT reintich
       824 |           REINTICH_COEFF_STRUCT * coeff
       832 |           REINTICH_STATE_STRUCT state
       832 |             F32 delay
       836 |             BOOLEAN reset_on_init
       840 |           REINTICH_INPUT_STRUCT input
       840 |             F32 IC
       844 |             F32 input
       848 |             BOOLEAN run
       849 |             BOOLEAN hold
       852 |           REINTICH_OUTPUT_STRUCT output
       852 |             F32 output
       856 |         REINTICHS_STRUCT reintichs
       856 |           REINTICHS_COEFF_STRUCT * coeff
       864 |           REINTICHS_STATE_STRUCT state
       864 |             F32 IC_delay
       868 |             F32 rail_bounce
       872 |             BOOLEAN prev_sat_UL
       873 |             BOOLEAN prev_sat_LL
       874 |             BOOLEAN prev_sat_inv
       875 |             BOOLEAN prev_reset_int
       876 |             BOOLEAN prev_reset_sat
       880 |             REINTICH_STRUCT integrator
       880 |               REINTICH_COEFF_STRUCT * coeff
       888 |               REINTICH_STATE_STRUCT state
       888 |                 F32 delay
       892 |                 BOOLEAN reset_on_init
       896 |               REINTICH_INPUT_STRUCT input
       896 |                 F32 IC
       900 |                 F32 input
       904 |                 BOOLEAN run
       905 |                 BOOLEAN hold
       908 |               REINTICH_OUTPUT_STRUCT output
       908 |                 F32 output
       912 |             SATURATIONVF_STRUCT sat
       912 |               SATURATIONVF_COEFF_STRUCT * coeff
       920 |               SATURATIONVF_STATE_STRUCT state
       920 |                 F32 delay
       924 |                 BOOLEAN reset_on_init
       928 |               SATURATIONVF_INPUT_STRUCT input
       928 |                 F32 IC
       932 |                 F32 input
       936 |                 BOOLEAN reset
       940 |               SATURATIONVF_OUTPUT_STRUCT output
       940 |                 F32 output
       944 |                 BOOLEAN inv
       945 |                 BOOLEAN satLo
       946 |                 BOOLEAN satHi
       952 |           REINTICHS_INPUT_STRUCT input
       952 |             F32 IC
       956 |             F32 input
       960 |             BOOLEAN run
       961 |             BOOLEAN hold
       964 |           REINTICHS_OUTPUT_STRUCT output
       964 |             F32 output
       968 |             BOOLEAN sat_UL
       969 |             BOOLEAN sat_LL
       970 |             BOOLEAN inv
       976 |         BOOLEAN prev_run
       977 |         BOOLEAN integ_sat
       984 |     F32 roll_rate_limiter_previous_state
       988 |     F32 pitch_rate_limiter_previous_state
       992 |     SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
       992 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1000 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
      1000 |         SWITCH_COMMON_STRUCT common
      1000 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1008 |           SWITCH_COMMON_STATE_STRUCT state
      1008 |             PERSISTENT1SHOT_STRUCT transition_one_shot
      1008 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1016 |               PERSISTENT1SHOT_STATE_STRUCT state
      1016 |                 BOOLEAN init
      1020 |                 U32 iteration
      1024 |                 BOOLEAN prev_input
      1028 |               PERSISTENT1SHOT_INPUT_STRUCT input
      1028 |                 BOOLEAN input
      1029 |                 BOOLEAN reset
      1030 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
      1030 |                 BOOLEAN output
      1032 |             F32 output_previous
      1036 |             F32 transition_deviation_latched
      1040 |             F32 selected_input
      1048 |         REINTICH_STRUCT first_integrator
      1048 |           REINTICH_COEFF_STRUCT * coeff
      1056 |           REINTICH_STATE_STRUCT state
      1056 |             F32 delay
      1060 |             BOOLEAN reset_on_init
      1064 |           REINTICH_INPUT_STRUCT input
      1064 |             F32 IC
      1068 |             F32 input
      1072 |             BOOLEAN run
      1073 |             BOOLEAN hold
      1076 |           REINTICH_OUTPUT_STRUCT output
      1076 |             F32 output
      1080 |         REINTICH_STRUCT second_integrator
      1080 |           REINTICH_COEFF_STRUCT * coeff
      1088 |           REINTICH_STATE_STRUCT state
      1088 |             F32 delay
      1092 |             BOOLEAN reset_on_init
      1096 |           REINTICH_INPUT_STRUCT input
      1096 |             F32 IC
      1100 |             F32 input
      1104 |             BOOLEAN run
      1105 |             BOOLEAN hold
      1108 |           REINTICH_OUTPUT_STRUCT output
      1108 |             F32 output
      1112 |         F32 first_feedback_delay
      1116 |         F32 second_feedback_delay
      1120 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1120 |         F32 input_one
      1124 |         F32 input_two
      1128 |         BOOLEAN switch_flag
      1132 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1132 |         F32 output
      1136 |     SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1136 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1144 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
      1144 |         SWITCH_COMMON_STRUCT common
      1144 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1152 |           SWITCH_COMMON_STATE_STRUCT state
      1152 |             PERSISTENT1SHOT_STRUCT transition_one_shot
      1152 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1160 |               PERSISTENT1SHOT_STATE_STRUCT state
      1160 |                 BOOLEAN init
      1164 |                 U32 iteration
      1168 |                 BOOLEAN prev_input
      1172 |               PERSISTENT1SHOT_INPUT_STRUCT input
      1172 |                 BOOLEAN input
      1173 |                 BOOLEAN reset
      1174 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
      1174 |                 BOOLEAN output
      1176 |             F32 output_previous
      1180 |             F32 transition_deviation_latched
      1184 |             F32 selected_input
      1192 |         REINTICH_STRUCT first_integrator
      1192 |           REINTICH_COEFF_STRUCT * coeff
      1200 |           REINTICH_STATE_STRUCT state
      1200 |             F32 delay
      1204 |             BOOLEAN reset_on_init
      1208 |           REINTICH_INPUT_STRUCT input
      1208 |             F32 IC
      1212 |             F32 input
      1216 |             BOOLEAN run
      1217 |             BOOLEAN hold
      1220 |           REINTICH_OUTPUT_STRUCT output
      1220 |             F32 output
      1224 |         REINTICH_STRUCT second_integrator
      1224 |           REINTICH_COEFF_STRUCT * coeff
      1232 |           REINTICH_STATE_STRUCT state
      1232 |             F32 delay
      1236 |             BOOLEAN reset_on_init
      1240 |           REINTICH_INPUT_STRUCT input
      1240 |             F32 IC
      1244 |             F32 input
      1248 |             BOOLEAN run
      1249 |             BOOLEAN hold
      1252 |           REINTICH_OUTPUT_STRUCT output
      1252 |             F32 output
      1256 |         F32 first_feedback_delay
      1260 |         F32 second_feedback_delay
      1264 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1264 |         F32 input_one
      1268 |         F32 input_two
      1272 |         BOOLEAN switch_flag
      1276 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1276 |         F32 output
      1280 |     TEST_PORT_STRUCT roll_testport
      1280 |       TEST_PORT_COEFF_STRUCT * coeff
      1288 |       TEST_PORT_INPUT_STRUCT input
      1288 |         F32 input
      1292 |       TEST_PORT_OUTPUT_STRUCT output
      1292 |         F32 output
      1296 |     TEST_PORT_STRUCT pitch_testport
      1296 |       TEST_PORT_COEFF_STRUCT * coeff
      1304 |       TEST_PORT_INPUT_STRUCT input
      1304 |         F32 input
      1308 |       TEST_PORT_OUTPUT_STRUCT output
      1308 |         F32 output
      1312 |     BOOLEAN first_frame
      1313 |     BOOLEAN adp_roll_rate_limited
      1314 |     BOOLEAN adp_pitch_rate_limited
      1320 |     SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1320 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1328 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
      1328 |         SWITCH_COMMON_STRUCT common
      1328 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1336 |           SWITCH_COMMON_STATE_STRUCT state
      1336 |             PERSISTENT1SHOT_STRUCT transition_one_shot
      1336 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1344 |               PERSISTENT1SHOT_STATE_STRUCT state
      1344 |                 BOOLEAN init
      1348 |                 U32 iteration
      1352 |                 BOOLEAN prev_input
      1356 |               PERSISTENT1SHOT_INPUT_STRUCT input
      1356 |                 BOOLEAN input
      1357 |                 BOOLEAN reset
      1358 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
      1358 |                 BOOLEAN output
      1360 |             F32 output_previous
      1364 |             F32 transition_deviation_latched
      1368 |             F32 selected_input
      1376 |         REINTICH_STRUCT first_integrator
      1376 |           REINTICH_COEFF_STRUCT * coeff
      1384 |           REINTICH_STATE_STRUCT state
      1384 |             F32 delay
      1388 |             BOOLEAN reset_on_init
      1392 |           REINTICH_INPUT_STRUCT input
      1392 |             F32 IC
      1396 |             F32 input
      1400 |             BOOLEAN run
      1401 |             BOOLEAN hold
      1404 |           REINTICH_OUTPUT_STRUCT output
      1404 |             F32 output
      1408 |         REINTICH_STRUCT second_integrator
      1408 |           REINTICH_COEFF_STRUCT * coeff
      1416 |           REINTICH_STATE_STRUCT state
      1416 |             F32 delay
      1420 |             BOOLEAN reset_on_init
      1424 |           REINTICH_INPUT_STRUCT input
      1424 |             F32 IC
      1428 |             F32 input
      1432 |             BOOLEAN run
      1433 |             BOOLEAN hold
      1436 |           REINTICH_OUTPUT_STRUCT output
      1436 |             F32 output
      1440 |         F32 first_feedback_delay
      1444 |         F32 second_feedback_delay
      1448 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1448 |         F32 input_one
      1452 |         F32 input_two
      1456 |         BOOLEAN switch_flag
      1460 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1460 |         F32 output
      1464 |     F32 switched_heading_rate
      1468 |     F32 roll_test_input
      1472 |     F32 pitch_test_input
      1480 |   CYCLIC_FEEDBACK_INPUT_STRUCT input
      1480 |     F32 adp_phi_cmd
      1484 |     F32 adp_theta_cmd
      1488 |     F32 phi
      1492 |     F32 phi_dot
      1496 |     F32 psi_dot
      1500 |     F32 theta
      1504 |     F32 theta_dot
      1508 |     F32 p
      1512 |     F32 q
      1516 |     BOOLEAN reset
      1517 |     BOOLEAN UAR_mode
      1518 |     BOOLEAN triplex_fault
           | [sizeof=1520, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_INPUT_STRUCT
         0 |   BOOLEAN run
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_OUTPUT_STRUCT
         0 |   BOOLEAN command_fail
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_STATE_STRUCT
         0 |   F32 [10] regfile
        40 |   U32 regfile_index
        44 |   F32 sum
        48 |   F32 average
        52 |   U16 sample_interval
        54 |   BOOLEAN do_first_frame
           | [sizeof=56, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_INPUT_STRUCT
         0 |   F32 input
         4 |   F32 input_IC
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_STRUCT
         0 |   TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
         8 |   TENTH_ORDER_AVERAGE_STATE_STRUCT state
         8 |     F32 [10] regfile
        48 |     U32 regfile_index
        52 |     F32 sum
        56 |     F32 average
        60 |     U16 sample_interval
        62 |     BOOLEAN do_first_frame
        64 |   TENTH_ORDER_AVERAGE_INPUT_STRUCT input
        64 |     F32 input
        68 |     F32 input_IC
        72 |     BOOLEAN reset
        76 |   TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
        76 |     F32 output
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_STATE_STRUCT
         0 |   F32 s1
         4 |   F32 s2
         8 |   BOOLEAN do_first_frame
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_INPUT_STRUCT
         0 |   F32 input
         4 |   F32 input_IC
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_STRUCT
         0 |   FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
         8 |   FIRSTORDERFILTER_STATE_STRUCT state
         8 |     F32 s1
        12 |     F32 s2
        16 |     BOOLEAN do_first_frame
        20 |   FIRSTORDERFILTER_INPUT_STRUCT input
        20 |     F32 input
        24 |     F32 input_IC
        28 |     BOOLEAN reset
        32 |   FIRSTORDERFILTER_OUTPUT_STRUCT output
        32 |     F32 output
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_STATE_STRUCT
         0 |   PERSISTENT1SHOT_STRUCT p1shot
         0 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |     PERSISTENT1SHOT_STATE_STRUCT state
         8 |       BOOLEAN init
        12 |       U32 iteration
        16 |       BOOLEAN prev_input
        20 |     PERSISTENT1SHOT_INPUT_STRUCT input
        20 |       BOOLEAN input
        21 |       BOOLEAN reset
        22 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   TENTH_ORDER_AVERAGE_STRUCT toa
        24 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        32 |     TENTH_ORDER_AVERAGE_STATE_STRUCT state
        32 |       F32 [10] regfile
        72 |       U32 regfile_index
        76 |       F32 sum
        80 |       F32 average
        84 |       U16 sample_interval
        86 |       BOOLEAN do_first_frame
        88 |     TENTH_ORDER_AVERAGE_INPUT_STRUCT input
        88 |       F32 input
        92 |       F32 input_IC
        96 |       BOOLEAN reset
       100 |     TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       100 |       F32 output
       104 |   FIRSTORDERFILTER_STRUCT wash_out
       104 |     FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       112 |     FIRSTORDERFILTER_STATE_STRUCT state
       112 |       F32 s1
       116 |       F32 s2
       120 |       BOOLEAN do_first_frame
       124 |     FIRSTORDERFILTER_INPUT_STRUCT input
       124 |       F32 input
       128 |       F32 input_IC
       132 |       BOOLEAN reset
       136 |     FIRSTORDERFILTER_OUTPUT_STRUCT output
       136 |       F32 output
       144 |   ROS_FLIPFLOP_STRUCT ros_ff
       144 |     ROS_FLIPFLOP_STATE_STRUCT state
       144 |       F32 s1
       148 |     ROS_FLIPFLOP_INPUT_STRUCT input
       148 |       BOOLEAN set
       149 |       BOOLEAN reset
       150 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
       150 |       BOOLEAN output
           | [sizeof=152, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_STRUCT
         0 |   MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
         8 |   MONITOR_COMMAND_INPUT_STRUCT input
         8 |     BOOLEAN run
         9 |   MONITOR_COMMAND_OUTPUT_STRUCT output
         9 |     BOOLEAN command_fail
        16 |   MONITOR_COMMAND_STATE_STRUCT state
        16 |     PERSISTENT1SHOT_STRUCT p1shot
        16 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |       PERSISTENT1SHOT_STATE_STRUCT state
        24 |         BOOLEAN init
        28 |         U32 iteration
        32 |         BOOLEAN prev_input
        36 |       PERSISTENT1SHOT_INPUT_STRUCT input
        36 |         BOOLEAN input
        37 |         BOOLEAN reset
        38 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |         BOOLEAN output
        40 |     TENTH_ORDER_AVERAGE_STRUCT toa
        40 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        48 |       TENTH_ORDER_AVERAGE_STATE_STRUCT state
        48 |         F32 [10] regfile
        88 |         U32 regfile_index
        92 |         F32 sum
        96 |         F32 average
       100 |         U16 sample_interval
       102 |         BOOLEAN do_first_frame
       104 |       TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       104 |         F32 input
       108 |         F32 input_IC
       112 |         BOOLEAN reset
       116 |       TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       116 |         F32 output
       120 |     FIRSTORDERFILTER_STRUCT wash_out
       120 |       FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       128 |       FIRSTORDERFILTER_STATE_STRUCT state
       128 |         F32 s1
       132 |         F32 s2
       136 |         BOOLEAN do_first_frame
       140 |       FIRSTORDERFILTER_INPUT_STRUCT input
       140 |         F32 input
       144 |         F32 input_IC
       148 |         BOOLEAN reset
       152 |       FIRSTORDERFILTER_OUTPUT_STRUCT output
       152 |         F32 output
       160 |     ROS_FLIPFLOP_STRUCT ros_ff
       160 |       ROS_FLIPFLOP_STATE_STRUCT state
       160 |         F32 s1
       164 |       ROS_FLIPFLOP_INPUT_STRUCT input
       164 |         BOOLEAN set
       165 |         BOOLEAN reset
       166 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
       166 |         BOOLEAN output
           | [sizeof=168, align=8]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_COEFF_STRUCT
         0 |   U32 sample_interval
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_COEFF_STRUCT
         0 |   F32 a1
         4 |   F32 b0
         8 |   F32 b1
        12 |   F32 k1
        16 |   F32 k2
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_COEFF_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
         0 |     U32 P
         4 |     BOOLEAN ic
         5 |     BOOLEAN rising_edge
         6 |     BOOLEAN falling_edge
         8 |   TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
         8 |     U32 sample_interval
        12 |   FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        12 |     F32 a1
        16 |     F32 b0
        20 |     F32 b1
        24 |     F32 k1
        28 |     F32 k2
        32 |   F32 wof_l_limit
        36 |   F32 wof_u_limit
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_COEFF_STRUCT
         0 |   F32 rate_l_limit
         4 |   F32 rate_u_limit
         8 |   F32 attitude_l_limit
        12 |   F32 attitude_u_limit
        16 |   MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
        16 |     PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        16 |       U32 P
        20 |       BOOLEAN ic
        21 |       BOOLEAN rising_edge
        22 |       BOOLEAN falling_edge
        24 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        24 |       U32 sample_interval
        28 |     FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        28 |       F32 a1
        32 |       F32 b0
        36 |       F32 b1
        40 |       F32 k1
        44 |       F32 k2
        48 |     F32 wof_l_limit
        52 |     F32 wof_u_limit
        56 |   MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
        56 |     PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        56 |       U32 P
        60 |       BOOLEAN ic
        61 |       BOOLEAN rising_edge
        62 |       BOOLEAN falling_edge
        64 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        64 |       U32 sample_interval
        68 |     FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        68 |       F32 a1
        72 |       F32 b0
        76 |       F32 b1
        80 |       F32 k1
        84 |       F32 k2
        88 |     F32 wof_l_limit
        92 |     F32 wof_u_limit
           | [sizeof=96, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_INPUT_STRUCT
         0 |   F32 rate
         4 |   F32 attitude
         8 |   BOOLEAN uar_mode
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_OUTPUT_STRUCT
         0 |   BOOLEAN rate_fail
         1 |   BOOLEAN attitude_fail
         2 |   BOOLEAN adp_command_fail
         3 |   BOOLEAN actuator_position_fail
           | [sizeof=4, align=1]

*** Dumping AST Record Layout
         0 | MONITOR_STATE_STRUCT
         0 |   MONITOR_COMMAND_STRUCT adp_cmd
         0 |     MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
         8 |     MONITOR_COMMAND_INPUT_STRUCT input
         8 |       BOOLEAN run
         9 |     MONITOR_COMMAND_OUTPUT_STRUCT output
         9 |       BOOLEAN command_fail
        16 |     MONITOR_COMMAND_STATE_STRUCT state
        16 |       PERSISTENT1SHOT_STRUCT p1shot
        16 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |         PERSISTENT1SHOT_STATE_STRUCT state
        24 |           BOOLEAN init
        28 |           U32 iteration
        32 |           BOOLEAN prev_input
        36 |         PERSISTENT1SHOT_INPUT_STRUCT input
        36 |           BOOLEAN input
        37 |           BOOLEAN reset
        38 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |           BOOLEAN output
        40 |       TENTH_ORDER_AVERAGE_STRUCT toa
        40 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        48 |         TENTH_ORDER_AVERAGE_STATE_STRUCT state
        48 |           F32 [10] regfile
        88 |           U32 regfile_index
        92 |           F32 sum
        96 |           F32 average
       100 |           U16 sample_interval
       102 |           BOOLEAN do_first_frame
       104 |         TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       104 |           F32 input
       108 |           F32 input_IC
       112 |           BOOLEAN reset
       116 |         TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       116 |           F32 output
       120 |       FIRSTORDERFILTER_STRUCT wash_out
       120 |         FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       128 |         FIRSTORDERFILTER_STATE_STRUCT state
       128 |           F32 s1
       132 |           F32 s2
       136 |           BOOLEAN do_first_frame
       140 |         FIRSTORDERFILTER_INPUT_STRUCT input
       140 |           F32 input
       144 |           F32 input_IC
       148 |           BOOLEAN reset
       152 |         FIRSTORDERFILTER_OUTPUT_STRUCT output
       152 |           F32 output
       160 |       ROS_FLIPFLOP_STRUCT ros_ff
       160 |         ROS_FLIPFLOP_STATE_STRUCT state
       160 |           F32 s1
       164 |         ROS_FLIPFLOP_INPUT_STRUCT input
       164 |           BOOLEAN set
       165 |           BOOLEAN reset
       166 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       166 |           BOOLEAN output
       168 |   MONITOR_COMMAND_STRUCT act_pos
       168 |     MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
       176 |     MONITOR_COMMAND_INPUT_STRUCT input
       176 |       BOOLEAN run
       177 |     MONITOR_COMMAND_OUTPUT_STRUCT output
       177 |       BOOLEAN command_fail
       184 |     MONITOR_COMMAND_STATE_STRUCT state
       184 |       PERSISTENT1SHOT_STRUCT p1shot
       184 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       192 |         PERSISTENT1SHOT_STATE_STRUCT state
       192 |           BOOLEAN init
       196 |           U32 iteration
       200 |           BOOLEAN prev_input
       204 |         PERSISTENT1SHOT_INPUT_STRUCT input
       204 |           BOOLEAN input
       205 |           BOOLEAN reset
       206 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
       206 |           BOOLEAN output
       208 |       TENTH_ORDER_AVERAGE_STRUCT toa
       208 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
       216 |         TENTH_ORDER_AVERAGE_STATE_STRUCT state
       216 |           F32 [10] regfile
       256 |           U32 regfile_index
       260 |           F32 sum
       264 |           F32 average
       268 |           U16 sample_interval
       270 |           BOOLEAN do_first_frame
       272 |         TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       272 |           F32 input
       276 |           F32 input_IC
       280 |           BOOLEAN reset
       284 |         TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       284 |           F32 output
       288 |       FIRSTORDERFILTER_STRUCT wash_out
       288 |         FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       296 |         FIRSTORDERFILTER_STATE_STRUCT state
       296 |           F32 s1
       300 |           F32 s2
       304 |           BOOLEAN do_first_frame
       308 |         FIRSTORDERFILTER_INPUT_STRUCT input
       308 |           F32 input
       312 |           F32 input_IC
       316 |           BOOLEAN reset
       320 |         FIRSTORDERFILTER_OUTPUT_STRUCT output
       320 |           F32 output
       328 |       ROS_FLIPFLOP_STRUCT ros_ff
       328 |         ROS_FLIPFLOP_STATE_STRUCT state
       328 |           F32 s1
       332 |         ROS_FLIPFLOP_INPUT_STRUCT input
       332 |           BOOLEAN set
       333 |           BOOLEAN reset
       334 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       334 |           BOOLEAN output
           | [sizeof=336, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_STRUCT
         0 |   MONITOR_COEFF_STRUCT * coeff_ptr
         8 |   MONITOR_INPUT_STRUCT input
         8 |     F32 rate
        12 |     F32 attitude
        16 |     BOOLEAN uar_mode
        20 |   MONITOR_OUTPUT_STRUCT output
        20 |     BOOLEAN rate_fail
        21 |     BOOLEAN attitude_fail
        22 |     BOOLEAN adp_command_fail
        23 |     BOOLEAN actuator_position_fail
        24 |   MONITOR_STATE_STRUCT state
        24 |     MONITOR_COMMAND_STRUCT adp_cmd
        24 |       MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
        32 |       MONITOR_COMMAND_INPUT_STRUCT input
        32 |         BOOLEAN run
        33 |       MONITOR_COMMAND_OUTPUT_STRUCT output
        33 |         BOOLEAN command_fail
        40 |       MONITOR_COMMAND_STATE_STRUCT state
        40 |         PERSISTENT1SHOT_STRUCT p1shot
        40 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        48 |           PERSISTENT1SHOT_STATE_STRUCT state
        48 |             BOOLEAN init
        52 |             U32 iteration
        56 |             BOOLEAN prev_input
        60 |           PERSISTENT1SHOT_INPUT_STRUCT input
        60 |             BOOLEAN input
        61 |             BOOLEAN reset
        62 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
        62 |             BOOLEAN output
        64 |         TENTH_ORDER_AVERAGE_STRUCT toa
        64 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        72 |           TENTH_ORDER_AVERAGE_STATE_STRUCT state
        72 |             F32 [10] regfile
       112 |             U32 regfile_index
       116 |             F32 sum
       120 |             F32 average
       124 |             U16 sample_interval
       126 |             BOOLEAN do_first_frame
       128 |           TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       128 |             F32 input
       132 |             F32 input_IC
       136 |             BOOLEAN reset
       140 |           TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       140 |             F32 output
       144 |         FIRSTORDERFILTER_STRUCT wash_out
       144 |           FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       152 |           FIRSTORDERFILTER_STATE_STRUCT state
       152 |             F32 s1
       156 |             F32 s2
       160 |             BOOLEAN do_first_frame
       164 |           FIRSTORDERFILTER_INPUT_STRUCT input
       164 |             F32 input
       168 |             F32 input_IC
       172 |             BOOLEAN reset
       176 |           FIRSTORDERFILTER_OUTPUT_STRUCT output
       176 |             F32 output
       184 |         ROS_FLIPFLOP_STRUCT ros_ff
       184 |           ROS_FLIPFLOP_STATE_STRUCT state
       184 |             F32 s1
       188 |           ROS_FLIPFLOP_INPUT_STRUCT input
       188 |             BOOLEAN set
       189 |             BOOLEAN reset
       190 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       190 |             BOOLEAN output
       192 |     MONITOR_COMMAND_STRUCT act_pos
       192 |       MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
       200 |       MONITOR_COMMAND_INPUT_STRUCT input
       200 |         BOOLEAN run
       201 |       MONITOR_COMMAND_OUTPUT_STRUCT output
       201 |         BOOLEAN command_fail
       208 |       MONITOR_COMMAND_STATE_STRUCT state
       208 |         PERSISTENT1SHOT_STRUCT p1shot
       208 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       216 |           PERSISTENT1SHOT_STATE_STRUCT state
       216 |             BOOLEAN init
       220 |             U32 iteration
       224 |             BOOLEAN prev_input
       228 |           PERSISTENT1SHOT_INPUT_STRUCT input
       228 |             BOOLEAN input
       229 |             BOOLEAN reset
       230 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
       230 |             BOOLEAN output
       232 |         TENTH_ORDER_AVERAGE_STRUCT toa
       232 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
       240 |           TENTH_ORDER_AVERAGE_STATE_STRUCT state
       240 |             F32 [10] regfile
       280 |             U32 regfile_index
       284 |             F32 sum
       288 |             F32 average
       292 |             U16 sample_interval
       294 |             BOOLEAN do_first_frame
       296 |           TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       296 |             F32 input
       300 |             F32 input_IC
       304 |             BOOLEAN reset
       308 |           TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       308 |             F32 output
       312 |         FIRSTORDERFILTER_STRUCT wash_out
       312 |           FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       320 |           FIRSTORDERFILTER_STATE_STRUCT state
       320 |             F32 s1
       324 |             F32 s2
       328 |             BOOLEAN do_first_frame
       332 |           FIRSTORDERFILTER_INPUT_STRUCT input
       332 |             F32 input
       336 |             F32 input_IC
       340 |             BOOLEAN reset
       344 |           FIRSTORDERFILTER_OUTPUT_STRUCT output
       344 |             F32 output
       352 |         ROS_FLIPFLOP_STRUCT ros_ff
       352 |           ROS_FLIPFLOP_STATE_STRUCT state
       352 |             F32 s1
       356 |           ROS_FLIPFLOP_INPUT_STRUCT input
       356 |             BOOLEAN set
       357 |             BOOLEAN reset
       358 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       358 |             BOOLEAN output
           | [sizeof=360, align=8]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_COEFF_STRUCT
         0 |   F32 phi_upper_limit
         4 |   F32 phi_lower_limit
         8 |   F32 theta_upper_limit
        12 |   F32 theta_lower_limit
        16 |   F32 p_filt_upper_limit
        20 |   F32 p_filt_lower_limit
        24 |   F32 q_filt_upper_limit
        28 |   F32 q_filt_lower_limit
        32 |   PERSISTENT1SHOT_COEFF_STRUCT run_p1shot
        32 |     U32 P
        36 |     BOOLEAN ic
        37 |     BOOLEAN rising_edge
        38 |     BOOLEAN falling_edge
        40 |   PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
        40 |     U32 P
        44 |     BOOLEAN ic
        45 |     BOOLEAN rising_edge
        46 |     BOOLEAN falling_edge
           | [sizeof=48, align=4]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_COEFF_STRUCT
         0 |   CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
         0 |     F32 pitch_bias
         4 |     F32 roll_rate_limiter_upper_limit
         8 |     F32 roll_rate_limiter_lower_limit
        12 |     F32 pitch_rate_limiter_upper_limit
        16 |     F32 pitch_rate_limiter_lower_limit
        20 |     ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |       F32 c_reintichs_IC
        24 |       F32 c_gamma
        28 |       F32 null_attitude
        32 |       F32 upper_sat_limit
        36 |       F32 lower_sat_limit
        40 |       F32 k_rate_to_ang_accel_cross
        44 |       F32 k_rate_to_ang_accel_uar
        48 |       F32 k_rate_to_ang_accel_normal
        52 |       F32 k_attitude_to_ang_accel_uar
        56 |       F32 k_attitude_to_ang_accel_normal
        60 |       F32 k_attitude_to_ang_accel_integral_normal
        64 |       F32 k_compensation
        68 |       F32 k_ang_accel_to_cyclic
        72 |       F32 k_integrator_curve_magnitude
        76 |       SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        76 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
        76 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        76 |             U32 P
        80 |             BOOLEAN ic
        81 |             BOOLEAN rising_edge
        82 |             BOOLEAN falling_edge
        84 |         REINTICH_COEFF_STRUCT first_integrator_coeff
        84 |           F32 K_Ts
        88 |         REINTICH_COEFF_STRUCT second_integrator_coeff
        88 |           F32 K_Ts
        92 |       SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        92 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
        92 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        92 |             U32 P
        96 |             BOOLEAN ic
        97 |             BOOLEAN rising_edge
        98 |             BOOLEAN falling_edge
       100 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       100 |           F32 K_Ts
       104 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       104 |           F32 K_Ts
       108 |       REINTICH_COEFF_STRUCT reintich
       108 |         F32 K_Ts
       112 |       REINTICHS_COEFF_STRUCT reintichs
       112 |         F32 K_Ts
       116 |         F32 Gain
       120 |         F32 UL
       124 |         F32 LL
       128 |         F32 rail_bounce_divisor
       132 |         REINTICH_COEFF_STRUCT integrator_coeff
       132 |           F32 K_Ts
       136 |         SATURATIONVF_COEFF_STRUCT sat_coeff
       136 |           F32 epsilon
       140 |           F32 upper_sat_limit
       144 |           F32 lower_sat_limit
       148 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       148 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       148 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       148 |             U32 P
       152 |             BOOLEAN ic
       153 |             BOOLEAN rising_edge
       154 |             BOOLEAN falling_edge
       156 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       156 |           F32 K_Ts
       160 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       160 |           F32 K_Ts
       164 |     ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       164 |       F32 c_reintichs_IC
       168 |       F32 c_gamma
       172 |       F32 null_attitude
       176 |       F32 upper_sat_limit
       180 |       F32 lower_sat_limit
       184 |       F32 k_rate_to_ang_accel_cross
       188 |       F32 k_rate_to_ang_accel_uar
       192 |       F32 k_rate_to_ang_accel_normal
       196 |       F32 k_attitude_to_ang_accel_uar
       200 |       F32 k_attitude_to_ang_accel_normal
       204 |       F32 k_attitude_to_ang_accel_integral_normal
       208 |       F32 k_compensation
       212 |       F32 k_ang_accel_to_cyclic
       216 |       F32 k_integrator_curve_magnitude
       220 |       SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
       220 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       220 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       220 |             U32 P
       224 |             BOOLEAN ic
       225 |             BOOLEAN rising_edge
       226 |             BOOLEAN falling_edge
       228 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       228 |           F32 K_Ts
       232 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       232 |           F32 K_Ts
       236 |       SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
       236 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       236 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       236 |             U32 P
       240 |             BOOLEAN ic
       241 |             BOOLEAN rising_edge
       242 |             BOOLEAN falling_edge
       244 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       244 |           F32 K_Ts
       248 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       248 |           F32 K_Ts
       252 |       REINTICH_COEFF_STRUCT reintich
       252 |         F32 K_Ts
       256 |       REINTICHS_COEFF_STRUCT reintichs
       256 |         F32 K_Ts
       260 |         F32 Gain
       264 |         F32 UL
       268 |         F32 LL
       272 |         F32 rail_bounce_divisor
       276 |         REINTICH_COEFF_STRUCT integrator_coeff
       276 |           F32 K_Ts
       280 |         SATURATIONVF_COEFF_STRUCT sat_coeff
       280 |           F32 epsilon
       284 |           F32 upper_sat_limit
       288 |           F32 lower_sat_limit
       292 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       292 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       292 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       292 |             U32 P
       296 |             BOOLEAN ic
       297 |             BOOLEAN rising_edge
       298 |             BOOLEAN falling_edge
       300 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       300 |           F32 K_Ts
       304 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       304 |           F32 K_Ts
       308 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_roll_cmd_switch
       308 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       308 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       308 |           U32 P
       312 |           BOOLEAN ic
       313 |           BOOLEAN rising_edge
       314 |           BOOLEAN falling_edge
       316 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       316 |         F32 K_Ts
       320 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       320 |         F32 K_Ts
       324 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_pitch_cmd_switch
       324 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       324 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       324 |           U32 P
       328 |           BOOLEAN ic
       329 |           BOOLEAN rising_edge
       330 |           BOOLEAN falling_edge
       332 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       332 |         F32 K_Ts
       336 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       336 |         F32 K_Ts
       340 |     TEST_PORT_COEFF_STRUCT roll_testport
       340 |       F32 gain
       344 |       F32 bias
       348 |     TEST_PORT_COEFF_STRUCT pitch_testport
       348 |       F32 gain
       352 |       F32 bias
       356 |     F32 K_heading_rate_to_ang_accel_uar
       360 |     SWITCH_SECOND_ORDER_COEFF_STRUCT heading_rate_switch
       360 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       360 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       360 |           U32 P
       364 |           BOOLEAN ic
       365 |           BOOLEAN rising_edge
       366 |           BOOLEAN falling_edge
       368 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       368 |         F32 K_Ts
       372 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       372 |         F32 K_Ts
       376 |     LINTERP_STRUCT pitch_bias_linterp
       376 |       U8 n_regions
       380 |       LINTERP_REGION_STRUCT [10] regions
       500 |     F32 tune_mode
       504 |   UARMODELOGIC_COEFF_STRUCT uar_mode_logic
       504 |     F32 phi_upper_limit
       508 |     F32 phi_lower_limit
       512 |     F32 theta_upper_limit
       516 |     F32 theta_lower_limit
       520 |     F32 p_filt_upper_limit
       524 |     F32 p_filt_lower_limit
       528 |     F32 q_filt_upper_limit
       532 |     F32 q_filt_lower_limit
       536 |     PERSISTENT1SHOT_COEFF_STRUCT run_p1shot
       536 |       U32 P
       540 |       BOOLEAN ic
       541 |       BOOLEAN rising_edge
       542 |       BOOLEAN falling_edge
       544 |     PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
       544 |       U32 P
       548 |       BOOLEAN ic
       549 |       BOOLEAN rising_edge
       550 |       BOOLEAN falling_edge
           | [sizeof=552, align=4]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_INPUT_STRUCT
         0 |   BOOLEAN run
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_OUTPUT_STRUCT
         0 |   CYCLIC_STRUCT feedback
         0 |     F32 roll
         4 |     F32 pitch
         8 |   BOOLEAN uar_mode
         9 |   BOOLEAN run_adp
        10 |   BOOLEAN phi_valid
        11 |   BOOLEAN theta_valid
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_INPUT_STRUCT
         0 |   F32 phi
         4 |   F32 theta
         8 |   F32 p_filt
        12 |   F32 q_filt
        16 |   BOOLEAN run
        17 |   BOOLEAN adp_fail
        18 |   BOOLEAN disable_ADP
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_OUTPUT_STRUCT
         0 |   BOOLEAN phi_range_valid
         1 |   BOOLEAN theta_range_valid
         2 |   BOOLEAN uar_mode
           | [sizeof=3, align=1]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_STATE_STRUCT
         0 |   ROS_FLIPFLOP_STRUCT uar_mode_ff
         0 |     ROS_FLIPFLOP_STATE_STRUCT state
         0 |       F32 s1
         4 |     ROS_FLIPFLOP_INPUT_STRUCT input
         4 |       BOOLEAN set
         5 |       BOOLEAN reset
         6 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
         6 |       BOOLEAN output
         8 |   ROS_FLIPFLOP_STRUCT phi_range_ff
         8 |     ROS_FLIPFLOP_STATE_STRUCT state
         8 |       F32 s1
        12 |     ROS_FLIPFLOP_INPUT_STRUCT input
        12 |       BOOLEAN set
        13 |       BOOLEAN reset
        14 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
        14 |       BOOLEAN output
        16 |   ROS_FLIPFLOP_STRUCT theta_range_ff
        16 |     ROS_FLIPFLOP_STATE_STRUCT state
        16 |       F32 s1
        20 |     ROS_FLIPFLOP_INPUT_STRUCT input
        20 |       BOOLEAN set
        21 |       BOOLEAN reset
        22 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   PERSISTENT1SHOT_STRUCT run_p1shot
        24 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        32 |     PERSISTENT1SHOT_STATE_STRUCT state
        32 |       BOOLEAN init
        36 |       U32 iteration
        40 |       BOOLEAN prev_input
        44 |     PERSISTENT1SHOT_INPUT_STRUCT input
        44 |       BOOLEAN input
        45 |       BOOLEAN reset
        46 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        46 |       BOOLEAN output
        48 |   PERSISTENT1SHOT_STRUCT uar_hold_p1shot
        48 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        56 |     PERSISTENT1SHOT_STATE_STRUCT state
        56 |       BOOLEAN init
        60 |       U32 iteration
        64 |       BOOLEAN prev_input
        68 |     PERSISTENT1SHOT_INPUT_STRUCT input
        68 |       BOOLEAN input
        69 |       BOOLEAN reset
        70 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        70 |       BOOLEAN output
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_STRUCT
         0 |   UARMODELOGIC_COEFF_STRUCT * coeff_ptr
         8 |   UARMODELOGIC_INPUT_STRUCT input
         8 |     F32 phi
        12 |     F32 theta
        16 |     F32 p_filt
        20 |     F32 q_filt
        24 |     BOOLEAN run
        25 |     BOOLEAN adp_fail
        26 |     BOOLEAN disable_ADP
        28 |   UARMODELOGIC_OUTPUT_STRUCT output
        28 |     BOOLEAN phi_range_valid
        29 |     BOOLEAN theta_range_valid
        30 |     BOOLEAN uar_mode
        32 |   UARMODELOGIC_STATE_STRUCT state
        32 |     ROS_FLIPFLOP_STRUCT uar_mode_ff
        32 |       ROS_FLIPFLOP_STATE_STRUCT state
        32 |         F32 s1
        36 |       ROS_FLIPFLOP_INPUT_STRUCT input
        36 |         BOOLEAN set
        37 |         BOOLEAN reset
        38 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        38 |         BOOLEAN output
        40 |     ROS_FLIPFLOP_STRUCT phi_range_ff
        40 |       ROS_FLIPFLOP_STATE_STRUCT state
        40 |         F32 s1
        44 |       ROS_FLIPFLOP_INPUT_STRUCT input
        44 |         BOOLEAN set
        45 |         BOOLEAN reset
        46 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        46 |         BOOLEAN output
        48 |     ROS_FLIPFLOP_STRUCT theta_range_ff
        48 |       ROS_FLIPFLOP_STATE_STRUCT state
        48 |         F32 s1
        52 |       ROS_FLIPFLOP_INPUT_STRUCT input
        52 |         BOOLEAN set
        53 |         BOOLEAN reset
        54 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        54 |         BOOLEAN output
        56 |     PERSISTENT1SHOT_STRUCT run_p1shot
        56 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        64 |       PERSISTENT1SHOT_STATE_STRUCT state
        64 |         BOOLEAN init
        68 |         U32 iteration
        72 |         BOOLEAN prev_input
        76 |       PERSISTENT1SHOT_INPUT_STRUCT input
        76 |         BOOLEAN input
        77 |         BOOLEAN reset
        78 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        78 |         BOOLEAN output
        80 |     PERSISTENT1SHOT_STRUCT uar_hold_p1shot
        80 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        88 |       PERSISTENT1SHOT_STATE_STRUCT state
        88 |         BOOLEAN init
        92 |         U32 iteration
        96 |         BOOLEAN prev_input
       100 |       PERSISTENT1SHOT_INPUT_STRUCT input
       100 |         BOOLEAN input
       101 |         BOOLEAN reset
       102 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
       102 |         BOOLEAN output
           | [sizeof=104, align=8]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_STATE_STRUCT
         0 |   CYCLIC_FEEDBACK_STRUCT cyclic_feedback
         0 |     CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
         8 |     CYCLIC_FEEDBACK_STATE_STRUCT state
         8 |       ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         8 |         ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        16 |         ATTITUDE_CONTROLLER_INPUT_STRUCT input
        16 |           F32 rate_cross_axis
        20 |           F32 rate_near_axis
        24 |           F32 attitude_near_axis
        28 |           F32 adp_roll_cmd
        32 |           F32 adp_pitch_cmd
        36 |           BOOLEAN run_mode
        37 |           BOOLEAN uar_mode
        40 |         ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        40 |           F32 output
        48 |         ATTITUDE_CONTROLLER_STATE_STRUCT state
        48 |           SWITCH_SECOND_ORDER_STRUCT rate_switch
        48 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        56 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
        56 |               SWITCH_COMMON_STRUCT common
        56 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        64 |                 SWITCH_COMMON_STATE_STRUCT state
        64 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
        64 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        72 |                     PERSISTENT1SHOT_STATE_STRUCT state
        72 |                       BOOLEAN init
        76 |                       U32 iteration
        80 |                       BOOLEAN prev_input
        84 |                     PERSISTENT1SHOT_INPUT_STRUCT input
        84 |                       BOOLEAN input
        85 |                       BOOLEAN reset
        86 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
        86 |                       BOOLEAN output
        88 |                   F32 output_previous
        92 |                   F32 transition_deviation_latched
        96 |                   F32 selected_input
       104 |               REINTICH_STRUCT first_integrator
       104 |                 REINTICH_COEFF_STRUCT * coeff
       112 |                 REINTICH_STATE_STRUCT state
       112 |                   F32 delay
       116 |                   BOOLEAN reset_on_init
       120 |                 REINTICH_INPUT_STRUCT input
       120 |                   F32 IC
       124 |                   F32 input
       128 |                   BOOLEAN run
       129 |                   BOOLEAN hold
       132 |                 REINTICH_OUTPUT_STRUCT output
       132 |                   F32 output
       136 |               REINTICH_STRUCT second_integrator
       136 |                 REINTICH_COEFF_STRUCT * coeff
       144 |                 REINTICH_STATE_STRUCT state
       144 |                   F32 delay
       148 |                   BOOLEAN reset_on_init
       152 |                 REINTICH_INPUT_STRUCT input
       152 |                   F32 IC
       156 |                   F32 input
       160 |                   BOOLEAN run
       161 |                   BOOLEAN hold
       164 |                 REINTICH_OUTPUT_STRUCT output
       164 |                   F32 output
       168 |               F32 first_feedback_delay
       172 |               F32 second_feedback_delay
       176 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       176 |               F32 input_one
       180 |               F32 input_two
       184 |               BOOLEAN switch_flag
       188 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       188 |               F32 output
       192 |           SWITCH_SECOND_ORDER_STRUCT attitude_switch
       192 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       200 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
       200 |               SWITCH_COMMON_STRUCT common
       200 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       208 |                 SWITCH_COMMON_STATE_STRUCT state
       208 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
       208 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       216 |                     PERSISTENT1SHOT_STATE_STRUCT state
       216 |                       BOOLEAN init
       220 |                       U32 iteration
       224 |                       BOOLEAN prev_input
       228 |                     PERSISTENT1SHOT_INPUT_STRUCT input
       228 |                       BOOLEAN input
       229 |                       BOOLEAN reset
       230 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
       230 |                       BOOLEAN output
       232 |                   F32 output_previous
       236 |                   F32 transition_deviation_latched
       240 |                   F32 selected_input
       248 |               REINTICH_STRUCT first_integrator
       248 |                 REINTICH_COEFF_STRUCT * coeff
       256 |                 REINTICH_STATE_STRUCT state
       256 |                   F32 delay
       260 |                   BOOLEAN reset_on_init
       264 |                 REINTICH_INPUT_STRUCT input
       264 |                   F32 IC
       268 |                   F32 input
       272 |                   BOOLEAN run
       273 |                   BOOLEAN hold
       276 |                 REINTICH_OUTPUT_STRUCT output
       276 |                   F32 output
       280 |               REINTICH_STRUCT second_integrator
       280 |                 REINTICH_COEFF_STRUCT * coeff
       288 |                 REINTICH_STATE_STRUCT state
       288 |                   F32 delay
       292 |                   BOOLEAN reset_on_init
       296 |                 REINTICH_INPUT_STRUCT input
       296 |                   F32 IC
       300 |                   F32 input
       304 |                   BOOLEAN run
       305 |                   BOOLEAN hold
       308 |                 REINTICH_OUTPUT_STRUCT output
       308 |                   F32 output
       312 |               F32 first_feedback_delay
       316 |               F32 second_feedback_delay
       320 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       320 |               F32 input_one
       324 |               F32 input_two
       328 |               BOOLEAN switch_flag
       332 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       332 |               F32 output
       336 |           REINTICH_STRUCT reintich
       336 |             REINTICH_COEFF_STRUCT * coeff
       344 |             REINTICH_STATE_STRUCT state
       344 |               F32 delay
       348 |               BOOLEAN reset_on_init
       352 |             REINTICH_INPUT_STRUCT input
       352 |               F32 IC
       356 |               F32 input
       360 |               BOOLEAN run
       361 |               BOOLEAN hold
       364 |             REINTICH_OUTPUT_STRUCT output
       364 |               F32 output
       368 |           REINTICHS_STRUCT reintichs
       368 |             REINTICHS_COEFF_STRUCT * coeff
       376 |             REINTICHS_STATE_STRUCT state
       376 |               F32 IC_delay
       380 |               F32 rail_bounce
       384 |               BOOLEAN prev_sat_UL
       385 |               BOOLEAN prev_sat_LL
       386 |               BOOLEAN prev_sat_inv
       387 |               BOOLEAN prev_reset_int
       388 |               BOOLEAN prev_reset_sat
       392 |               REINTICH_STRUCT integrator
       392 |                 REINTICH_COEFF_STRUCT * coeff
       400 |                 REINTICH_STATE_STRUCT state
       400 |                   F32 delay
       404 |                   BOOLEAN reset_on_init
       408 |                 REINTICH_INPUT_STRUCT input
       408 |                   F32 IC
       412 |                   F32 input
       416 |                   BOOLEAN run
       417 |                   BOOLEAN hold
       420 |                 REINTICH_OUTPUT_STRUCT output
       420 |                   F32 output
       424 |               SATURATIONVF_STRUCT sat
       424 |                 SATURATIONVF_COEFF_STRUCT * coeff
       432 |                 SATURATIONVF_STATE_STRUCT state
       432 |                   F32 delay
       436 |                   BOOLEAN reset_on_init
       440 |                 SATURATIONVF_INPUT_STRUCT input
       440 |                   F32 IC
       444 |                   F32 input
       448 |                   BOOLEAN reset
       452 |                 SATURATIONVF_OUTPUT_STRUCT output
       452 |                   F32 output
       456 |                   BOOLEAN inv
       457 |                   BOOLEAN satLo
       458 |                   BOOLEAN satHi
       464 |             REINTICHS_INPUT_STRUCT input
       464 |               F32 IC
       468 |               F32 input
       472 |               BOOLEAN run
       473 |               BOOLEAN hold
       476 |             REINTICHS_OUTPUT_STRUCT output
       476 |               F32 output
       480 |               BOOLEAN sat_UL
       481 |               BOOLEAN sat_LL
       482 |               BOOLEAN inv
       488 |           BOOLEAN prev_run
       489 |           BOOLEAN integ_sat
       496 |       ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       496 |         ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       504 |         ATTITUDE_CONTROLLER_INPUT_STRUCT input
       504 |           F32 rate_cross_axis
       508 |           F32 rate_near_axis
       512 |           F32 attitude_near_axis
       516 |           F32 adp_roll_cmd
       520 |           F32 adp_pitch_cmd
       524 |           BOOLEAN run_mode
       525 |           BOOLEAN uar_mode
       528 |         ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       528 |           F32 output
       536 |         ATTITUDE_CONTROLLER_STATE_STRUCT state
       536 |           SWITCH_SECOND_ORDER_STRUCT rate_switch
       536 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       544 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
       544 |               SWITCH_COMMON_STRUCT common
       544 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       552 |                 SWITCH_COMMON_STATE_STRUCT state
       552 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
       552 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       560 |                     PERSISTENT1SHOT_STATE_STRUCT state
       560 |                       BOOLEAN init
       564 |                       U32 iteration
       568 |                       BOOLEAN prev_input
       572 |                     PERSISTENT1SHOT_INPUT_STRUCT input
       572 |                       BOOLEAN input
       573 |                       BOOLEAN reset
       574 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
       574 |                       BOOLEAN output
       576 |                   F32 output_previous
       580 |                   F32 transition_deviation_latched
       584 |                   F32 selected_input
       592 |               REINTICH_STRUCT first_integrator
       592 |                 REINTICH_COEFF_STRUCT * coeff
       600 |                 REINTICH_STATE_STRUCT state
       600 |                   F32 delay
       604 |                   BOOLEAN reset_on_init
       608 |                 REINTICH_INPUT_STRUCT input
       608 |                   F32 IC
       612 |                   F32 input
       616 |                   BOOLEAN run
       617 |                   BOOLEAN hold
       620 |                 REINTICH_OUTPUT_STRUCT output
       620 |                   F32 output
       624 |               REINTICH_STRUCT second_integrator
       624 |                 REINTICH_COEFF_STRUCT * coeff
       632 |                 REINTICH_STATE_STRUCT state
       632 |                   F32 delay
       636 |                   BOOLEAN reset_on_init
       640 |                 REINTICH_INPUT_STRUCT input
       640 |                   F32 IC
       644 |                   F32 input
       648 |                   BOOLEAN run
       649 |                   BOOLEAN hold
       652 |                 REINTICH_OUTPUT_STRUCT output
       652 |                   F32 output
       656 |               F32 first_feedback_delay
       660 |               F32 second_feedback_delay
       664 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       664 |               F32 input_one
       668 |               F32 input_two
       672 |               BOOLEAN switch_flag
       676 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       676 |               F32 output
       680 |           SWITCH_SECOND_ORDER_STRUCT attitude_switch
       680 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       688 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
       688 |               SWITCH_COMMON_STRUCT common
       688 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       696 |                 SWITCH_COMMON_STATE_STRUCT state
       696 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
       696 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       704 |                     PERSISTENT1SHOT_STATE_STRUCT state
       704 |                       BOOLEAN init
       708 |                       U32 iteration
       712 |                       BOOLEAN prev_input
       716 |                     PERSISTENT1SHOT_INPUT_STRUCT input
       716 |                       BOOLEAN input
       717 |                       BOOLEAN reset
       718 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
       718 |                       BOOLEAN output
       720 |                   F32 output_previous
       724 |                   F32 transition_deviation_latched
       728 |                   F32 selected_input
       736 |               REINTICH_STRUCT first_integrator
       736 |                 REINTICH_COEFF_STRUCT * coeff
       744 |                 REINTICH_STATE_STRUCT state
       744 |                   F32 delay
       748 |                   BOOLEAN reset_on_init
       752 |                 REINTICH_INPUT_STRUCT input
       752 |                   F32 IC
       756 |                   F32 input
       760 |                   BOOLEAN run
       761 |                   BOOLEAN hold
       764 |                 REINTICH_OUTPUT_STRUCT output
       764 |                   F32 output
       768 |               REINTICH_STRUCT second_integrator
       768 |                 REINTICH_COEFF_STRUCT * coeff
       776 |                 REINTICH_STATE_STRUCT state
       776 |                   F32 delay
       780 |                   BOOLEAN reset_on_init
       784 |                 REINTICH_INPUT_STRUCT input
       784 |                   F32 IC
       788 |                   F32 input
       792 |                   BOOLEAN run
       793 |                   BOOLEAN hold
       796 |                 REINTICH_OUTPUT_STRUCT output
       796 |                   F32 output
       800 |               F32 first_feedback_delay
       804 |               F32 second_feedback_delay
       808 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       808 |               F32 input_one
       812 |               F32 input_two
       816 |               BOOLEAN switch_flag
       820 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       820 |               F32 output
       824 |           REINTICH_STRUCT reintich
       824 |             REINTICH_COEFF_STRUCT * coeff
       832 |             REINTICH_STATE_STRUCT state
       832 |               F32 delay
       836 |               BOOLEAN reset_on_init
       840 |             REINTICH_INPUT_STRUCT input
       840 |               F32 IC
       844 |               F32 input
       848 |               BOOLEAN run
       849 |               BOOLEAN hold
       852 |             REINTICH_OUTPUT_STRUCT output
       852 |               F32 output
       856 |           REINTICHS_STRUCT reintichs
       856 |             REINTICHS_COEFF_STRUCT * coeff
       864 |             REINTICHS_STATE_STRUCT state
       864 |               F32 IC_delay
       868 |               F32 rail_bounce
       872 |               BOOLEAN prev_sat_UL
       873 |               BOOLEAN prev_sat_LL
       874 |               BOOLEAN prev_sat_inv
       875 |               BOOLEAN prev_reset_int
       876 |               BOOLEAN prev_reset_sat
       880 |               REINTICH_STRUCT integrator
       880 |                 REINTICH_COEFF_STRUCT * coeff
       888 |                 REINTICH_STATE_STRUCT state
       888 |                   F32 delay
       892 |                   BOOLEAN reset_on_init
       896 |                 REINTICH_INPUT_STRUCT input
       896 |                   F32 IC
       900 |                   F32 input
       904 |                   BOOLEAN run
       905 |                   BOOLEAN hold
       908 |                 REINTICH_OUTPUT_STRUCT output
       908 |                   F32 output
       912 |               SATURATIONVF_STRUCT sat
       912 |                 SATURATIONVF_COEFF_STRUCT * coeff
       920 |                 SATURATIONVF_STATE_STRUCT state
       920 |                   F32 delay
       924 |                   BOOLEAN reset_on_init
       928 |                 SATURATIONVF_INPUT_STRUCT input
       928 |                   F32 IC
       932 |                   F32 input
       936 |                   BOOLEAN reset
       940 |                 SATURATIONVF_OUTPUT_STRUCT output
       940 |                   F32 output
       944 |                   BOOLEAN inv
       945 |                   BOOLEAN satLo
       946 |                   BOOLEAN satHi
       952 |             REINTICHS_INPUT_STRUCT input
       952 |               F32 IC
       956 |               F32 input
       960 |               BOOLEAN run
       961 |               BOOLEAN hold
       964 |             REINTICHS_OUTPUT_STRUCT output
       964 |               F32 output
       968 |               BOOLEAN sat_UL
       969 |               BOOLEAN sat_LL
       970 |               BOOLEAN inv
       976 |           BOOLEAN prev_run
       977 |           BOOLEAN integ_sat
       984 |       F32 roll_rate_limiter_previous_state
       988 |       F32 pitch_rate_limiter_previous_state
       992 |       SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
       992 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1000 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
      1000 |           SWITCH_COMMON_STRUCT common
      1000 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1008 |             SWITCH_COMMON_STATE_STRUCT state
      1008 |               PERSISTENT1SHOT_STRUCT transition_one_shot
      1008 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1016 |                 PERSISTENT1SHOT_STATE_STRUCT state
      1016 |                   BOOLEAN init
      1020 |                   U32 iteration
      1024 |                   BOOLEAN prev_input
      1028 |                 PERSISTENT1SHOT_INPUT_STRUCT input
      1028 |                   BOOLEAN input
      1029 |                   BOOLEAN reset
      1030 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
      1030 |                   BOOLEAN output
      1032 |               F32 output_previous
      1036 |               F32 transition_deviation_latched
      1040 |               F32 selected_input
      1048 |           REINTICH_STRUCT first_integrator
      1048 |             REINTICH_COEFF_STRUCT * coeff
      1056 |             REINTICH_STATE_STRUCT state
      1056 |               F32 delay
      1060 |               BOOLEAN reset_on_init
      1064 |             REINTICH_INPUT_STRUCT input
      1064 |               F32 IC
      1068 |               F32 input
      1072 |               BOOLEAN run
      1073 |               BOOLEAN hold
      1076 |             REINTICH_OUTPUT_STRUCT output
      1076 |               F32 output
      1080 |           REINTICH_STRUCT second_integrator
      1080 |             REINTICH_COEFF_STRUCT * coeff
      1088 |             REINTICH_STATE_STRUCT state
      1088 |               F32 delay
      1092 |               BOOLEAN reset_on_init
      1096 |             REINTICH_INPUT_STRUCT input
      1096 |               F32 IC
      1100 |               F32 input
      1104 |               BOOLEAN run
      1105 |               BOOLEAN hold
      1108 |             REINTICH_OUTPUT_STRUCT output
      1108 |               F32 output
      1112 |           F32 first_feedback_delay
      1116 |           F32 second_feedback_delay
      1120 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1120 |           F32 input_one
      1124 |           F32 input_two
      1128 |           BOOLEAN switch_flag
      1132 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1132 |           F32 output
      1136 |       SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1136 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1144 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
      1144 |           SWITCH_COMMON_STRUCT common
      1144 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1152 |             SWITCH_COMMON_STATE_STRUCT state
      1152 |               PERSISTENT1SHOT_STRUCT transition_one_shot
      1152 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1160 |                 PERSISTENT1SHOT_STATE_STRUCT state
      1160 |                   BOOLEAN init
      1164 |                   U32 iteration
      1168 |                   BOOLEAN prev_input
      1172 |                 PERSISTENT1SHOT_INPUT_STRUCT input
      1172 |                   BOOLEAN input
      1173 |                   BOOLEAN reset
      1174 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
      1174 |                   BOOLEAN output
      1176 |               F32 output_previous
      1180 |               F32 transition_deviation_latched
      1184 |               F32 selected_input
      1192 |           REINTICH_STRUCT first_integrator
      1192 |             REINTICH_COEFF_STRUCT * coeff
      1200 |             REINTICH_STATE_STRUCT state
      1200 |               F32 delay
      1204 |               BOOLEAN reset_on_init
      1208 |             REINTICH_INPUT_STRUCT input
      1208 |               F32 IC
      1212 |               F32 input
      1216 |               BOOLEAN run
      1217 |               BOOLEAN hold
      1220 |             REINTICH_OUTPUT_STRUCT output
      1220 |               F32 output
      1224 |           REINTICH_STRUCT second_integrator
      1224 |             REINTICH_COEFF_STRUCT * coeff
      1232 |             REINTICH_STATE_STRUCT state
      1232 |               F32 delay
      1236 |               BOOLEAN reset_on_init
      1240 |             REINTICH_INPUT_STRUCT input
      1240 |               F32 IC
      1244 |               F32 input
      1248 |               BOOLEAN run
      1249 |               BOOLEAN hold
      1252 |             REINTICH_OUTPUT_STRUCT output
      1252 |               F32 output
      1256 |           F32 first_feedback_delay
      1260 |           F32 second_feedback_delay
      1264 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1264 |           F32 input_one
      1268 |           F32 input_two
      1272 |           BOOLEAN switch_flag
      1276 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1276 |           F32 output
      1280 |       TEST_PORT_STRUCT roll_testport
      1280 |         TEST_PORT_COEFF_STRUCT * coeff
      1288 |         TEST_PORT_INPUT_STRUCT input
      1288 |           F32 input
      1292 |         TEST_PORT_OUTPUT_STRUCT output
      1292 |           F32 output
      1296 |       TEST_PORT_STRUCT pitch_testport
      1296 |         TEST_PORT_COEFF_STRUCT * coeff
      1304 |         TEST_PORT_INPUT_STRUCT input
      1304 |           F32 input
      1308 |         TEST_PORT_OUTPUT_STRUCT output
      1308 |           F32 output
      1312 |       BOOLEAN first_frame
      1313 |       BOOLEAN adp_roll_rate_limited
      1314 |       BOOLEAN adp_pitch_rate_limited
      1320 |       SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1320 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1328 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
      1328 |           SWITCH_COMMON_STRUCT common
      1328 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1336 |             SWITCH_COMMON_STATE_STRUCT state
      1336 |               PERSISTENT1SHOT_STRUCT transition_one_shot
      1336 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1344 |                 PERSISTENT1SHOT_STATE_STRUCT state
      1344 |                   BOOLEAN init
      1348 |                   U32 iteration
      1352 |                   BOOLEAN prev_input
      1356 |                 PERSISTENT1SHOT_INPUT_STRUCT input
      1356 |                   BOOLEAN input
      1357 |                   BOOLEAN reset
      1358 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
      1358 |                   BOOLEAN output
      1360 |               F32 output_previous
      1364 |               F32 transition_deviation_latched
      1368 |               F32 selected_input
      1376 |           REINTICH_STRUCT first_integrator
      1376 |             REINTICH_COEFF_STRUCT * coeff
      1384 |             REINTICH_STATE_STRUCT state
      1384 |               F32 delay
      1388 |               BOOLEAN reset_on_init
      1392 |             REINTICH_INPUT_STRUCT input
      1392 |               F32 IC
      1396 |               F32 input
      1400 |               BOOLEAN run
      1401 |               BOOLEAN hold
      1404 |             REINTICH_OUTPUT_STRUCT output
      1404 |               F32 output
      1408 |           REINTICH_STRUCT second_integrator
      1408 |             REINTICH_COEFF_STRUCT * coeff
      1416 |             REINTICH_STATE_STRUCT state
      1416 |               F32 delay
      1420 |               BOOLEAN reset_on_init
      1424 |             REINTICH_INPUT_STRUCT input
      1424 |               F32 IC
      1428 |               F32 input
      1432 |               BOOLEAN run
      1433 |               BOOLEAN hold
      1436 |             REINTICH_OUTPUT_STRUCT output
      1436 |               F32 output
      1440 |           F32 first_feedback_delay
      1444 |           F32 second_feedback_delay
      1448 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1448 |           F32 input_one
      1452 |           F32 input_two
      1456 |           BOOLEAN switch_flag
      1460 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1460 |           F32 output
      1464 |       F32 switched_heading_rate
      1468 |       F32 roll_test_input
      1472 |       F32 pitch_test_input
      1480 |     CYCLIC_FEEDBACK_INPUT_STRUCT input
      1480 |       F32 adp_phi_cmd
      1484 |       F32 adp_theta_cmd
      1488 |       F32 phi
      1492 |       F32 phi_dot
      1496 |       F32 psi_dot
      1500 |       F32 theta
      1504 |       F32 theta_dot
      1508 |       F32 p
      1512 |       F32 q
      1516 |       BOOLEAN reset
      1517 |       BOOLEAN UAR_mode
      1518 |       BOOLEAN triplex_fault
      1520 |   UARMODELOGIC_STRUCT uar_mode_logic
      1520 |     UARMODELOGIC_COEFF_STRUCT * coeff_ptr
      1528 |     UARMODELOGIC_INPUT_STRUCT input
      1528 |       F32 phi
      1532 |       F32 theta
      1536 |       F32 p_filt
      1540 |       F32 q_filt
      1544 |       BOOLEAN run
      1545 |       BOOLEAN adp_fail
      1546 |       BOOLEAN disable_ADP
      1548 |     UARMODELOGIC_OUTPUT_STRUCT output
      1548 |       BOOLEAN phi_range_valid
      1549 |       BOOLEAN theta_range_valid
      1550 |       BOOLEAN uar_mode
      1552 |     UARMODELOGIC_STATE_STRUCT state
      1552 |       ROS_FLIPFLOP_STRUCT uar_mode_ff
      1552 |         ROS_FLIPFLOP_STATE_STRUCT state
      1552 |           F32 s1
      1556 |         ROS_FLIPFLOP_INPUT_STRUCT input
      1556 |           BOOLEAN set
      1557 |           BOOLEAN reset
      1558 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
      1558 |           BOOLEAN output
      1560 |       ROS_FLIPFLOP_STRUCT phi_range_ff
      1560 |         ROS_FLIPFLOP_STATE_STRUCT state
      1560 |           F32 s1
      1564 |         ROS_FLIPFLOP_INPUT_STRUCT input
      1564 |           BOOLEAN set
      1565 |           BOOLEAN reset
      1566 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
      1566 |           BOOLEAN output
      1568 |       ROS_FLIPFLOP_STRUCT theta_range_ff
      1568 |         ROS_FLIPFLOP_STATE_STRUCT state
      1568 |           F32 s1
      1572 |         ROS_FLIPFLOP_INPUT_STRUCT input
      1572 |           BOOLEAN set
      1573 |           BOOLEAN reset
      1574 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
      1574 |           BOOLEAN output
      1576 |       PERSISTENT1SHOT_STRUCT run_p1shot
      1576 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1584 |         PERSISTENT1SHOT_STATE_STRUCT state
      1584 |           BOOLEAN init
      1588 |           U32 iteration
      1592 |           BOOLEAN prev_input
      1596 |         PERSISTENT1SHOT_INPUT_STRUCT input
      1596 |           BOOLEAN input
      1597 |           BOOLEAN reset
      1598 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
      1598 |           BOOLEAN output
      1600 |       PERSISTENT1SHOT_STRUCT uar_hold_p1shot
      1600 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1608 |         PERSISTENT1SHOT_STATE_STRUCT state
      1608 |           BOOLEAN init
      1612 |           U32 iteration
      1616 |           BOOLEAN prev_input
      1620 |         PERSISTENT1SHOT_INPUT_STRUCT input
      1620 |           BOOLEAN input
      1621 |           BOOLEAN reset
      1622 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
      1622 |           BOOLEAN output
           | [sizeof=1624, align=8]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_STRUCT
         0 |   MCP_CONTROL_PRODUCER_COEFF_STRUCT * coeff_ptr
         8 |   MCP_CONTROL_PRODUCER_INPUT_STRUCT input
         8 |     BOOLEAN run
        12 |   MCP_CONTROL_PRODUCER_OUTPUT_STRUCT output
        12 |     CYCLIC_STRUCT feedback
        12 |       F32 roll
        16 |       F32 pitch
        20 |     BOOLEAN uar_mode
        21 |     BOOLEAN run_adp
        22 |     BOOLEAN phi_valid
        23 |     BOOLEAN theta_valid
        24 |   MCP_CONTROL_PRODUCER_STATE_STRUCT state
        24 |     CYCLIC_FEEDBACK_STRUCT cyclic_feedback
        24 |       CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
        32 |       CYCLIC_FEEDBACK_STATE_STRUCT state
        32 |         ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
        32 |           ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        40 |           ATTITUDE_CONTROLLER_INPUT_STRUCT input
        40 |             F32 rate_cross_axis
        44 |             F32 rate_near_axis
        48 |             F32 attitude_near_axis
        52 |             F32 adp_roll_cmd
        56 |             F32 adp_pitch_cmd
        60 |             BOOLEAN run_mode
        61 |             BOOLEAN uar_mode
        64 |           ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        64 |             F32 output
        72 |           ATTITUDE_CONTROLLER_STATE_STRUCT state
        72 |             SWITCH_SECOND_ORDER_STRUCT rate_switch
        72 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        80 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
        80 |                 SWITCH_COMMON_STRUCT common
        80 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        88 |                   SWITCH_COMMON_STATE_STRUCT state
        88 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
        88 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        96 |                       PERSISTENT1SHOT_STATE_STRUCT state
        96 |                         BOOLEAN init
       100 |                         U32 iteration
       104 |                         BOOLEAN prev_input
       108 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       108 |                         BOOLEAN input
       109 |                         BOOLEAN reset
       110 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       110 |                         BOOLEAN output
       112 |                     F32 output_previous
       116 |                     F32 transition_deviation_latched
       120 |                     F32 selected_input
       128 |                 REINTICH_STRUCT first_integrator
       128 |                   REINTICH_COEFF_STRUCT * coeff
       136 |                   REINTICH_STATE_STRUCT state
       136 |                     F32 delay
       140 |                     BOOLEAN reset_on_init
       144 |                   REINTICH_INPUT_STRUCT input
       144 |                     F32 IC
       148 |                     F32 input
       152 |                     BOOLEAN run
       153 |                     BOOLEAN hold
       156 |                   REINTICH_OUTPUT_STRUCT output
       156 |                     F32 output
       160 |                 REINTICH_STRUCT second_integrator
       160 |                   REINTICH_COEFF_STRUCT * coeff
       168 |                   REINTICH_STATE_STRUCT state
       168 |                     F32 delay
       172 |                     BOOLEAN reset_on_init
       176 |                   REINTICH_INPUT_STRUCT input
       176 |                     F32 IC
       180 |                     F32 input
       184 |                     BOOLEAN run
       185 |                     BOOLEAN hold
       188 |                   REINTICH_OUTPUT_STRUCT output
       188 |                     F32 output
       192 |                 F32 first_feedback_delay
       196 |                 F32 second_feedback_delay
       200 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       200 |                 F32 input_one
       204 |                 F32 input_two
       208 |                 BOOLEAN switch_flag
       212 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       212 |                 F32 output
       216 |             SWITCH_SECOND_ORDER_STRUCT attitude_switch
       216 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       224 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
       224 |                 SWITCH_COMMON_STRUCT common
       224 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       232 |                   SWITCH_COMMON_STATE_STRUCT state
       232 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
       232 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       240 |                       PERSISTENT1SHOT_STATE_STRUCT state
       240 |                         BOOLEAN init
       244 |                         U32 iteration
       248 |                         BOOLEAN prev_input
       252 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       252 |                         BOOLEAN input
       253 |                         BOOLEAN reset
       254 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       254 |                         BOOLEAN output
       256 |                     F32 output_previous
       260 |                     F32 transition_deviation_latched
       264 |                     F32 selected_input
       272 |                 REINTICH_STRUCT first_integrator
       272 |                   REINTICH_COEFF_STRUCT * coeff
       280 |                   REINTICH_STATE_STRUCT state
       280 |                     F32 delay
       284 |                     BOOLEAN reset_on_init
       288 |                   REINTICH_INPUT_STRUCT input
       288 |                     F32 IC
       292 |                     F32 input
       296 |                     BOOLEAN run
       297 |                     BOOLEAN hold
       300 |                   REINTICH_OUTPUT_STRUCT output
       300 |                     F32 output
       304 |                 REINTICH_STRUCT second_integrator
       304 |                   REINTICH_COEFF_STRUCT * coeff
       312 |                   REINTICH_STATE_STRUCT state
       312 |                     F32 delay
       316 |                     BOOLEAN reset_on_init
       320 |                   REINTICH_INPUT_STRUCT input
       320 |                     F32 IC
       324 |                     F32 input
       328 |                     BOOLEAN run
       329 |                     BOOLEAN hold
       332 |                   REINTICH_OUTPUT_STRUCT output
       332 |                     F32 output
       336 |                 F32 first_feedback_delay
       340 |                 F32 second_feedback_delay
       344 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       344 |                 F32 input_one
       348 |                 F32 input_two
       352 |                 BOOLEAN switch_flag
       356 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       356 |                 F32 output
       360 |             REINTICH_STRUCT reintich
       360 |               REINTICH_COEFF_STRUCT * coeff
       368 |               REINTICH_STATE_STRUCT state
       368 |                 F32 delay
       372 |                 BOOLEAN reset_on_init
       376 |               REINTICH_INPUT_STRUCT input
       376 |                 F32 IC
       380 |                 F32 input
       384 |                 BOOLEAN run
       385 |                 BOOLEAN hold
       388 |               REINTICH_OUTPUT_STRUCT output
       388 |                 F32 output
       392 |             REINTICHS_STRUCT reintichs
       392 |               REINTICHS_COEFF_STRUCT * coeff
       400 |               REINTICHS_STATE_STRUCT state
       400 |                 F32 IC_delay
       404 |                 F32 rail_bounce
       408 |                 BOOLEAN prev_sat_UL
       409 |                 BOOLEAN prev_sat_LL
       410 |                 BOOLEAN prev_sat_inv
       411 |                 BOOLEAN prev_reset_int
       412 |                 BOOLEAN prev_reset_sat
       416 |                 REINTICH_STRUCT integrator
       416 |                   REINTICH_COEFF_STRUCT * coeff
       424 |                   REINTICH_STATE_STRUCT state
       424 |                     F32 delay
       428 |                     BOOLEAN reset_on_init
       432 |                   REINTICH_INPUT_STRUCT input
       432 |                     F32 IC
       436 |                     F32 input
       440 |                     BOOLEAN run
       441 |                     BOOLEAN hold
       444 |                   REINTICH_OUTPUT_STRUCT output
       444 |                     F32 output
       448 |                 SATURATIONVF_STRUCT sat
       448 |                   SATURATIONVF_COEFF_STRUCT * coeff
       456 |                   SATURATIONVF_STATE_STRUCT state
       456 |                     F32 delay
       460 |                     BOOLEAN reset_on_init
       464 |                   SATURATIONVF_INPUT_STRUCT input
       464 |                     F32 IC
       468 |                     F32 input
       472 |                     BOOLEAN reset
       476 |                   SATURATIONVF_OUTPUT_STRUCT output
       476 |                     F32 output
       480 |                     BOOLEAN inv
       481 |                     BOOLEAN satLo
       482 |                     BOOLEAN satHi
       488 |               REINTICHS_INPUT_STRUCT input
       488 |                 F32 IC
       492 |                 F32 input
       496 |                 BOOLEAN run
       497 |                 BOOLEAN hold
       500 |               REINTICHS_OUTPUT_STRUCT output
       500 |                 F32 output
       504 |                 BOOLEAN sat_UL
       505 |                 BOOLEAN sat_LL
       506 |                 BOOLEAN inv
       512 |             BOOLEAN prev_run
       513 |             BOOLEAN integ_sat
       520 |         ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       520 |           ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       528 |           ATTITUDE_CONTROLLER_INPUT_STRUCT input
       528 |             F32 rate_cross_axis
       532 |             F32 rate_near_axis
       536 |             F32 attitude_near_axis
       540 |             F32 adp_roll_cmd
       544 |             F32 adp_pitch_cmd
       548 |             BOOLEAN run_mode
       549 |             BOOLEAN uar_mode
       552 |           ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       552 |             F32 output
       560 |           ATTITUDE_CONTROLLER_STATE_STRUCT state
       560 |             SWITCH_SECOND_ORDER_STRUCT rate_switch
       560 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       568 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
       568 |                 SWITCH_COMMON_STRUCT common
       568 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       576 |                   SWITCH_COMMON_STATE_STRUCT state
       576 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
       576 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       584 |                       PERSISTENT1SHOT_STATE_STRUCT state
       584 |                         BOOLEAN init
       588 |                         U32 iteration
       592 |                         BOOLEAN prev_input
       596 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       596 |                         BOOLEAN input
       597 |                         BOOLEAN reset
       598 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       598 |                         BOOLEAN output
       600 |                     F32 output_previous
       604 |                     F32 transition_deviation_latched
       608 |                     F32 selected_input
       616 |                 REINTICH_STRUCT first_integrator
       616 |                   REINTICH_COEFF_STRUCT * coeff
       624 |                   REINTICH_STATE_STRUCT state
       624 |                     F32 delay
       628 |                     BOOLEAN reset_on_init
       632 |                   REINTICH_INPUT_STRUCT input
       632 |                     F32 IC
       636 |                     F32 input
       640 |                     BOOLEAN run
       641 |                     BOOLEAN hold
       644 |                   REINTICH_OUTPUT_STRUCT output
       644 |                     F32 output
       648 |                 REINTICH_STRUCT second_integrator
       648 |                   REINTICH_COEFF_STRUCT * coeff
       656 |                   REINTICH_STATE_STRUCT state
       656 |                     F32 delay
       660 |                     BOOLEAN reset_on_init
       664 |                   REINTICH_INPUT_STRUCT input
       664 |                     F32 IC
       668 |                     F32 input
       672 |                     BOOLEAN run
       673 |                     BOOLEAN hold
       676 |                   REINTICH_OUTPUT_STRUCT output
       676 |                     F32 output
       680 |                 F32 first_feedback_delay
       684 |                 F32 second_feedback_delay
       688 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       688 |                 F32 input_one
       692 |                 F32 input_two
       696 |                 BOOLEAN switch_flag
       700 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       700 |                 F32 output
       704 |             SWITCH_SECOND_ORDER_STRUCT attitude_switch
       704 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       712 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
       712 |                 SWITCH_COMMON_STRUCT common
       712 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       720 |                   SWITCH_COMMON_STATE_STRUCT state
       720 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
       720 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       728 |                       PERSISTENT1SHOT_STATE_STRUCT state
       728 |                         BOOLEAN init
       732 |                         U32 iteration
       736 |                         BOOLEAN prev_input
       740 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       740 |                         BOOLEAN input
       741 |                         BOOLEAN reset
       742 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       742 |                         BOOLEAN output
       744 |                     F32 output_previous
       748 |                     F32 transition_deviation_latched
       752 |                     F32 selected_input
       760 |                 REINTICH_STRUCT first_integrator
       760 |                   REINTICH_COEFF_STRUCT * coeff
       768 |                   REINTICH_STATE_STRUCT state
       768 |                     F32 delay
       772 |                     BOOLEAN reset_on_init
       776 |                   REINTICH_INPUT_STRUCT input
       776 |                     F32 IC
       780 |                     F32 input
       784 |                     BOOLEAN run
       785 |                     BOOLEAN hold
       788 |                   REINTICH_OUTPUT_STRUCT output
       788 |                     F32 output
       792 |                 REINTICH_STRUCT second_integrator
       792 |                   REINTICH_COEFF_STRUCT * coeff
       800 |                   REINTICH_STATE_STRUCT state
       800 |                     F32 delay
       804 |                     BOOLEAN reset_on_init
       808 |                   REINTICH_INPUT_STRUCT input
       808 |                     F32 IC
       812 |                     F32 input
       816 |                     BOOLEAN run
       817 |                     BOOLEAN hold
       820 |                   REINTICH_OUTPUT_STRUCT output
       820 |                     F32 output
       824 |                 F32 first_feedback_delay
       828 |                 F32 second_feedback_delay
       832 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       832 |                 F32 input_one
       836 |                 F32 input_two
       840 |                 BOOLEAN switch_flag
       844 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       844 |                 F32 output
       848 |             REINTICH_STRUCT reintich
       848 |               REINTICH_COEFF_STRUCT * coeff
       856 |               REINTICH_STATE_STRUCT state
       856 |                 F32 delay
       860 |                 BOOLEAN reset_on_init
       864 |               REINTICH_INPUT_STRUCT input
       864 |                 F32 IC
       868 |                 F32 input
       872 |                 BOOLEAN run
       873 |                 BOOLEAN hold
       876 |               REINTICH_OUTPUT_STRUCT output
       876 |                 F32 output
       880 |             REINTICHS_STRUCT reintichs
       880 |               REINTICHS_COEFF_STRUCT * coeff
       888 |               REINTICHS_STATE_STRUCT state
       888 |                 F32 IC_delay
       892 |                 F32 rail_bounce
       896 |                 BOOLEAN prev_sat_UL
       897 |                 BOOLEAN prev_sat_LL
       898 |                 BOOLEAN prev_sat_inv
       899 |                 BOOLEAN prev_reset_int
       900 |                 BOOLEAN prev_reset_sat
       904 |                 REINTICH_STRUCT integrator
       904 |                   REINTICH_COEFF_STRUCT * coeff
       912 |                   REINTICH_STATE_STRUCT state
       912 |                     F32 delay
       916 |                     BOOLEAN reset_on_init
       920 |                   REINTICH_INPUT_STRUCT input
       920 |                     F32 IC
       924 |                     F32 input
       928 |                     BOOLEAN run
       929 |                     BOOLEAN hold
       932 |                   REINTICH_OUTPUT_STRUCT output
       932 |                     F32 output
       936 |                 SATURATIONVF_STRUCT sat
       936 |                   SATURATIONVF_COEFF_STRUCT * coeff
       944 |                   SATURATIONVF_STATE_STRUCT state
       944 |                     F32 delay
       948 |                     BOOLEAN reset_on_init
       952 |                   SATURATIONVF_INPUT_STRUCT input
       952 |                     F32 IC
       956 |                     F32 input
       960 |                     BOOLEAN reset
       964 |                   SATURATIONVF_OUTPUT_STRUCT output
       964 |                     F32 output
       968 |                     BOOLEAN inv
       969 |                     BOOLEAN satLo
       970 |                     BOOLEAN satHi
       976 |               REINTICHS_INPUT_STRUCT input
       976 |                 F32 IC
       980 |                 F32 input
       984 |                 BOOLEAN run
       985 |                 BOOLEAN hold
       988 |               REINTICHS_OUTPUT_STRUCT output
       988 |                 F32 output
       992 |                 BOOLEAN sat_UL
       993 |                 BOOLEAN sat_LL
       994 |                 BOOLEAN inv
      1000 |             BOOLEAN prev_run
      1001 |             BOOLEAN integ_sat
      1008 |         F32 roll_rate_limiter_previous_state
      1012 |         F32 pitch_rate_limiter_previous_state
      1016 |         SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
      1016 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1024 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
      1024 |             SWITCH_COMMON_STRUCT common
      1024 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1032 |               SWITCH_COMMON_STATE_STRUCT state
      1032 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
      1032 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1040 |                   PERSISTENT1SHOT_STATE_STRUCT state
      1040 |                     BOOLEAN init
      1044 |                     U32 iteration
      1048 |                     BOOLEAN prev_input
      1052 |                   PERSISTENT1SHOT_INPUT_STRUCT input
      1052 |                     BOOLEAN input
      1053 |                     BOOLEAN reset
      1054 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
      1054 |                     BOOLEAN output
      1056 |                 F32 output_previous
      1060 |                 F32 transition_deviation_latched
      1064 |                 F32 selected_input
      1072 |             REINTICH_STRUCT first_integrator
      1072 |               REINTICH_COEFF_STRUCT * coeff
      1080 |               REINTICH_STATE_STRUCT state
      1080 |                 F32 delay
      1084 |                 BOOLEAN reset_on_init
      1088 |               REINTICH_INPUT_STRUCT input
      1088 |                 F32 IC
      1092 |                 F32 input
      1096 |                 BOOLEAN run
      1097 |                 BOOLEAN hold
      1100 |               REINTICH_OUTPUT_STRUCT output
      1100 |                 F32 output
      1104 |             REINTICH_STRUCT second_integrator
      1104 |               REINTICH_COEFF_STRUCT * coeff
      1112 |               REINTICH_STATE_STRUCT state
      1112 |                 F32 delay
      1116 |                 BOOLEAN reset_on_init
      1120 |               REINTICH_INPUT_STRUCT input
      1120 |                 F32 IC
      1124 |                 F32 input
      1128 |                 BOOLEAN run
      1129 |                 BOOLEAN hold
      1132 |               REINTICH_OUTPUT_STRUCT output
      1132 |                 F32 output
      1136 |             F32 first_feedback_delay
      1140 |             F32 second_feedback_delay
      1144 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1144 |             F32 input_one
      1148 |             F32 input_two
      1152 |             BOOLEAN switch_flag
      1156 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1156 |             F32 output
      1160 |         SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1160 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1168 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
      1168 |             SWITCH_COMMON_STRUCT common
      1168 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1176 |               SWITCH_COMMON_STATE_STRUCT state
      1176 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
      1176 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1184 |                   PERSISTENT1SHOT_STATE_STRUCT state
      1184 |                     BOOLEAN init
      1188 |                     U32 iteration
      1192 |                     BOOLEAN prev_input
      1196 |                   PERSISTENT1SHOT_INPUT_STRUCT input
      1196 |                     BOOLEAN input
      1197 |                     BOOLEAN reset
      1198 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
      1198 |                     BOOLEAN output
      1200 |                 F32 output_previous
      1204 |                 F32 transition_deviation_latched
      1208 |                 F32 selected_input
      1216 |             REINTICH_STRUCT first_integrator
      1216 |               REINTICH_COEFF_STRUCT * coeff
      1224 |               REINTICH_STATE_STRUCT state
      1224 |                 F32 delay
      1228 |                 BOOLEAN reset_on_init
      1232 |               REINTICH_INPUT_STRUCT input
      1232 |                 F32 IC
      1236 |                 F32 input
      1240 |                 BOOLEAN run
      1241 |                 BOOLEAN hold
      1244 |               REINTICH_OUTPUT_STRUCT output
      1244 |                 F32 output
      1248 |             REINTICH_STRUCT second_integrator
      1248 |               REINTICH_COEFF_STRUCT * coeff
      1256 |               REINTICH_STATE_STRUCT state
      1256 |                 F32 delay
      1260 |                 BOOLEAN reset_on_init
      1264 |               REINTICH_INPUT_STRUCT input
      1264 |                 F32 IC
      1268 |                 F32 input
      1272 |                 BOOLEAN run
      1273 |                 BOOLEAN hold
      1276 |               REINTICH_OUTPUT_STRUCT output
      1276 |                 F32 output
      1280 |             F32 first_feedback_delay
      1284 |             F32 second_feedback_delay
      1288 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1288 |             F32 input_one
      1292 |             F32 input_two
      1296 |             BOOLEAN switch_flag
      1300 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1300 |             F32 output
      1304 |         TEST_PORT_STRUCT roll_testport
      1304 |           TEST_PORT_COEFF_STRUCT * coeff
      1312 |           TEST_PORT_INPUT_STRUCT input
      1312 |             F32 input
      1316 |           TEST_PORT_OUTPUT_STRUCT output
      1316 |             F32 output
      1320 |         TEST_PORT_STRUCT pitch_testport
      1320 |           TEST_PORT_COEFF_STRUCT * coeff
      1328 |           TEST_PORT_INPUT_STRUCT input
      1328 |             F32 input
      1332 |           TEST_PORT_OUTPUT_STRUCT output
      1332 |             F32 output
      1336 |         BOOLEAN first_frame
      1337 |         BOOLEAN adp_roll_rate_limited
      1338 |         BOOLEAN adp_pitch_rate_limited
      1344 |         SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1344 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1352 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
      1352 |             SWITCH_COMMON_STRUCT common
      1352 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1360 |               SWITCH_COMMON_STATE_STRUCT state
      1360 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
      1360 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1368 |                   PERSISTENT1SHOT_STATE_STRUCT state
      1368 |                     BOOLEAN init
      1372 |                     U32 iteration
      1376 |                     BOOLEAN prev_input
      1380 |                   PERSISTENT1SHOT_INPUT_STRUCT input
      1380 |                     BOOLEAN input
      1381 |                     BOOLEAN reset
      1382 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
      1382 |                     BOOLEAN output
      1384 |                 F32 output_previous
      1388 |                 F32 transition_deviation_latched
      1392 |                 F32 selected_input
      1400 |             REINTICH_STRUCT first_integrator
      1400 |               REINTICH_COEFF_STRUCT * coeff
      1408 |               REINTICH_STATE_STRUCT state
      1408 |                 F32 delay
      1412 |                 BOOLEAN reset_on_init
      1416 |               REINTICH_INPUT_STRUCT input
      1416 |                 F32 IC
      1420 |                 F32 input
      1424 |                 BOOLEAN run
      1425 |                 BOOLEAN hold
      1428 |               REINTICH_OUTPUT_STRUCT output
      1428 |                 F32 output
      1432 |             REINTICH_STRUCT second_integrator
      1432 |               REINTICH_COEFF_STRUCT * coeff
      1440 |               REINTICH_STATE_STRUCT state
      1440 |                 F32 delay
      1444 |                 BOOLEAN reset_on_init
      1448 |               REINTICH_INPUT_STRUCT input
      1448 |                 F32 IC
      1452 |                 F32 input
      1456 |                 BOOLEAN run
      1457 |                 BOOLEAN hold
      1460 |               REINTICH_OUTPUT_STRUCT output
      1460 |                 F32 output
      1464 |             F32 first_feedback_delay
      1468 |             F32 second_feedback_delay
      1472 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1472 |             F32 input_one
      1476 |             F32 input_two
      1480 |             BOOLEAN switch_flag
      1484 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1484 |             F32 output
      1488 |         F32 switched_heading_rate
      1492 |         F32 roll_test_input
      1496 |         F32 pitch_test_input
      1504 |       CYCLIC_FEEDBACK_INPUT_STRUCT input
      1504 |         F32 adp_phi_cmd
      1508 |         F32 adp_theta_cmd
      1512 |         F32 phi
      1516 |         F32 phi_dot
      1520 |         F32 psi_dot
      1524 |         F32 theta
      1528 |         F32 theta_dot
      1532 |         F32 p
      1536 |         F32 q
      1540 |         BOOLEAN reset
      1541 |         BOOLEAN UAR_mode
      1542 |         BOOLEAN triplex_fault
      1544 |     UARMODELOGIC_STRUCT uar_mode_logic
      1544 |       UARMODELOGIC_COEFF_STRUCT * coeff_ptr
      1552 |       UARMODELOGIC_INPUT_STRUCT input
      1552 |         F32 phi
      1556 |         F32 theta
      1560 |         F32 p_filt
      1564 |         F32 q_filt
      1568 |         BOOLEAN run
      1569 |         BOOLEAN adp_fail
      1570 |         BOOLEAN disable_ADP
      1572 |       UARMODELOGIC_OUTPUT_STRUCT output
      1572 |         BOOLEAN phi_range_valid
      1573 |         BOOLEAN theta_range_valid
      1574 |         BOOLEAN uar_mode
      1576 |       UARMODELOGIC_STATE_STRUCT state
      1576 |         ROS_FLIPFLOP_STRUCT uar_mode_ff
      1576 |           ROS_FLIPFLOP_STATE_STRUCT state
      1576 |             F32 s1
      1580 |           ROS_FLIPFLOP_INPUT_STRUCT input
      1580 |             BOOLEAN set
      1581 |             BOOLEAN reset
      1582 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
      1582 |             BOOLEAN output
      1584 |         ROS_FLIPFLOP_STRUCT phi_range_ff
      1584 |           ROS_FLIPFLOP_STATE_STRUCT state
      1584 |             F32 s1
      1588 |           ROS_FLIPFLOP_INPUT_STRUCT input
      1588 |             BOOLEAN set
      1589 |             BOOLEAN reset
      1590 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
      1590 |             BOOLEAN output
      1592 |         ROS_FLIPFLOP_STRUCT theta_range_ff
      1592 |           ROS_FLIPFLOP_STATE_STRUCT state
      1592 |             F32 s1
      1596 |           ROS_FLIPFLOP_INPUT_STRUCT input
      1596 |             BOOLEAN set
      1597 |             BOOLEAN reset
      1598 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
      1598 |             BOOLEAN output
      1600 |         PERSISTENT1SHOT_STRUCT run_p1shot
      1600 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1608 |           PERSISTENT1SHOT_STATE_STRUCT state
      1608 |             BOOLEAN init
      1612 |             U32 iteration
      1616 |             BOOLEAN prev_input
      1620 |           PERSISTENT1SHOT_INPUT_STRUCT input
      1620 |             BOOLEAN input
      1621 |             BOOLEAN reset
      1622 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
      1622 |             BOOLEAN output
      1624 |         PERSISTENT1SHOT_STRUCT uar_hold_p1shot
      1624 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1632 |           PERSISTENT1SHOT_STATE_STRUCT state
      1632 |             BOOLEAN init
      1636 |             U32 iteration
      1640 |             BOOLEAN prev_input
      1644 |           PERSISTENT1SHOT_INPUT_STRUCT input
      1644 |             BOOLEAN input
      1645 |             BOOLEAN reset
      1646 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
      1646 |             BOOLEAN output
           | [sizeof=1648, align=8]

*** Dumping AST Record Layout
         0 | EULER_ANGLES
         0 |   F32 phi
         4 |   F32 theta
         8 |   F32 psi
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | EULER_RATES
         0 |   F32 phi_dot
         4 |   F32 theta_dot
         8 |   F32 psi_dot
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:167:9)
     0:0-0 |   U32 UAR_Mode
     0:1-1 |   U32 Pilot_Override
     0:2-2 |   U32 Autopilot_Engaged
     0:3-3 |   U32 Autopilot_Ready
     0:4-4 |   U32 Roll_Rate_Fail
     0:5-5 |   U32 Roll_ADP_Cmd_Fail
     0:6-6 |   U32 Roll_ACT_POS_Fail
     0:7-7 |   U32 Roll_ATT_Fail
     1:0-0 |   U32 Pitch_Rate_Fail
     1:1-1 |   U32 Pitch_ADP_Cmd_Fail
     1:2-2 |   U32 Pitch_ACT_Pos_Fail
     1:3-3 |   U32 Pitch_ATT_Fail
     1:4-4 |   U32 Roll_Servoloop_CurrSatLL
     1:5-5 |   U32 Roll_Servoloop_CurrSatUL
     1:6-6 |   U32 Roll_Servoloop_PLSat
     1:7-7 |   U32 Roll_Servoloop_PLInv
     2:0-0 |   U32 Roll_Servoloop_RLSat
     2:1-1 |   U32 Pitch_Servoloop_CurrSatLL
     2:2-2 |   U32 Pitch_Servoloop_CurrSatUL
     2:3-3 |   U32 Pitch_Servoloop_PLSat
     2:4-4 |   U32 Pitch_Servoloop_PLInv
     2:5-5 |   U32 Pitch_Servoloop_RLSat
     2:6-6 |   U32 CPD_Input
     2:7-7 |   U32 Video_Sync_Light_Output
     3:0-0 |   U32 Combined_Fail_Status
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | union TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:165:5)
         0 |   U32 flags
         0 |   struct TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:167:9) flags1
     0:0-0 |     U32 UAR_Mode
     0:1-1 |     U32 Pilot_Override
     0:2-2 |     U32 Autopilot_Engaged
     0:3-3 |     U32 Autopilot_Ready
     0:4-4 |     U32 Roll_Rate_Fail
     0:5-5 |     U32 Roll_ADP_Cmd_Fail
     0:6-6 |     U32 Roll_ACT_POS_Fail
     0:7-7 |     U32 Roll_ATT_Fail
     1:0-0 |     U32 Pitch_Rate_Fail
     1:1-1 |     U32 Pitch_ADP_Cmd_Fail
     1:2-2 |     U32 Pitch_ACT_Pos_Fail
     1:3-3 |     U32 Pitch_ATT_Fail
     1:4-4 |     U32 Roll_Servoloop_CurrSatLL
     1:5-5 |     U32 Roll_Servoloop_CurrSatUL
     1:6-6 |     U32 Roll_Servoloop_PLSat
     1:7-7 |     U32 Roll_Servoloop_PLInv
     2:0-0 |     U32 Roll_Servoloop_RLSat
     2:1-1 |     U32 Pitch_Servoloop_CurrSatLL
     2:2-2 |     U32 Pitch_Servoloop_CurrSatUL
     2:3-3 |     U32 Pitch_Servoloop_PLSat
     2:4-4 |     U32 Pitch_Servoloop_PLInv
     2:5-5 |     U32 Pitch_Servoloop_RLSat
     2:6-6 |     U32 CPD_Input
     2:7-7 |     U32 Video_Sync_Light_Output
     3:0-0 |     U32 Combined_Fail_Status
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TELEMETRY_LOG_STRUCT
         0 |   U32 framenumber
         4 |   EULER_ANGLES eulers
         4 |     F32 phi
         8 |     F32 theta
        12 |     F32 psi
        16 |   VECTOR3 mags
        16 |     F32 X
        20 |     F32 Y
        24 |     F32 Z
        28 |   VECTOR3 rates
        28 |     F32 X
        32 |     F32 Y
        36 |     F32 Z
        40 |   VECTOR3 accels
        40 |     F32 X
        44 |     F32 Y
        48 |     F32 Z
        52 |   EULER_RATES euler_rates
        52 |     F32 phi_dot
        56 |     F32 theta_dot
        60 |     F32 psi_dot
        64 |   CYCLIC_STRUCT actuator_positions
        64 |     F32 roll
        68 |     F32 pitch
        72 |   CYCLIC_STRUCT actuator_commands
        72 |     F32 roll
        76 |     F32 pitch
        80 |   CYCLIC_STRUCT motor_A_current
        80 |     F32 roll
        84 |     F32 pitch
        88 |   CYCLIC_STRUCT motor_B_current
        88 |     F32 roll
        92 |     F32 pitch
        96 |   CYCLIC_STRUCT actuator_mvc
        96 |     F32 roll
       100 |     F32 pitch
       104 |   F32 IAS
       108 |   F32 TAS
       112 |   F32 baro_altitude
       116 |   F32 oat
       120 |   U32 latest_fault
       124 |   U8 button_states
       128 |   union TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:165:5) u
       128 |     U32 flags
       128 |     struct TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:167:9) flags1
   128:0-0 |       U32 UAR_Mode
   128:1-1 |       U32 Pilot_Override
   128:2-2 |       U32 Autopilot_Engaged
   128:3-3 |       U32 Autopilot_Ready
   128:4-4 |       U32 Roll_Rate_Fail
   128:5-5 |       U32 Roll_ADP_Cmd_Fail
   128:6-6 |       U32 Roll_ACT_POS_Fail
   128:7-7 |       U32 Roll_ATT_Fail
   129:0-0 |       U32 Pitch_Rate_Fail
   129:1-1 |       U32 Pitch_ADP_Cmd_Fail
   129:2-2 |       U32 Pitch_ACT_Pos_Fail
   129:3-3 |       U32 Pitch_ATT_Fail
   129:4-4 |       U32 Roll_Servoloop_CurrSatLL
   129:5-5 |       U32 Roll_Servoloop_CurrSatUL
   129:6-6 |       U32 Roll_Servoloop_PLSat
   129:7-7 |       U32 Roll_Servoloop_PLInv
   130:0-0 |       U32 Roll_Servoloop_RLSat
   130:1-1 |       U32 Pitch_Servoloop_CurrSatLL
   130:2-2 |       U32 Pitch_Servoloop_CurrSatUL
   130:3-3 |       U32 Pitch_Servoloop_PLSat
   130:4-4 |       U32 Pitch_Servoloop_PLInv
   130:5-5 |       U32 Pitch_Servoloop_RLSat
   130:6-6 |       U32 CPD_Input
   130:7-7 |       U32 Video_Sync_Light_Output
   131:0-0 |       U32 Combined_Fail_Status
       132 |   U32 flags2
           | [sizeof=136, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2600b50 <..\..\..\Common\Header/Helitrak_Types.h:222:9, line:227:1> line:222:9 struct definition
|-FullComment 0x2c63e98 <line:217:4, line:221:76>
| |-ParagraphComment 0x2c63c98 <line:217:4, line:218:4>
| | |-TextComment 0x2c63c48 <line:217:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c63c68 <line:218:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c63cb8 <col:5, col:26> Text=" EULER_ANGLES"
| |-ParagraphComment 0x2c63d20 <line:219:1, col:4>
| | `-TextComment 0x2c63cf8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c63d40 <col:5, line:221:76> Name="brief"
|   `-ParagraphComment 0x2c63e58 <line:219:11, line:221:76>
|     |-TextComment 0x2c63d68 <line:219:11, col:55> Text=" Structure which holds the three euler angles"
|     |-TextComment 0x2c63d88 <line:220:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c63dd0 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2c63df0 <col:16, col:34> Text="{HAP1-SDD-COM, 829}"
|     `-TextComment 0x2c63e10 <line:221:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2600c10 <line:224:5, col:9> col:9 phi 'F32':'float'
|-FieldDecl 0x2600c70 <line:225:5, col:9> col:9 theta 'F32':'float'
`-FieldDecl 0x2600cd0 <line:226:5, col:9> col:9 psi 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.EULER_ANGLES = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2600530 <..\..\..\Common\Header/Helitrak_Types.h:196:9, line:201:1> line:196:9 struct definition
|-FullComment 0x2c66158 <line:191:4, line:195:76>
| |-ParagraphComment 0x2c63f48 <line:191:4, line:192:4>
| | |-TextComment 0x2c63ef8 <line:191:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c63f18 <line:192:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c63f68 <col:5, col:21> Text=" VECTOR3"
| |-ParagraphComment 0x2c63fd0 <line:193:1, col:4>
| | `-TextComment 0x2c63fa8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c63ff0 <col:5, line:195:76> Name="brief"
|   `-ParagraphComment 0x2c66118 <line:193:11, line:195:76>
|     |-TextComment 0x2c64018 <line:193:11, col:59> Text=" Structure which holds the elements of a 3-vector"
|     |-TextComment 0x2c64038 <line:194:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c64058 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2c64078 <col:16, col:34> Text="{HAP1-SDD-COM, 534}"
|     `-TextComment 0x2c660d0 <line:195:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2600610 <line:198:5, col:9> col:9 X 'F32':'float'
|-FieldDecl 0x2600670 <line:199:5, col:9> col:9 Y 'F32':'float'
`-FieldDecl 0x26006d0 <line:200:5, col:9> col:9 Z 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.VECTOR3 = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2600e10 <..\..\..\Common\Header/Helitrak_Types.h:235:9, line:240:1> line:235:9 struct definition
|-FullComment 0x2c663e0 <line:230:4, line:234:76>
| |-ParagraphComment 0x2c66208 <line:230:4, line:231:4>
| | |-TextComment 0x2c661b8 <line:230:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c661d8 <line:231:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c66228 <col:5, col:25> Text=" EULER_RATES"
| |-ParagraphComment 0x2c66290 <line:232:1, col:4>
| | `-TextComment 0x2c66268 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c662b0 <col:5, line:234:76> Name="brief"
|   `-ParagraphComment 0x2c663a0 <line:232:11, line:234:76>
|     |-TextComment 0x2c662d8 <line:232:11, col:83> Text=" Structure which holds the rates of rotation about the three euler angles"
|     |-TextComment 0x2c662f8 <line:233:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c66318 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2c66338 <col:16, col:35> Text="{HAP1-SDD-COM, 2517}"
|     `-TextComment 0x2c66358 <line:234:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2600ed0 <line:237:5, col:9> col:9 phi_dot 'F32':'float'
|-FieldDecl 0x2600f30 <line:238:5, col:9> col:9 theta_dot 'F32':'float'
`-FieldDecl 0x2600f90 <line:239:5, col:9> col:9 psi_dot 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.EULER_RATES = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2601e80 <..\..\..\Common\Header/Helitrak_Types.h:320:9, line:324:1> line:320:9 struct definition
|-FullComment 0x2c66668 <line:315:4, line:319:76>
| |-ParagraphComment 0x2c66490 <line:315:4, line:316:4>
| | |-TextComment 0x2c66440 <line:315:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c66460 <line:316:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c664b0 <col:5, col:27> Text=" CYCLIC_STRUCT"
| |-ParagraphComment 0x2c66518 <line:317:1, col:4>
| | `-TextComment 0x2c664f0 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c66538 <col:5, line:319:76> Name="brief"
|   `-ParagraphComment 0x2c66628 <line:317:11, line:319:76>
|     |-TextComment 0x2c66560 <line:317:11, col:52> Text=" Structure which holds the pitch and roll "
|     |-TextComment 0x2c66580 <line:318:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c665a0 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2c665c0 <col:16, col:35> Text="{HAP1-SDD-COM, 2534}"
|     `-TextComment 0x2c665e0 <line:319:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2601f40 <line:322:5, col:9> col:9 roll 'F32':'float'
`-FieldDecl 0x2601fa0 <line:323:5, col:9> col:9 pitch 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.CYCLIC_STRUCT = type { float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2657910 <..\..\..\MCP\Header\Telemetry_Log.h:167:9, line:199:9> line:167:9 struct definition
|-FieldDecl 0x26579f8 <line:168:13, col:47> col:17 UAR_Mode 'U32':'unsigned long'
| `-IntegerLiteral 0x26579c0 <col:47> 'int' 1
|-FieldDecl 0x2657a80 <line:169:13, col:47> col:17 Pilot_Override 'U32':'unsigned long'
| `-IntegerLiteral 0x2657a48 <col:47> 'int' 1
|-FieldDecl 0x2657b08 <line:170:13, col:47> col:17 Autopilot_Engaged 'U32':'unsigned long'
| `-IntegerLiteral 0x2657ad0 <col:47> 'int' 1
|-FieldDecl 0x2657b90 <line:171:13, col:47> col:17 Autopilot_Ready 'U32':'unsigned long'
| `-IntegerLiteral 0x2657b58 <col:47> 'int' 1
|-FieldDecl 0x2657c18 <line:173:13, col:47> col:17 Roll_Rate_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657be0 <col:47> 'int' 1
|-FieldDecl 0x2657ca0 <line:174:13, col:47> col:17 Roll_ADP_Cmd_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657c68 <col:47> 'int' 1
|-FieldDecl 0x2657d28 <line:175:13, col:47> col:17 Roll_ACT_POS_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657cf0 <col:47> 'int' 1
|-FieldDecl 0x2657db0 <line:176:13, col:47> col:17 Roll_ATT_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657d78 <col:47> 'int' 1
|-FieldDecl 0x2657e38 <line:178:13, col:47> col:17 Pitch_Rate_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657e00 <col:47> 'int' 1
|-FieldDecl 0x2657ec0 <line:179:13, col:47> col:17 Pitch_ADP_Cmd_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657e88 <col:47> 'int' 1
|-FieldDecl 0x2657f48 <line:180:13, col:47> col:17 Pitch_ACT_Pos_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657f10 <col:47> 'int' 1
|-FieldDecl 0x2657fd0 <line:181:13, col:47> col:17 Pitch_ATT_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2657f98 <col:47> 'int' 1
|-FieldDecl 0x2658058 <line:183:13, col:47> col:17 Roll_Servoloop_CurrSatLL 'U32':'unsigned long'
| `-IntegerLiteral 0x2658020 <col:47> 'int' 1
|-FieldDecl 0x26580e0 <line:184:13, col:47> col:17 Roll_Servoloop_CurrSatUL 'U32':'unsigned long'
| `-IntegerLiteral 0x26580a8 <col:47> 'int' 1
|-FieldDecl 0x2658168 <line:185:13, col:47> col:17 Roll_Servoloop_PLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x2658130 <col:47> 'int' 1
|-FieldDecl 0x26581f0 <line:186:13, col:47> col:17 Roll_Servoloop_PLInv 'U32':'unsigned long'
| `-IntegerLiteral 0x26581b8 <col:47> 'int' 1
|-FieldDecl 0x2658278 <line:187:13, col:47> col:17 Roll_Servoloop_RLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x2658240 <col:47> 'int' 1
|-FieldDecl 0x2658300 <line:189:13, col:47> col:17 Pitch_Servoloop_CurrSatLL 'U32':'unsigned long'
| `-IntegerLiteral 0x26582c8 <col:47> 'int' 1
|-FieldDecl 0x2658388 <line:190:13, col:47> col:17 Pitch_Servoloop_CurrSatUL 'U32':'unsigned long'
| `-IntegerLiteral 0x2658350 <col:47> 'int' 1
|-FieldDecl 0x2658410 <line:191:13, col:47> col:17 Pitch_Servoloop_PLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x26583d8 <col:47> 'int' 1
|-FieldDecl 0x2658498 <line:192:13, col:47> col:17 Pitch_Servoloop_PLInv 'U32':'unsigned long'
| `-IntegerLiteral 0x2658460 <col:47> 'int' 1
|-FieldDecl 0x2658520 <line:193:13, col:47> col:17 Pitch_Servoloop_RLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x26584e8 <col:47> 'int' 1
|-FieldDecl 0x26585a8 <line:195:13, col:47> col:17 CPD_Input 'U32':'unsigned long'
| `-IntegerLiteral 0x2658570 <col:47> 'int' 1
|-FieldDecl 0x2658640 <line:196:13, col:47> col:17 Video_Sync_Light_Output 'U32':'unsigned long'
| `-IntegerLiteral 0x26585f8 <col:47> 'int' 1
`-FieldDecl 0x26586c8 <line:198:13, col:47> col:17 Combined_Fail_Status 'U32':'unsigned long'
  `-IntegerLiteral 0x2658690 <col:47> 'int' 1

Layout: <CGRecordLayout
  LLVMType:%struct.anon = type { i32 }
  IsZeroInitializable:1
  BitFields:[
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:8 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:9 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:10 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:11 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:12 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:13 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:14 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:15 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:16 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:17 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:18 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:19 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:20 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:21 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:22 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:23 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:24 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2657800 <..\..\..\MCP\Header\Telemetry_Log.h:165:5, line:200:5> line:165:5 union definition
|-FieldDecl 0x26578c0 <line:166:9, col:13> col:13 flags 'U32':'unsigned long'
|-RecordDecl 0x2657910 <line:167:9, line:199:9> line:167:9 struct definition
| |-FieldDecl 0x26579f8 <line:168:13, col:47> col:17 UAR_Mode 'U32':'unsigned long'
| | `-IntegerLiteral 0x26579c0 <col:47> 'int' 1
| |-FieldDecl 0x2657a80 <line:169:13, col:47> col:17 Pilot_Override 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657a48 <col:47> 'int' 1
| |-FieldDecl 0x2657b08 <line:170:13, col:47> col:17 Autopilot_Engaged 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657ad0 <col:47> 'int' 1
| |-FieldDecl 0x2657b90 <line:171:13, col:47> col:17 Autopilot_Ready 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657b58 <col:47> 'int' 1
| |-FieldDecl 0x2657c18 <line:173:13, col:47> col:17 Roll_Rate_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657be0 <col:47> 'int' 1
| |-FieldDecl 0x2657ca0 <line:174:13, col:47> col:17 Roll_ADP_Cmd_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657c68 <col:47> 'int' 1
| |-FieldDecl 0x2657d28 <line:175:13, col:47> col:17 Roll_ACT_POS_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657cf0 <col:47> 'int' 1
| |-FieldDecl 0x2657db0 <line:176:13, col:47> col:17 Roll_ATT_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657d78 <col:47> 'int' 1
| |-FieldDecl 0x2657e38 <line:178:13, col:47> col:17 Pitch_Rate_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657e00 <col:47> 'int' 1
| |-FieldDecl 0x2657ec0 <line:179:13, col:47> col:17 Pitch_ADP_Cmd_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657e88 <col:47> 'int' 1
| |-FieldDecl 0x2657f48 <line:180:13, col:47> col:17 Pitch_ACT_Pos_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657f10 <col:47> 'int' 1
| |-FieldDecl 0x2657fd0 <line:181:13, col:47> col:17 Pitch_ATT_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2657f98 <col:47> 'int' 1
| |-FieldDecl 0x2658058 <line:183:13, col:47> col:17 Roll_Servoloop_CurrSatLL 'U32':'unsigned long'
| | `-IntegerLiteral 0x2658020 <col:47> 'int' 1
| |-FieldDecl 0x26580e0 <line:184:13, col:47> col:17 Roll_Servoloop_CurrSatUL 'U32':'unsigned long'
| | `-IntegerLiteral 0x26580a8 <col:47> 'int' 1
| |-FieldDecl 0x2658168 <line:185:13, col:47> col:17 Roll_Servoloop_PLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2658130 <col:47> 'int' 1
| |-FieldDecl 0x26581f0 <line:186:13, col:47> col:17 Roll_Servoloop_PLInv 'U32':'unsigned long'
| | `-IntegerLiteral 0x26581b8 <col:47> 'int' 1
| |-FieldDecl 0x2658278 <line:187:13, col:47> col:17 Roll_Servoloop_RLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2658240 <col:47> 'int' 1
| |-FieldDecl 0x2658300 <line:189:13, col:47> col:17 Pitch_Servoloop_CurrSatLL 'U32':'unsigned long'
| | `-IntegerLiteral 0x26582c8 <col:47> 'int' 1
| |-FieldDecl 0x2658388 <line:190:13, col:47> col:17 Pitch_Servoloop_CurrSatUL 'U32':'unsigned long'
| | `-IntegerLiteral 0x2658350 <col:47> 'int' 1
| |-FieldDecl 0x2658410 <line:191:13, col:47> col:17 Pitch_Servoloop_PLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x26583d8 <col:47> 'int' 1
| |-FieldDecl 0x2658498 <line:192:13, col:47> col:17 Pitch_Servoloop_PLInv 'U32':'unsigned long'
| | `-IntegerLiteral 0x2658460 <col:47> 'int' 1
| |-FieldDecl 0x2658520 <line:193:13, col:47> col:17 Pitch_Servoloop_RLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x26584e8 <col:47> 'int' 1
| |-FieldDecl 0x26585a8 <line:195:13, col:47> col:17 CPD_Input 'U32':'unsigned long'
| | `-IntegerLiteral 0x2658570 <col:47> 'int' 1
| |-FieldDecl 0x2658640 <line:196:13, col:47> col:17 Video_Sync_Light_Output 'U32':'unsigned long'
| | `-IntegerLiteral 0x26585f8 <col:47> 'int' 1
| `-FieldDecl 0x26586c8 <line:198:13, col:47> col:17 Combined_Fail_Status 'U32':'unsigned long'
|   `-IntegerLiteral 0x2658690 <col:47> 'int' 1
`-FieldDecl 0x2658778 <line:167:9, line:199:11> col:11 flags1 'struct (anonymous struct at ..\..\..\MCP\Header\Telemetry_Log.h:167:9)':'struct TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:167:9)'

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26560d0 <..\..\..\MCP\Header\Telemetry_Log.h:132:9, line:203:1> line:132:9 struct definition
|-FullComment 0x2c66938 <line:126:4, line:131:77>
| |-ParagraphComment 0x2c66718 <line:126:4, line:127:4>
| | |-TextComment 0x2c666c8 <line:126:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c666e8 <line:127:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c66738 <col:5, col:34> Text=" TELEMETRY_LOG_STRUCT"
| |-ParagraphComment 0x2c667a0 <line:128:1, col:4>
| | `-TextComment 0x2c66778 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c667c0 <col:5, line:131:77> Name="brief"
|   `-ParagraphComment 0x2c668f8 <line:128:11, line:131:77>
|     |-TextComment 0x2c667e8 <line:128:11, col:76> Text=" Stores flight data to be transmitted via CAN to a remote computer"
|     |-TextComment 0x2c66808 <line:129:1, col:27> Text="    or data recording unit."
|     |-TextComment 0x2c66828 <line:130:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c66868 <col:5, col:12> Name="MCPReqt" RenderNormal
|     |-TextComment 0x2c66888 <col:13, col:31> Text="{HAP1-SDD-MCP,4184}"
|     `-TextComment 0x2c668a8 <line:131:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2656190 <line:134:5, col:29> col:29 framenumber 'U32':'unsigned long'
|-FieldDecl 0x26561f0 <line:137:5, col:29> col:29 eulers 'EULER_ANGLES':'EULER_ANGLES'
|-FieldDecl 0x2656250 <line:138:5, col:29> col:29 mags 'VECTOR3':'VECTOR3'
|-FieldDecl 0x26562b0 <line:139:5, col:29> col:29 rates 'VECTOR3':'VECTOR3'
|-FieldDecl 0x2656310 <line:140:5, col:29> col:29 accels 'VECTOR3':'VECTOR3'
|-FieldDecl 0x2656370 <line:141:5, col:29> col:29 euler_rates 'EULER_RATES':'EULER_RATES'
|-FieldDecl 0x26563d0 <line:144:5, col:29> col:29 actuator_positions 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2656430 <line:145:5, col:29> col:29 actuator_commands 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2656490 <line:146:5, col:29> col:29 motor_A_current 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x26564f0 <line:147:5, col:29> col:29 motor_B_current 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2656550 <line:148:5, col:29> col:29 actuator_mvc 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x26565b0 <line:157:5, col:29> col:29 IAS 'F32':'float'
|-FieldDecl 0x2657630 <line:158:5, col:29> col:29 TAS 'F32':'float'
|-FieldDecl 0x2657690 <line:159:5, col:29> col:29 baro_altitude 'F32':'float'
|-FieldDecl 0x26576f0 <line:160:5, col:29> col:29 oat 'F32':'float'
|-FieldDecl 0x2657750 <line:163:5, col:29> col:29 latest_fault 'U32':'unsigned long'
|-FieldDecl 0x26577b0 <line:164:5, col:29> col:29 button_states 'U8':'unsigned char'
|-RecordDecl 0x2657800 <line:165:5, line:200:5> line:165:5 union definition
| |-FieldDecl 0x26578c0 <line:166:9, col:13> col:13 flags 'U32':'unsigned long'
| |-RecordDecl 0x2657910 <line:167:9, line:199:9> line:167:9 struct definition
| | |-FieldDecl 0x26579f8 <line:168:13, col:47> col:17 UAR_Mode 'U32':'unsigned long'
| | | `-IntegerLiteral 0x26579c0 <col:47> 'int' 1
| | |-FieldDecl 0x2657a80 <line:169:13, col:47> col:17 Pilot_Override 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657a48 <col:47> 'int' 1
| | |-FieldDecl 0x2657b08 <line:170:13, col:47> col:17 Autopilot_Engaged 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657ad0 <col:47> 'int' 1
| | |-FieldDecl 0x2657b90 <line:171:13, col:47> col:17 Autopilot_Ready 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657b58 <col:47> 'int' 1
| | |-FieldDecl 0x2657c18 <line:173:13, col:47> col:17 Roll_Rate_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657be0 <col:47> 'int' 1
| | |-FieldDecl 0x2657ca0 <line:174:13, col:47> col:17 Roll_ADP_Cmd_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657c68 <col:47> 'int' 1
| | |-FieldDecl 0x2657d28 <line:175:13, col:47> col:17 Roll_ACT_POS_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657cf0 <col:47> 'int' 1
| | |-FieldDecl 0x2657db0 <line:176:13, col:47> col:17 Roll_ATT_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657d78 <col:47> 'int' 1
| | |-FieldDecl 0x2657e38 <line:178:13, col:47> col:17 Pitch_Rate_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657e00 <col:47> 'int' 1
| | |-FieldDecl 0x2657ec0 <line:179:13, col:47> col:17 Pitch_ADP_Cmd_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657e88 <col:47> 'int' 1
| | |-FieldDecl 0x2657f48 <line:180:13, col:47> col:17 Pitch_ACT_Pos_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657f10 <col:47> 'int' 1
| | |-FieldDecl 0x2657fd0 <line:181:13, col:47> col:17 Pitch_ATT_Fail 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2657f98 <col:47> 'int' 1
| | |-FieldDecl 0x2658058 <line:183:13, col:47> col:17 Roll_Servoloop_CurrSatLL 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2658020 <col:47> 'int' 1
| | |-FieldDecl 0x26580e0 <line:184:13, col:47> col:17 Roll_Servoloop_CurrSatUL 'U32':'unsigned long'
| | | `-IntegerLiteral 0x26580a8 <col:47> 'int' 1
| | |-FieldDecl 0x2658168 <line:185:13, col:47> col:17 Roll_Servoloop_PLSat 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2658130 <col:47> 'int' 1
| | |-FieldDecl 0x26581f0 <line:186:13, col:47> col:17 Roll_Servoloop_PLInv 'U32':'unsigned long'
| | | `-IntegerLiteral 0x26581b8 <col:47> 'int' 1
| | |-FieldDecl 0x2658278 <line:187:13, col:47> col:17 Roll_Servoloop_RLSat 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2658240 <col:47> 'int' 1
| | |-FieldDecl 0x2658300 <line:189:13, col:47> col:17 Pitch_Servoloop_CurrSatLL 'U32':'unsigned long'
| | | `-IntegerLiteral 0x26582c8 <col:47> 'int' 1
| | |-FieldDecl 0x2658388 <line:190:13, col:47> col:17 Pitch_Servoloop_CurrSatUL 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2658350 <col:47> 'int' 1
| | |-FieldDecl 0x2658410 <line:191:13, col:47> col:17 Pitch_Servoloop_PLSat 'U32':'unsigned long'
| | | `-IntegerLiteral 0x26583d8 <col:47> 'int' 1
| | |-FieldDecl 0x2658498 <line:192:13, col:47> col:17 Pitch_Servoloop_PLInv 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2658460 <col:47> 'int' 1
| | |-FieldDecl 0x2658520 <line:193:13, col:47> col:17 Pitch_Servoloop_RLSat 'U32':'unsigned long'
| | | `-IntegerLiteral 0x26584e8 <col:47> 'int' 1
| | |-FieldDecl 0x26585a8 <line:195:13, col:47> col:17 CPD_Input 'U32':'unsigned long'
| | | `-IntegerLiteral 0x2658570 <col:47> 'int' 1
| | |-FieldDecl 0x2658640 <line:196:13, col:47> col:17 Video_Sync_Light_Output 'U32':'unsigned long'
| | | `-IntegerLiteral 0x26585f8 <col:47> 'int' 1
| | `-FieldDecl 0x26586c8 <line:198:13, col:47> col:17 Combined_Fail_Status 'U32':'unsigned long'
| |   `-IntegerLiteral 0x2658690 <col:47> 'int' 1
| `-FieldDecl 0x2658778 <line:167:9, line:199:11> col:11 flags1 'struct (anonymous struct at ..\..\..\MCP\Header\Telemetry_Log.h:167:9)':'struct TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:167:9)'
|-FieldDecl 0x2658828 <line:165:5, line:200:7> col:7 u 'union (anonymous union at ..\..\..\MCP\Header\Telemetry_Log.h:165:5)':'union TELEMETRY_LOG_STRUCT::(anonymous at ..\..\..\MCP\Header\Telemetry_Log.h:165:5)'
`-FieldDecl 0x2658888 <line:201:5, col:9> col:9 flags2 'U32':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%struct.TELEMETRY_LOG_STRUCT = type { i32, %struct.EULER_ANGLES, %struct.VECTOR3, %struct.VECTOR3, %struct.VECTOR3, %struct.EULER_RATES, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, float, float, float, float, i32, i8, %union.anon, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | INNER_LOOP_MONITORS_COEFF_STRUCT
         0 |   MONITOR_COEFF_STRUCT roll_coeff
         0 |     F32 rate_l_limit
         4 |     F32 rate_u_limit
         8 |     F32 attitude_l_limit
        12 |     F32 attitude_u_limit
        16 |     MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
        16 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        16 |         U32 P
        20 |         BOOLEAN ic
        21 |         BOOLEAN rising_edge
        22 |         BOOLEAN falling_edge
        24 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        24 |         U32 sample_interval
        28 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        28 |         F32 a1
        32 |         F32 b0
        36 |         F32 b1
        40 |         F32 k1
        44 |         F32 k2
        48 |       F32 wof_l_limit
        52 |       F32 wof_u_limit
        56 |     MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
        56 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        56 |         U32 P
        60 |         BOOLEAN ic
        61 |         BOOLEAN rising_edge
        62 |         BOOLEAN falling_edge
        64 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        64 |         U32 sample_interval
        68 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        68 |         F32 a1
        72 |         F32 b0
        76 |         F32 b1
        80 |         F32 k1
        84 |         F32 k2
        88 |       F32 wof_l_limit
        92 |       F32 wof_u_limit
        96 |   MONITOR_COEFF_STRUCT pitch_coeff
        96 |     F32 rate_l_limit
       100 |     F32 rate_u_limit
       104 |     F32 attitude_l_limit
       108 |     F32 attitude_u_limit
       112 |     MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
       112 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       112 |         U32 P
       116 |         BOOLEAN ic
       117 |         BOOLEAN rising_edge
       118 |         BOOLEAN falling_edge
       120 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       120 |         U32 sample_interval
       124 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       124 |         F32 a1
       128 |         F32 b0
       132 |         F32 b1
       136 |         F32 k1
       140 |         F32 k2
       144 |       F32 wof_l_limit
       148 |       F32 wof_u_limit
       152 |     MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
       152 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       152 |         U32 P
       156 |         BOOLEAN ic
       157 |         BOOLEAN rising_edge
       158 |         BOOLEAN falling_edge
       160 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       160 |         U32 sample_interval
       164 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       164 |         F32 a1
       168 |         F32 b0
       172 |         F32 b1
       176 |         F32 k1
       180 |         F32 k2
       184 |       F32 wof_l_limit
       188 |       F32 wof_u_limit
       192 |   F32 lf_l_limit
       196 |   PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
       196 |     U32 P
       200 |     BOOLEAN ic
       201 |     BOOLEAN rising_edge
       202 |     BOOLEAN falling_edge
           | [sizeof=204, align=4]

*** Dumping AST Record Layout
         0 | SCHEDULEDRATELIMITER_COEFF_STRUCT
         0 |   LINTERP_STRUCT upper_linterp
         0 |     U8 n_regions
         4 |     LINTERP_REGION_STRUCT [10] regions
       124 |   LINTERP_STRUCT lower_linterp
       124 |     U8 n_regions
       128 |     LINTERP_REGION_STRUCT [10] regions
           | [sizeof=248, align=4]

*** Dumping AST Record Layout
         0 | MCP_COEFF_STRUCT
         0 |   MCP_CONTROL_PRODUCER_COEFF_STRUCT control_coeff
         0 |     CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
         0 |       F32 pitch_bias
         4 |       F32 roll_rate_limiter_upper_limit
         8 |       F32 roll_rate_limiter_lower_limit
        12 |       F32 pitch_rate_limiter_upper_limit
        16 |       F32 pitch_rate_limiter_lower_limit
        20 |       ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |         F32 c_reintichs_IC
        24 |         F32 c_gamma
        28 |         F32 null_attitude
        32 |         F32 upper_sat_limit
        36 |         F32 lower_sat_limit
        40 |         F32 k_rate_to_ang_accel_cross
        44 |         F32 k_rate_to_ang_accel_uar
        48 |         F32 k_rate_to_ang_accel_normal
        52 |         F32 k_attitude_to_ang_accel_uar
        56 |         F32 k_attitude_to_ang_accel_normal
        60 |         F32 k_attitude_to_ang_accel_integral_normal
        64 |         F32 k_compensation
        68 |         F32 k_ang_accel_to_cyclic
        72 |         F32 k_integrator_curve_magnitude
        76 |         SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        76 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
        76 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        76 |               U32 P
        80 |               BOOLEAN ic
        81 |               BOOLEAN rising_edge
        82 |               BOOLEAN falling_edge
        84 |           REINTICH_COEFF_STRUCT first_integrator_coeff
        84 |             F32 K_Ts
        88 |           REINTICH_COEFF_STRUCT second_integrator_coeff
        88 |             F32 K_Ts
        92 |         SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        92 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
        92 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        92 |               U32 P
        96 |               BOOLEAN ic
        97 |               BOOLEAN rising_edge
        98 |               BOOLEAN falling_edge
       100 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       100 |             F32 K_Ts
       104 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       104 |             F32 K_Ts
       108 |         REINTICH_COEFF_STRUCT reintich
       108 |           F32 K_Ts
       112 |         REINTICHS_COEFF_STRUCT reintichs
       112 |           F32 K_Ts
       116 |           F32 Gain
       120 |           F32 UL
       124 |           F32 LL
       128 |           F32 rail_bounce_divisor
       132 |           REINTICH_COEFF_STRUCT integrator_coeff
       132 |             F32 K_Ts
       136 |           SATURATIONVF_COEFF_STRUCT sat_coeff
       136 |             F32 epsilon
       140 |             F32 upper_sat_limit
       144 |             F32 lower_sat_limit
       148 |         SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       148 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       148 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       148 |               U32 P
       152 |               BOOLEAN ic
       153 |               BOOLEAN rising_edge
       154 |               BOOLEAN falling_edge
       156 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       156 |             F32 K_Ts
       160 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       160 |             F32 K_Ts
       164 |       ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       164 |         F32 c_reintichs_IC
       168 |         F32 c_gamma
       172 |         F32 null_attitude
       176 |         F32 upper_sat_limit
       180 |         F32 lower_sat_limit
       184 |         F32 k_rate_to_ang_accel_cross
       188 |         F32 k_rate_to_ang_accel_uar
       192 |         F32 k_rate_to_ang_accel_normal
       196 |         F32 k_attitude_to_ang_accel_uar
       200 |         F32 k_attitude_to_ang_accel_normal
       204 |         F32 k_attitude_to_ang_accel_integral_normal
       208 |         F32 k_compensation
       212 |         F32 k_ang_accel_to_cyclic
       216 |         F32 k_integrator_curve_magnitude
       220 |         SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
       220 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       220 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       220 |               U32 P
       224 |               BOOLEAN ic
       225 |               BOOLEAN rising_edge
       226 |               BOOLEAN falling_edge
       228 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       228 |             F32 K_Ts
       232 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       232 |             F32 K_Ts
       236 |         SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
       236 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       236 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       236 |               U32 P
       240 |               BOOLEAN ic
       241 |               BOOLEAN rising_edge
       242 |               BOOLEAN falling_edge
       244 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       244 |             F32 K_Ts
       248 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       248 |             F32 K_Ts
       252 |         REINTICH_COEFF_STRUCT reintich
       252 |           F32 K_Ts
       256 |         REINTICHS_COEFF_STRUCT reintichs
       256 |           F32 K_Ts
       260 |           F32 Gain
       264 |           F32 UL
       268 |           F32 LL
       272 |           F32 rail_bounce_divisor
       276 |           REINTICH_COEFF_STRUCT integrator_coeff
       276 |             F32 K_Ts
       280 |           SATURATIONVF_COEFF_STRUCT sat_coeff
       280 |             F32 epsilon
       284 |             F32 upper_sat_limit
       288 |             F32 lower_sat_limit
       292 |         SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       292 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       292 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       292 |               U32 P
       296 |               BOOLEAN ic
       297 |               BOOLEAN rising_edge
       298 |               BOOLEAN falling_edge
       300 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       300 |             F32 K_Ts
       304 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       304 |             F32 K_Ts
       308 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_roll_cmd_switch
       308 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       308 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       308 |             U32 P
       312 |             BOOLEAN ic
       313 |             BOOLEAN rising_edge
       314 |             BOOLEAN falling_edge
       316 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       316 |           F32 K_Ts
       320 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       320 |           F32 K_Ts
       324 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_pitch_cmd_switch
       324 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       324 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       324 |             U32 P
       328 |             BOOLEAN ic
       329 |             BOOLEAN rising_edge
       330 |             BOOLEAN falling_edge
       332 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       332 |           F32 K_Ts
       336 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       336 |           F32 K_Ts
       340 |       TEST_PORT_COEFF_STRUCT roll_testport
       340 |         F32 gain
       344 |         F32 bias
       348 |       TEST_PORT_COEFF_STRUCT pitch_testport
       348 |         F32 gain
       352 |         F32 bias
       356 |       F32 K_heading_rate_to_ang_accel_uar
       360 |       SWITCH_SECOND_ORDER_COEFF_STRUCT heading_rate_switch
       360 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       360 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       360 |             U32 P
       364 |             BOOLEAN ic
       365 |             BOOLEAN rising_edge
       366 |             BOOLEAN falling_edge
       368 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       368 |           F32 K_Ts
       372 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       372 |           F32 K_Ts
       376 |       LINTERP_STRUCT pitch_bias_linterp
       376 |         U8 n_regions
       380 |         LINTERP_REGION_STRUCT [10] regions
       500 |       F32 tune_mode
       504 |     UARMODELOGIC_COEFF_STRUCT uar_mode_logic
       504 |       F32 phi_upper_limit
       508 |       F32 phi_lower_limit
       512 |       F32 theta_upper_limit
       516 |       F32 theta_lower_limit
       520 |       F32 p_filt_upper_limit
       524 |       F32 p_filt_lower_limit
       528 |       F32 q_filt_upper_limit
       532 |       F32 q_filt_lower_limit
       536 |       PERSISTENT1SHOT_COEFF_STRUCT run_p1shot
       536 |         U32 P
       540 |         BOOLEAN ic
       541 |         BOOLEAN rising_edge
       542 |         BOOLEAN falling_edge
       544 |       PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
       544 |         U32 P
       548 |         BOOLEAN ic
       549 |         BOOLEAN rising_edge
       550 |         BOOLEAN falling_edge
       552 |   INNER_LOOP_MONITORS_COEFF_STRUCT monitors_coeff
       552 |     MONITOR_COEFF_STRUCT roll_coeff
       552 |       F32 rate_l_limit
       556 |       F32 rate_u_limit
       560 |       F32 attitude_l_limit
       564 |       F32 attitude_u_limit
       568 |       MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
       568 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       568 |           U32 P
       572 |           BOOLEAN ic
       573 |           BOOLEAN rising_edge
       574 |           BOOLEAN falling_edge
       576 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       576 |           U32 sample_interval
       580 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       580 |           F32 a1
       584 |           F32 b0
       588 |           F32 b1
       592 |           F32 k1
       596 |           F32 k2
       600 |         F32 wof_l_limit
       604 |         F32 wof_u_limit
       608 |       MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
       608 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       608 |           U32 P
       612 |           BOOLEAN ic
       613 |           BOOLEAN rising_edge
       614 |           BOOLEAN falling_edge
       616 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       616 |           U32 sample_interval
       620 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       620 |           F32 a1
       624 |           F32 b0
       628 |           F32 b1
       632 |           F32 k1
       636 |           F32 k2
       640 |         F32 wof_l_limit
       644 |         F32 wof_u_limit
       648 |     MONITOR_COEFF_STRUCT pitch_coeff
       648 |       F32 rate_l_limit
       652 |       F32 rate_u_limit
       656 |       F32 attitude_l_limit
       660 |       F32 attitude_u_limit
       664 |       MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
       664 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       664 |           U32 P
       668 |           BOOLEAN ic
       669 |           BOOLEAN rising_edge
       670 |           BOOLEAN falling_edge
       672 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       672 |           U32 sample_interval
       676 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       676 |           F32 a1
       680 |           F32 b0
       684 |           F32 b1
       688 |           F32 k1
       692 |           F32 k2
       696 |         F32 wof_l_limit
       700 |         F32 wof_u_limit
       704 |       MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
       704 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       704 |           U32 P
       708 |           BOOLEAN ic
       709 |           BOOLEAN rising_edge
       710 |           BOOLEAN falling_edge
       712 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       712 |           U32 sample_interval
       716 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       716 |           F32 a1
       720 |           F32 b0
       724 |           F32 b1
       728 |           F32 k1
       732 |           F32 k2
       736 |         F32 wof_l_limit
       740 |         F32 wof_u_limit
       744 |     F32 lf_l_limit
       748 |     PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
       748 |       U32 P
       752 |       BOOLEAN ic
       753 |       BOOLEAN rising_edge
       754 |       BOOLEAN falling_edge
       756 |   SCHEDULEDRATELIMITER_COEFF_STRUCT roll_scheduledRL_coeff
       756 |     LINTERP_STRUCT upper_linterp
       756 |       U8 n_regions
       760 |       LINTERP_REGION_STRUCT [10] regions
       880 |     LINTERP_STRUCT lower_linterp
       880 |       U8 n_regions
       884 |       LINTERP_REGION_STRUCT [10] regions
      1004 |   SCHEDULEDRATELIMITER_COEFF_STRUCT pitch_scheduledRL_coeff
      1004 |     LINTERP_STRUCT upper_linterp
      1004 |       U8 n_regions
      1008 |       LINTERP_REGION_STRUCT [10] regions
      1128 |     LINTERP_STRUCT lower_linterp
      1128 |       U8 n_regions
      1132 |       LINTERP_REGION_STRUCT [10] regions
      1252 |   TEST_PORT_COEFF_STRUCT roll_servo_testport
      1252 |     F32 gain
      1256 |     F32 bias
      1260 |   TEST_PORT_COEFF_STRUCT pitch_servo_testport
      1260 |     F32 gain
      1264 |     F32 bias
      1268 |   TEST_PORT_COEFF_STRUCT roll_cyclic_testport_coeff
      1268 |     F32 gain
      1272 |     F32 bias
      1276 |   TEST_PORT_COEFF_STRUCT pitch_cyclic_testport_coeff
      1276 |     F32 gain
      1280 |     F32 bias
      1284 |   F32 sin_wave_frequency
      1288 |   F32 sin_wave_amplitude
           | [sizeof=1292, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a91798 <..\..\..\Model\Common\Header\Persistent1Shot.h:53:9, line:60:1> line:53:9 struct definition
|-FullComment 0x2c66d88 <line:48:4, line:52:77>
| |-ParagraphComment 0x2c66b88 <line:48:4, line:49:4>
| | |-TextComment 0x2c66b38 <line:48:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c66b58 <line:49:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c66ba8 <col:5, col:42> Text=" PERSISTENT1SHOT_COEFF_STRUCT"
| |-ParagraphComment 0x2c66c10 <line:50:1, col:4>
| | `-TextComment 0x2c66be8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c66c30 <col:5, line:52:77> Name="brief"
|   `-ParagraphComment 0x2c66d48 <line:50:11, line:52:77>
|     |-TextComment 0x2c66c58 <line:50:11, col:56> Text=" Coefficients struct for Persistent1Shot block"
|     |-TextComment 0x2c66c78 <line:51:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c66cc0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c66ce0 <col:21, col:37> Text="{HAP1-SDD-MC,436}"
|     `-TextComment 0x2c66d00 <line:52:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2a91850 <line:55:5, col:9> col:9 P 'U32':'unsigned long'
|-FieldDecl 0x2a918b0 <line:56:5, col:13> col:13 ic 'BOOLEAN':'unsigned char'
|-FieldDecl 0x2a91910 <line:57:5, col:13> col:13 rising_edge 'BOOLEAN':'unsigned char'
`-FieldDecl 0x2a91970 <line:58:5, col:13> col:13 falling_edge 'BOOLEAN':'unsigned char'

Layout: <CGRecordLayout
  LLVMType:%struct.PERSISTENT1SHOT_COEFF_STRUCT = type { i32, i8, i8, i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2659380 <..\..\..\Model\Common\Header/Switch_Common.h:59:9, line:64:1> line:59:9 struct definition
|-FullComment 0x2c67010 <line:54:4, line:58:76>
| |-ParagraphComment 0x2c66e38 <line:54:4, line:55:4>
| | |-TextComment 0x2c66de8 <line:54:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c66e08 <line:55:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c66e58 <col:5, col:40> Text=" SWITCH_COMMON_COEFF_STRUCT"
| |-ParagraphComment 0x2c66ec0 <line:56:1, col:4>
| | `-TextComment 0x2c66e98 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c66ee0 <col:5, line:58:76> Name="brief"
|   `-ParagraphComment 0x2c66fd0 <line:56:11, line:58:76>
|     |-TextComment 0x2c66f08 <line:56:11, col:62> Text=" Common coefficient structure for the switch blocks."
|     |-TextComment 0x2c66f28 <line:57:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c66f48 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c66f68 <col:21, col:37> Text="{HAP1-SDD-MC,863}"
|     `-TextComment 0x2c66f88 <line:58:1, col:76> Text="   ======================================================================== "
`-FieldDecl 0x2659440 <line:62:5, col:34> col:34 transition_one_shot_coeff 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.SWITCH_COMMON_COEFF_STRUCT = type { %struct.PERSISTENT1SHOT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x265c7b0 <..\..\..\Model\Common\Header\ReIntICH.h:53:9, line:57:1> line:53:9 struct definition
|-FullComment 0x2c672b8 <line:48:4, line:52:76>
| |-ParagraphComment 0x2c670e0 <line:48:4, line:49:4>
| | |-TextComment 0x2c67070 <line:48:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c67090 <line:49:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c67100 <col:5, col:35> Text=" REINTICH_COEFF_STRUCT"
| |-ParagraphComment 0x2c67168 <line:50:1, col:4>
| | `-TextComment 0x2c67140 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c67188 <col:5, line:52:76> Name="brief"
|   `-ParagraphComment 0x2c67278 <line:50:11, line:52:76>
|     |-TextComment 0x2c671b0 <line:50:11, col:43> Text=" Coefficients struct for ReIntICH"
|     |-TextComment 0x2c671d0 <line:51:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c671f0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c67210 <col:21, col:37> Text="{HAP1-SDD-MC,529}"
|     `-TextComment 0x2c67230 <line:52:1, col:76> Text="   ======================================================================== "
`-FieldDecl 0x265c870 <line:55:5, col:9> col:9 K_Ts 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.REINTICH_COEFF_STRUCT = type { float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x265f3a8 <..\..\..\Model\Common\Header\Switch_2nd_Order.h:55:9, line:61:1> line:55:9 struct definition
|-FullComment 0x2c67540 <line:50:4, line:54:76>
| |-ParagraphComment 0x2c67368 <line:50:4, line:51:4>
| | |-TextComment 0x2c67318 <line:50:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c67338 <line:51:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c67388 <col:5, col:46> Text=" SWITCH_SECOND_ORDER_COEFF_STRUCT"
| |-ParagraphComment 0x2c673f0 <line:52:1, col:4>
| | `-TextComment 0x2c673c8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c67410 <col:5, line:54:76> Name="brief"
|   `-ParagraphComment 0x2c67500 <line:52:11, line:54:76>
|     |-TextComment 0x2c67438 <line:52:11, col:58> Text=" Coefficients struct for the second-order switch"
|     |-TextComment 0x2c67458 <line:53:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c67478 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c67498 <col:21, col:37> Text="{HAP1-SDD-MC,679}"
|     `-TextComment 0x2c674b8 <line:54:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x265f460 <line:57:5, col:32> col:32 common_coeff 'SWITCH_COMMON_COEFF_STRUCT':'SWITCH_COMMON_COEFF_STRUCT'
|-FieldDecl 0x265f4c0 <line:58:5, col:27> col:27 first_integrator_coeff 'REINTICH_COEFF_STRUCT':'REINTICH_COEFF_STRUCT'
`-FieldDecl 0x265f520 <line:59:5, col:27> col:27 second_integrator_coeff 'REINTICH_COEFF_STRUCT':'REINTICH_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.SWITCH_SECOND_ORDER_COEFF_STRUCT = type { %struct.SWITCH_COMMON_COEFF_STRUCT, %struct.REINTICH_COEFF_STRUCT, %struct.REINTICH_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2ae12c0 <..\..\..\Model\Common\Header/SaturationVF.h:53:9, line:59:1> line:53:9 struct definition
|-FullComment 0x2c677c8 <line:48:4, line:52:76>
| |-ParagraphComment 0x2c675f0 <line:48:4, line:49:4>
| | |-TextComment 0x2c675a0 <line:48:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c675c0 <line:49:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c67610 <col:5, col:39> Text=" SATURATIONVF_COEFF_STRUCT"
| |-ParagraphComment 0x2c67678 <line:50:1, col:4>
| | `-TextComment 0x2c67650 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c67698 <col:5, line:52:76> Name="brief"
|   `-ParagraphComment 0x2c67788 <line:50:11, line:52:76>
|     |-TextComment 0x2c676c0 <line:50:11, col:47> Text=" Coefficients struct for SaturationVF"
|     |-TextComment 0x2c676e0 <line:51:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c67700 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c67720 <col:21, col:37> Text="{HAP1-SDD-MC,xxx}"
|     `-TextComment 0x2c67740 <line:52:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2ae1380 <line:55:5, col:9> col:9 epsilon 'F32':'float'
|-FieldDecl 0x2ae13e0 <line:56:5, col:9> col:9 upper_sat_limit 'F32':'float'
`-FieldDecl 0x2ae1440 <line:57:5, col:9> col:9 lower_sat_limit 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.SATURATIONVF_COEFF_STRUCT = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2ae42b0 <..\..\..\Model\Common\Header\ReIntICHS.h:54:9, line:64:1> line:54:9 struct definition
|-FullComment 0x2c67a50 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c67878 <line:49:4, line:50:4>
| | |-TextComment 0x2c67828 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c67848 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c67898 <col:5, col:36> Text=" REINTICHS_COEFF_STRUCT"
| |-ParagraphComment 0x2c67900 <line:51:1, col:4>
| | `-TextComment 0x2c678d8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c67920 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c67a10 <line:51:11, line:53:76>
|     |-TextComment 0x2c67948 <line:51:11, col:44> Text=" Coefficients struct for ReIntICHS"
|     |-TextComment 0x2c67968 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c67988 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c679a8 <col:21, col:37> Text="{HAP1-SDD-MC,xxx}"
|     `-TextComment 0x2c679c8 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2ae4370 <line:56:5, col:9> col:9 K_Ts 'F32':'float'
|-FieldDecl 0x2ae43d0 <line:57:5, col:9> col:9 Gain 'F32':'float'
|-FieldDecl 0x2ae4430 <line:58:5, col:9> col:9 UL 'F32':'float'
|-FieldDecl 0x2ae4490 <line:59:5, col:9> col:9 LL 'F32':'float'
|-FieldDecl 0x2ae44f0 <line:60:5, col:9> col:9 rail_bounce_divisor 'F32':'float'
|-FieldDecl 0x2ae4550 <line:61:5, col:28> col:28 integrator_coeff 'REINTICH_COEFF_STRUCT':'REINTICH_COEFF_STRUCT'
`-FieldDecl 0x2ae45b0 <line:62:5, col:31> col:31 sat_coeff 'SATURATIONVF_COEFF_STRUCT':'SATURATIONVF_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.REINTICHS_COEFF_STRUCT = type { float, float, float, float, float, %struct.REINTICH_COEFF_STRUCT, %struct.SATURATIONVF_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2ae68e8 <..\..\..\Model\Inner_Loop\Header/Attitude_Controller.h:76:9, line:101:1> line:76:9 struct definition
|-FullComment 0x2c67d00 <line:71:4, line:75:76>
| |-ParagraphComment 0x2c67b00 <line:71:4, line:72:4>
| | |-TextComment 0x2c67ab0 <line:71:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c67ad0 <line:72:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c67b20 <col:5, col:46> Text=" ATTITUDE_CONTROLLER_COEFF_STRUCT"
| |-ParagraphComment 0x2c67b88 <line:73:1, col:4>
| | `-TextComment 0x2c67b60 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c67ba8 <col:5, line:75:76> Name="brief"
|   `-ParagraphComment 0x2c67cc0 <line:73:11, line:75:76>
|     |-TextComment 0x2c67bd0 <line:73:11, col:73> Text=" Coefficient structure for a generic Attitude_Controller block."
|     |-TextComment 0x2c67bf0 <line:74:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c67c38 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c67c58 <col:19, col:35> Text="{HAP1-SDD-IL,504}"
|     `-TextComment 0x2c67c78 <line:75:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2ae69a0 <line:78:5, col:9> col:9 c_reintichs_IC 'F32':'float'
|-FieldDecl 0x2ae6a00 <line:79:5, col:9> col:9 c_gamma 'F32':'float'
|-FieldDecl 0x2ae6a60 <line:80:5, col:9> col:9 null_attitude 'F32':'float'
|-FieldDecl 0x2ae6ac0 <line:81:5, col:9> col:9 upper_sat_limit 'F32':'float'
|-FieldDecl 0x2ae6b20 <line:82:5, col:9> col:9 lower_sat_limit 'F32':'float'
|-FieldDecl 0x2ae6b80 <line:83:5, col:9> col:9 k_rate_to_ang_accel_cross 'F32':'float'
|-FieldDecl 0x2ae6be0 <line:84:5, col:9> col:9 k_rate_to_ang_accel_uar 'F32':'float'
|-FieldDecl 0x2ae6c40 <line:85:5, col:9> col:9 k_rate_to_ang_accel_normal 'F32':'float'
|-FieldDecl 0x2ae6ca0 <line:86:5, col:9> col:9 k_attitude_to_ang_accel_uar 'F32':'float'
|-FieldDecl 0x2ae6d00 <line:87:5, col:9> col:9 k_attitude_to_ang_accel_normal 'F32':'float'
|-FieldDecl 0x2ae6d60 <line:88:5, col:9> col:9 k_attitude_to_ang_accel_integral_normal 'F32':'float'
|-FieldDecl 0x2ae6dc0 <line:90:5, col:9> col:9 k_compensation 'F32':'float'
|-FieldDecl 0x2ae6e20 <line:91:5, col:9> col:9 k_ang_accel_to_cyclic 'F32':'float'
|-FieldDecl 0x2ae6e80 <line:93:5, col:9> col:9 k_integrator_curve_magnitude 'F32':'float'
|-FieldDecl 0x2ae6ee0 <line:95:5, col:38> col:38 rate_switch 'SWITCH_SECOND_ORDER_COEFF_STRUCT':'SWITCH_SECOND_ORDER_COEFF_STRUCT'
|-FieldDecl 0x2ae7f70 <line:96:5, col:38> col:38 attitude_switch 'SWITCH_SECOND_ORDER_COEFF_STRUCT':'SWITCH_SECOND_ORDER_COEFF_STRUCT'
|-FieldDecl 0x2ae7fd0 <line:97:5, col:28> col:28 reintich 'REINTICH_COEFF_STRUCT':'REINTICH_COEFF_STRUCT'
|-FieldDecl 0x2ae8030 <line:98:5, col:28> col:28 reintichs 'REINTICHS_COEFF_STRUCT':'REINTICHS_COEFF_STRUCT'
`-FieldDecl 0x2ae8090 <line:99:5, col:38> col:38 adp_cmd_switch_coeff 'SWITCH_SECOND_ORDER_COEFF_STRUCT':'SWITCH_SECOND_ORDER_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.ATTITUDE_CONTROLLER_COEFF_STRUCT = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, %struct.SWITCH_SECOND_ORDER_COEFF_STRUCT, %struct.SWITCH_SECOND_ORDER_COEFF_STRUCT, %struct.REINTICH_COEFF_STRUCT, %struct.REINTICHS_COEFF_STRUCT, %struct.SWITCH_SECOND_ORDER_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2aea5d8 <..\..\..\Model\Common\Header\Test_Port.h:54:9, line:59:1> line:54:9 struct definition
|-FullComment 0x2c67f88 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c67db0 <line:49:4, line:50:4>
| | |-TextComment 0x2c67d60 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c67d80 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c67dd0 <col:5, col:36> Text=" TEST_PORT_COEFF_STRUCT"
| |-ParagraphComment 0x2c67e38 <line:51:1, col:4>
| | `-TextComment 0x2c67e10 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c67e58 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c67f48 <line:51:11, line:53:76>
|     |-TextComment 0x2c67e80 <line:51:11, col:44> Text=" Coefficients struct for Test_Port"
|     |-TextComment 0x2c67ea0 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c67ec0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c67ee0 <col:21, col:37> Text="{HAP1-SDD-MC,XXX}"
|     `-TextComment 0x2c67f00 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2aea690 <line:56:5, col:9> col:9 gain 'F32':'float'
`-FieldDecl 0x2aea6f0 <line:57:5, col:9> col:9 bias 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.TEST_PORT_COEFF_STRUCT = type { float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26610f8 <..\..\..\Common\Header\Linterp.h:81:9, line:88:1> line:81:9 struct definition
|-FullComment 0x2af6268 <line:70:4, line:80:76>
| |-ParagraphComment 0x2c68038 <line:70:4, line:71:4>
| | |-TextComment 0x2c67fe8 <line:70:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c68008 <line:71:1, col:4> Text="    "
| |-BlockCommandComment 0x2c68058 <col:5, col:101> Name="brief"
| | `-ParagraphComment 0x2c680a8 <col:11, col:101>
| |   `-TextComment 0x2c68080 <col:11, col:101> Text=" This structure defines a linear equation for each region, with the formula:  y = m * x + b"
| |-ParagraphComment 0x2af60f0 <line:73:1, line:76:44>
| | |-TextComment 0x2af6050 <line:73:1, col:9> Text="    where"
| | |-TextComment 0x2af6070 <line:74:1, col:26> Text="        y = linterp result"
| | |-TextComment 0x2af6090 <line:75:1, col:27> Text="        m = slope in region"
| | `-TextComment 0x2af60b0 <line:76:1, col:44> Text="        x = distance into the current region"
| `-ParagraphComment 0x2af6228 <line:78:1, line:80:76>
|   |-TextComment 0x2af6110 <line:78:1, col:4> Text="    "
|   |-InlineCommandComment 0x2af6130 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2af6150 <col:16, col:34> Text="{HAP1-SDD-COM, 927}"
|   |-TextComment 0x2af6170 <line:79:1, col:4> Text="    "
|   |-InlineCommandComment 0x2af6190 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2af61b0 <col:16, col:34> Text="{HAP1-SDD-COM, 921}"
|   `-TextComment 0x2af61d0 <line:80:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x26611b0 <line:83:5, col:9> col:9 breakpoint 'F32':'float'
|-FieldDecl 0x2661210 <line:84:5, col:9> col:9 value 'F32':'float'
`-FieldDecl 0x2661270 <line:85:5, col:9> col:9 slope 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.LINTERP_REGION_STRUCT = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26613b0 <..\..\..\Common\Header\Linterp.h:99:9, line:104:1> line:99:9 struct definition
|-FullComment 0x2af65e8 <line:91:4, line:98:76>
| |-ParagraphComment 0x2af6318 <line:91:4, line:92:4>
| | |-TextComment 0x2af62c8 <line:91:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2af62e8 <line:92:1, col:4> Text="    "
| |-BlockCommandComment 0x2af6338 <col:5, col:97> Name="brief"
| | `-ParagraphComment 0x2af6388 <col:11, col:97>
| |   `-TextComment 0x2af6360 <col:11, col:97> Text=" This structure defines the number and set of linear equations for linear interpolation"
| `-ParagraphComment 0x2af65b0 <line:94:1, line:98:76>
|   |-TextComment 0x2af63a8 <line:94:1, col:4> Text="    "
|   |-InlineCommandComment 0x2af63c8 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2af63e8 <col:16, col:34> Text="{HAP1-SDD-COM, 917}"
|   |-TextComment 0x2af6408 <line:95:1, col:4> Text="    "
|   |-InlineCommandComment 0x2af6428 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2af6448 <col:16, col:34> Text="{HAP1-SDD-COM, 920}"
|   |-TextComment 0x2af6468 <line:96:1, col:4> Text="    "
|   |-InlineCommandComment 0x2af6488 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2af64a8 <col:16, col:34> Text="{HAP1-SDD-COM, 928}"
|   |-TextComment 0x2af64c8 <line:97:1, col:4> Text="    "
|   |-InlineCommandComment 0x2af64e8 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2af6508 <col:16, col:34> Text="{HAP1-SDD-COM, 934}"
|   `-TextComment 0x2af6528 <line:98:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2661470 <line:101:5, col:8> col:8 n_regions 'U8':'unsigned char'
`-FieldDecl 0x2661608 <line:102:5, col:52> col:27 regions 'LINTERP_REGION_STRUCT [10]'

Layout: <CGRecordLayout
  LLVMType:%struct.LINTERP_STRUCT = type { i8, [10 x %struct.LINTERP_REGION_STRUCT] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2aebbc8 <..\..\..\Model\Inner_Loop\Header/Cyclic_Feedback.h:77:9, line:103:1> line:77:9 struct definition
|-FullComment 0x2af68a0 <line:72:4, line:76:76>
| |-ParagraphComment 0x2af6698 <line:72:4, line:73:4>
| | |-TextComment 0x2af6648 <line:72:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2af6668 <line:73:1, col:4> Text="    "
| |-VerbatimLineComment 0x2af66b8 <col:5, col:42> Text=" CYCLIC_FEEDBACK_COEFF_STRUCT"
| |-ParagraphComment 0x2af6720 <line:74:1, col:4>
| | `-TextComment 0x2af66f8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2af6740 <col:5, line:76:76> Name="brief"
|   `-ParagraphComment 0x2af6860 <line:74:11, line:76:76>
|     |-TextComment 0x2af6768 <line:74:11, col:61> Text=" Coefficient structure for a Cyclic Feedback block."
|     |-TextComment 0x2af6788 <line:75:1, col:4> Text="    "
|     |-InlineCommandComment 0x2af67d8 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2af67f8 <col:24, col:40> Text="{HAP1-SDD-IL,662}"
|     `-TextComment 0x2af6818 <line:76:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2aebc80 <line:79:5, col:9> col:9 pitch_bias 'F32':'float'
|-FieldDecl 0x2aebce0 <line:81:5, col:9> col:9 roll_rate_limiter_upper_limit 'F32':'float'
|-FieldDecl 0x2aebd40 <line:82:5, col:9> col:9 roll_rate_limiter_lower_limit 'F32':'float'
|-FieldDecl 0x2aebda0 <line:84:5, col:9> col:9 pitch_rate_limiter_upper_limit 'F32':'float'
|-FieldDecl 0x2aebe00 <line:85:5, col:9> col:9 pitch_rate_limiter_lower_limit 'F32':'float'
|-FieldDecl 0x2aebe60 <line:87:5, col:38> col:38 Roll_AttitudeController 'ATTITUDE_CONTROLLER_COEFF_STRUCT':'ATTITUDE_CONTROLLER_COEFF_STRUCT'
|-FieldDecl 0x2aebec0 <line:88:5, col:38> col:38 Pitch_AttitudeController 'ATTITUDE_CONTROLLER_COEFF_STRUCT':'ATTITUDE_CONTROLLER_COEFF_STRUCT'
|-FieldDecl 0x2aebf20 <line:90:5, col:38> col:38 adp_roll_cmd_switch 'SWITCH_SECOND_ORDER_COEFF_STRUCT':'SWITCH_SECOND_ORDER_COEFF_STRUCT'
|-FieldDecl 0x2aedfd0 <line:91:5, col:38> col:38 adp_pitch_cmd_switch 'SWITCH_SECOND_ORDER_COEFF_STRUCT':'SWITCH_SECOND_ORDER_COEFF_STRUCT'
|-FieldDecl 0x2aee030 <line:93:5, col:28> col:28 roll_testport 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2aee090 <line:94:5, col:28> col:28 pitch_testport 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2aee0f0 <line:96:5, col:9> col:9 K_heading_rate_to_ang_accel_uar 'F32':'float'
|-FieldDecl 0x2aee150 <line:97:5, col:38> col:38 heading_rate_switch 'SWITCH_SECOND_ORDER_COEFF_STRUCT':'SWITCH_SECOND_ORDER_COEFF_STRUCT'
|-FieldDecl 0x2aee1b0 <line:99:5, col:20> col:20 pitch_bias_linterp 'LINTERP_STRUCT':'LINTERP_STRUCT'
`-FieldDecl 0x2aee210 <line:101:5, col:9> col:9 tune_mode 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.CYCLIC_FEEDBACK_COEFF_STRUCT = type { float, float, float, float, float, %struct.ATTITUDE_CONTROLLER_COEFF_STRUCT, %struct.ATTITUDE_CONTROLLER_COEFF_STRUCT, %struct.SWITCH_SECOND_ORDER_COEFF_STRUCT, %struct.SWITCH_SECOND_ORDER_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, float, %struct.SWITCH_SECOND_ORDER_COEFF_STRUCT, %struct.LINTERP_STRUCT, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2af2658 <..\..\..\Model\Inner_Loop\Header/UARModeLogic.h:56:9, line:73:1> line:56:9 struct definition
|-FullComment 0x2af6b28 <line:51:4, line:55:76>
| |-ParagraphComment 0x2af6950 <line:51:4, line:52:4>
| | |-TextComment 0x2af6900 <line:51:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2af6920 <line:52:1, col:4> Text="    "
| |-VerbatimLineComment 0x2af6970 <col:5, col:39> Text=" UARMODELOGIC_COEFF_STRUCT"
| |-ParagraphComment 0x2af69d8 <line:53:1, col:4>
| | `-TextComment 0x2af69b0 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2af69f8 <col:5, line:55:76> Name="brief"
|   `-ParagraphComment 0x2af6ae8 <line:53:11, line:55:76>
|     |-TextComment 0x2af6a20 <line:53:11, col:60> Text=" Coefficient structure for a UAR Mode Logic block."
|     |-TextComment 0x2af6a40 <line:54:1, col:4> Text="    "
|     |-InlineCommandComment 0x2af6a60 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2af6a80 <col:24, col:40> Text="{HAP1-SDD-IL,896}"
|     `-TextComment 0x2af6aa0 <line:55:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2af2710 <line:58:5, col:9> col:9 phi_upper_limit 'F32':'float'
|-FieldDecl 0x2af2770 <line:59:5, col:9> col:9 phi_lower_limit 'F32':'float'
|-FieldDecl 0x2af27d0 <line:60:5, col:9> col:9 theta_upper_limit 'F32':'float'
|-FieldDecl 0x2af2830 <line:61:5, col:9> col:9 theta_lower_limit 'F32':'float'
|-FieldDecl 0x2af2890 <line:62:5, col:9> col:9 p_filt_upper_limit 'F32':'float'
|-FieldDecl 0x2af28f0 <line:63:5, col:9> col:9 p_filt_lower_limit 'F32':'float'
|-FieldDecl 0x2af2950 <line:64:5, col:9> col:9 q_filt_upper_limit 'F32':'float'
|-FieldDecl 0x2af29b0 <line:65:5, col:9> col:9 q_filt_lower_limit 'F32':'float'
|-FieldDecl 0x2af2a10 <line:67:5, col:34> col:34 run_p1shot 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'
`-FieldDecl 0x2af2a70 <line:70:5, col:34> col:34 uar_hold_p1shot 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.UARMODELOGIC_COEFF_STRUCT = type { float, float, float, float, float, float, float, float, %struct.PERSISTENT1SHOT_COEFF_STRUCT, %struct.PERSISTENT1SHOT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2af3ef8 <..\..\..\Model\Inner_Loop\Header/MCP_Control_Producer.h:73:9, line:78:1> line:73:9 struct definition
|-FullComment 0x2af6db0 <line:68:4, line:72:76>
| |-ParagraphComment 0x2af6bd8 <line:68:4, line:69:4>
| | |-TextComment 0x2af6b88 <line:68:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2af6ba8 <line:69:1, col:4> Text="    "
| |-VerbatimLineComment 0x2af6bf8 <col:5, col:47> Text=" MCP_CONTROL_PRODUCER_COEFF_STRUCT"
| |-ParagraphComment 0x2af6c60 <line:70:1, col:4>
| | `-TextComment 0x2af6c38 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2af6c80 <col:5, line:72:76> Name="brief"
|   `-ParagraphComment 0x2af6d70 <line:70:11, line:72:76>
|     |-TextComment 0x2af6ca8 <line:70:11, col:67> Text=" Coefficient structure for an MCP Control Producer block."
|     |-TextComment 0x2af6cc8 <line:71:1, col:4> Text="    "
|     |-InlineCommandComment 0x2af6ce8 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2af6d08 <col:24, col:40> Text="{HAP1-SDD-IL,853}"
|     `-TextComment 0x2af6d28 <line:72:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2af3fb0 <line:75:5, col:34> col:34 cyclic_feedback 'CYCLIC_FEEDBACK_COEFF_STRUCT':'CYCLIC_FEEDBACK_COEFF_STRUCT'
`-FieldDecl 0x2af7060 <line:76:5, col:31> col:31 uar_mode_logic 'UARMODELOGIC_COEFF_STRUCT':'UARMODELOGIC_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.MCP_CONTROL_PRODUCER_COEFF_STRUCT = type { %struct.CYCLIC_FEEDBACK_COEFF_STRUCT, %struct.UARMODELOGIC_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c49880 <..\..\..\Model\Common\Header\Tenth_Order_Average.h:65:9, line:69:1> line:65:9 struct definition
|-FullComment 0x2c680f0 <line:60:4, line:64:76>
| |-ParagraphComment 0x2af6e60 <line:60:4, line:61:4>
| | |-TextComment 0x2af6e10 <line:60:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2af6e30 <line:61:1, col:4> Text="    "
| |-VerbatimLineComment 0x2af6e80 <col:5, col:46> Text=" TENTH_ORDER_AVERAGE_COEFF_STRUCT"
| |-ParagraphComment 0x2af6ee8 <line:62:1, col:4>
| | `-TextComment 0x2af6ec0 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2af6f08 <col:5, line:64:76> Name="brief"
|   `-ParagraphComment 0x2af6ff8 <line:62:11, line:64:76>
|     |-TextComment 0x2af6f30 <line:62:11, col:54> Text=" Coefficients struct for Tenth Order Average"
|     |-TextComment 0x2af6f50 <line:63:1, col:4> Text="    "
|     |-InlineCommandComment 0x2af6f70 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2af6f90 <col:21, col:37> Text="{HAP1-SDD-MC,463}"
|     `-TextComment 0x2af6fb0 <line:64:1, col:76> Text="   ======================================================================== "
`-FieldDecl 0x2c49940 <line:67:5, col:9> col:9 sample_interval 'U32':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%struct.TENTH_ORDER_AVERAGE_COEFF_STRUCT = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c4c4f8 <..\..\..\Model\Common\Header\FirstOrderFilter.h:54:9, line:62:1> line:54:9 struct definition
|-FullComment 0x2c68378 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c681a0 <line:49:4, line:50:4>
| | |-TextComment 0x2c68150 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c68170 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c681c0 <col:5, col:43> Text=" FIRSTORDERFILTER_COEFF_STRUCT"
| |-ParagraphComment 0x2c68228 <line:51:1, col:4>
| | `-TextComment 0x2c68200 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c68248 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c68338 <line:51:11, line:53:76>
|     |-TextComment 0x2c68270 <line:51:11, col:53> Text=" Coefficients struct for First Order Filter"
|     |-TextComment 0x2c68290 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c682b0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c682d0 <col:21, col:37> Text="{HAP1-SDD-MC,474}"
|     `-TextComment 0x2c682f0 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2c4c5b0 <line:56:5, col:9> col:9 a1 'F32':'float'
|-FieldDecl 0x2c4c610 <line:57:5, col:9> col:9 b0 'F32':'float'
|-FieldDecl 0x2c4c670 <line:58:5, col:9> col:9 b1 'F32':'float'
|-FieldDecl 0x2c4c6d0 <line:59:5, col:9> col:9 k1 'F32':'float'
`-FieldDecl 0x2c4c730 <line:60:5, col:9> col:9 k2 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.FIRSTORDERFILTER_COEFF_STRUCT = type { float, float, float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c4c058 <..\..\..\Model\Inner_Loop\Header/Monitor_Command.h:54:9, line:62:1> line:54:9 struct definition
|-FullComment 0x2c68600 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c68428 <line:49:4, line:50:4>
| | |-TextComment 0x2c683d8 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c683f8 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c68448 <col:5, col:42> Text=" MONITOR_COMMAND_COEFF_STRUCT"
| |-ParagraphComment 0x2c684b0 <line:51:1, col:4>
| | `-TextComment 0x2c68488 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c684d0 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c685c0 <line:51:11, line:53:76>
|     |-TextComment 0x2c684f8 <line:51:11, col:55> Text=" coefficient struct for monitor command block"
|     |-TextComment 0x2c68518 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c68538 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c68558 <col:19, col:35> Text="{HAP1-SDD-IL,543}"
|     `-TextComment 0x2c68578 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2c50170 <line:56:5, col:41> col:41 p1shot_coeff 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'
|-FieldDecl 0x2c501d0 <line:57:5, col:41> col:41 toa_coeff 'TENTH_ORDER_AVERAGE_COEFF_STRUCT':'TENTH_ORDER_AVERAGE_COEFF_STRUCT'
|-FieldDecl 0x2c50230 <line:58:5, col:41> col:41 wash_out_coeff 'FIRSTORDERFILTER_COEFF_STRUCT':'FIRSTORDERFILTER_COEFF_STRUCT'
|-FieldDecl 0x2c50290 <line:59:5, col:41> col:41 wof_l_limit 'F32':'float'
`-FieldDecl 0x2c502f0 <line:60:5, col:41> col:41 wof_u_limit 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.MONITOR_COMMAND_COEFF_STRUCT = type { %struct.PERSISTENT1SHOT_COEFF_STRUCT, %struct.TENTH_ORDER_AVERAGE_COEFF_STRUCT, %struct.FIRSTORDERFILTER_COEFF_STRUCT, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c4fbf8 <..\..\..\Model\Inner_Loop\Header/Monitor.h:52:9, line:61:1> line:52:9 struct definition
|-FullComment 0x2c68888 <line:47:4, line:51:76>
| |-ParagraphComment 0x2c686b0 <line:47:4, line:48:4>
| | |-TextComment 0x2c68660 <line:47:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c68680 <line:48:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c686d0 <col:5, col:34> Text=" MONITOR_COEFF_STRUCT"
| |-ParagraphComment 0x2c68738 <line:49:1, col:4>
| | `-TextComment 0x2c68710 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c68758 <col:5, line:51:76> Name="brief"
|   `-ParagraphComment 0x2c68848 <line:49:11, line:51:76>
|     |-TextComment 0x2c68780 <line:49:11, col:47> Text=" coefficient struct for monitor block"
|     |-TextComment 0x2c687a0 <line:50:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c687c0 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c687e0 <col:19, col:35> Text="{HAP1-SDD-IL,535}"
|     `-TextComment 0x2c68800 <line:51:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2c4fcb0 <line:54:5, col:9> col:9 rate_l_limit 'F32':'float'
|-FieldDecl 0x2c4fd10 <line:55:5, col:9> col:9 rate_u_limit 'F32':'float'
|-FieldDecl 0x2c4fd70 <line:56:5, col:9> col:9 attitude_l_limit 'F32':'float'
|-FieldDecl 0x2c4fdd0 <line:57:5, col:9> col:9 attitude_u_limit 'F32':'float'
|-FieldDecl 0x2c4fe30 <line:58:5, col:34> col:34 adp_cmd_coeff 'MONITOR_COMMAND_COEFF_STRUCT':'MONITOR_COMMAND_COEFF_STRUCT'
`-FieldDecl 0x2c4fe90 <line:59:5, col:34> col:34 act_pos_coeff 'MONITOR_COMMAND_COEFF_STRUCT':'MONITOR_COMMAND_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.MONITOR_COEFF_STRUCT = type { float, float, float, float, %struct.MONITOR_COMMAND_COEFF_STRUCT, %struct.MONITOR_COMMAND_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c54470 <..\..\..\Model\Inner_Loop\Header/Inner_Loop_Monitors.h:52:9, line:60:1> line:52:9 struct definition
|-FullComment 0x2c68b10 <line:47:4, line:51:76>
| |-ParagraphComment 0x2c68938 <line:47:4, line:48:4>
| | |-TextComment 0x2c688e8 <line:47:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c68908 <line:48:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c68958 <col:5, col:46> Text=" INNER_LOOP_MONITORS_COEFF_STRUCT"
| |-ParagraphComment 0x2c689c0 <line:49:1, col:4>
| | `-TextComment 0x2c68998 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c689e0 <col:5, line:51:76> Name="brief"
|   `-ParagraphComment 0x2c68ad0 <line:49:11, line:51:76>
|     |-TextComment 0x2c68a08 <line:49:11, col:60> Text=" coefficients struct for inner loop monitors block"
|     |-TextComment 0x2c68a28 <line:50:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c68a48 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2c68a68 <col:24, col:40> Text="{HAP1-SDD-IL,713}"
|     `-TextComment 0x2c68a88 <line:51:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2c54530 <line:54:5, col:37> col:37 roll_coeff 'MONITOR_COEFF_STRUCT':'MONITOR_COEFF_STRUCT'
|-FieldDecl 0x2c54590 <line:55:5, col:37> col:37 pitch_coeff 'MONITOR_COEFF_STRUCT':'MONITOR_COEFF_STRUCT'
|-FieldDecl 0x2c545f0 <line:56:5, col:37> col:37 lf_l_limit 'F32':'float'
`-FieldDecl 0x2c54650 <line:58:5, col:37> col:37 pos_coeff 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.INNER_LOOP_MONITORS_COEFF_STRUCT = type { %struct.MONITOR_COEFF_STRUCT, %struct.MONITOR_COEFF_STRUCT, float, %struct.PERSISTENT1SHOT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c56fe0 <..\..\..\Model\Common\Header\ScheduledRateLimiter.h:54:9, line:59:1> line:54:9 struct definition
|-FullComment 0x2c68d98 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c68bc0 <line:49:4, line:50:4>
| | |-TextComment 0x2c68b70 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c68b90 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c68be0 <col:5, col:47> Text=" SCHEDULEDRATELIMITER_COEFF_STRUCT"
| |-ParagraphComment 0x2c68c48 <line:51:1, col:4>
| | `-TextComment 0x2c68c20 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c68c68 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c68d58 <line:51:11, line:53:76>
|     |-TextComment 0x2c68c90 <line:51:11, col:61> Text=" Coefficients struct for the Scheduled Rate Limiter"
|     |-TextComment 0x2c68cb0 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c68cd0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c68cf0 <col:21, col:37> Text="{HAP1-SDD-MC,835}"
|     `-TextComment 0x2c68d10 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2c570a0 <line:56:5, col:20> col:20 upper_linterp 'LINTERP_STRUCT':'LINTERP_STRUCT'
`-FieldDecl 0x2c57100 <line:57:5, col:20> col:20 lower_linterp 'LINTERP_STRUCT':'LINTERP_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.SCHEDULEDRATELIMITER_COEFF_STRUCT = type { %struct.LINTERP_STRUCT, %struct.LINTERP_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c5ae28 <..\..\..\Model\Inner_Loop\Header\MCP.h:79:9, line:92:1> line:79:9 struct definition
|-FullComment 0x2c69020 <line:74:4, line:78:76>
| |-ParagraphComment 0x2c68e48 <line:74:4, line:75:4>
| | |-TextComment 0x2c68df8 <line:74:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c68e18 <line:75:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c68e68 <col:5, col:30> Text=" MCP_COEFF_STRUCT"
| |-ParagraphComment 0x2c68ed0 <line:76:1, col:4>
| | `-TextComment 0x2c68ea8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c68ef0 <col:5, line:78:76> Name="brief"
|   `-ParagraphComment 0x2c68fe0 <line:76:11, line:78:76>
|     |-TextComment 0x2c68f18 <line:76:11, col:50> Text=" Coefficient structure for an MCP block."
|     |-TextComment 0x2c68f38 <line:77:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c68f58 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2c68f78 <col:24, col:40> Text="{HAP1-SDD-IL,802}"
|     `-TextComment 0x2c68f98 <line:78:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2c5aee0 <line:81:5, col:43> col:43 control_coeff 'MCP_CONTROL_PRODUCER_COEFF_STRUCT':'MCP_CONTROL_PRODUCER_COEFF_STRUCT'
|-FieldDecl 0x2c5af40 <line:82:5, col:43> col:43 monitors_coeff 'INNER_LOOP_MONITORS_COEFF_STRUCT':'INNER_LOOP_MONITORS_COEFF_STRUCT'
|-FieldDecl 0x2c5afa0 <line:83:5, col:43> col:43 roll_scheduledRL_coeff 'SCHEDULEDRATELIMITER_COEFF_STRUCT':'SCHEDULEDRATELIMITER_COEFF_STRUCT'
|-FieldDecl 0x2c59000 <line:84:5, col:43> col:43 pitch_scheduledRL_coeff 'SCHEDULEDRATELIMITER_COEFF_STRUCT':'SCHEDULEDRATELIMITER_COEFF_STRUCT'
|-FieldDecl 0x2c59060 <line:85:5, col:43> col:43 roll_servo_testport 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2c590c0 <line:86:5, col:43> col:43 pitch_servo_testport 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2c59120 <line:87:5, col:43> col:43 roll_cyclic_testport_coeff 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2c59180 <line:88:5, col:43> col:43 pitch_cyclic_testport_coeff 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2c591e0 <line:89:5, col:43> col:43 sin_wave_frequency 'F32':'float'
`-FieldDecl 0x2c59240 <line:90:5, col:43> col:43 sin_wave_amplitude 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.MCP_COEFF_STRUCT = type { %struct.MCP_CONTROL_PRODUCER_COEFF_STRUCT, %struct.INNER_LOOP_MONITORS_COEFF_STRUCT, %struct.SCHEDULEDRATELIMITER_COEFF_STRUCT, %struct.SCHEDULEDRATELIMITER_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | SATURATIONDYNVF_COEFF_STRUCT
         0 |   F32 K_Ts
         4 |   F32 epsilon
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SERVO_LOOP_COEFF_STRUCT
         0 |   TEST_PORT_COEFF_STRUCT testport_case1
         0 |     F32 gain
         4 |     F32 bias
         8 |   SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
         8 |     F32 K_Ts
        12 |     F32 epsilon
        16 |   REINTICHS_COEFF_STRUCT ReInt_ICHS
        16 |     F32 K_Ts
        20 |     F32 Gain
        24 |     F32 UL
        28 |     F32 LL
        32 |     F32 rail_bounce_divisor
        36 |     REINTICH_COEFF_STRUCT integrator_coeff
        36 |       F32 K_Ts
        40 |     SATURATIONVF_COEFF_STRUCT sat_coeff
        40 |       F32 epsilon
        44 |       F32 upper_sat_limit
        48 |       F32 lower_sat_limit
        52 |   F32 k_ts
        56 |   F32 k
        60 |   F32 k2
        64 |   F32 k3
        68 |   F32 k4
        72 |   F32 max_current
        76 |   F32 rate_limiter_upper_limit
        80 |   F32 rate_limiter_lower_limit
           | [sizeof=84, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c5cdd0 <..\..\..\Model\Common\Header\SaturationDynVF.h:53:9, line:58:1> line:53:9 struct definition
|-FullComment 0x2c69400 <line:48:4, line:52:76>
| |-ParagraphComment 0x2c69228 <line:48:4, line:49:4>
| | |-TextComment 0x2c691d8 <line:48:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c691f8 <line:49:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c69248 <col:5, col:42> Text=" SATURATIONDYNVF_COEFF_STRUCT"
| |-ParagraphComment 0x2c692b0 <line:50:1, col:4>
| | `-TextComment 0x2c69288 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c692d0 <col:5, line:52:76> Name="brief"
|   `-ParagraphComment 0x2c693c0 <line:50:11, line:52:76>
|     |-TextComment 0x2c692f8 <line:50:11, col:50> Text=" Coefficients struct for SaturationDynVF"
|     |-TextComment 0x2c69318 <line:51:1, col:4> Text="    "
