
*** Dumping AST Record Layout
         0 | VECTOR3
         0 |   F32 X
         4 |   F32 Y
         8 |   F32 Z
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_ADC_SAMPLE_STRUCT
         0 |   S16 X
         2 |   S16 Y
         4 |   S16 Z
           | [sizeof=6, align=2]

*** Dumping AST Record Layout
         0 | PIN_PERIPH_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   U32 pin_config
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PIN_ADC_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_COEFF_STRUCT
         0 |   U32 P
         4 |   BOOLEAN ic
         5 |   BOOLEAN rising_edge
         6 |   BOOLEAN falling_edge
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | MOMENTARY_SWITCH_COEFF_STRUCT
         0 |   U32 debounce_threshold
         4 |   U32 sustain_threshold
         8 |   PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
         8 |     U32 P
        12 |     BOOLEAN ic
        13 |     BOOLEAN rising_edge
        14 |     BOOLEAN falling_edge
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | PIN_GPIO_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:125:5)
         0 |   PIN_GPIO_HW_STRUCT pwr_path_test
         0 |     U32 port
         4 |     U8 pin
         8 |   PIN_GPIO_HW_STRUCT brake_pwr_test
         8 |     U32 port
        12 |     U8 pin
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:169:5)
         0 |   int diag_1
         4 |   int diag_2
         8 |   int diag_3
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:178:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:187:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:196:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_brakes
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | TARGET_VOLTAGE_MONITORS_HW_UNION
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:169:5) schematic
         0 |     int diag_1
         4 |     int diag_2
         8 |     int diag_3
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:178:5) MCPA
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:187:5) MCPB
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:196:5) MCPC
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_brakes
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | PACKET_TYPE_STRUCT
         0 |   ADP2MCP_PACKET_TYPE packet_type
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | EULER_ANGLES
         0 |   F32 phi
         4 |   F32 theta
         8 |   F32 psi
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_STATE_STRUCT
         0 |   BOOLEAN init
         4 |   U32 iteration
         8 |   BOOLEAN prev_input
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_INPUT_STRUCT
         0 |   BOOLEAN input
         1 |   BOOLEAN reset
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_OUTPUT_STRUCT
         0 |   BOOLEAN output
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |   PERSISTENT1SHOT_STATE_STRUCT state
         8 |     BOOLEAN init
        12 |     U32 iteration
        16 |     BOOLEAN prev_input
        20 |   PERSISTENT1SHOT_INPUT_STRUCT input
        20 |     BOOLEAN input
        21 |     BOOLEAN reset
        22 |   PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |     BOOLEAN output
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_COEFF_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
         0 |     U32 P
         4 |     BOOLEAN ic
         5 |     BOOLEAN rising_edge
         6 |     BOOLEAN falling_edge
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_STATE_STRUCT
         0 |   PERSISTENT1SHOT_STRUCT transition_one_shot
         0 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |     PERSISTENT1SHOT_STATE_STRUCT state
         8 |       BOOLEAN init
        12 |       U32 iteration
        16 |       BOOLEAN prev_input
        20 |     PERSISTENT1SHOT_INPUT_STRUCT input
        20 |       BOOLEAN input
        21 |       BOOLEAN reset
        22 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   F32 output_previous
        28 |   F32 transition_deviation_latched
        32 |   F32 selected_input
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_STRUCT
         0 |   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
         8 |   SWITCH_COMMON_STATE_STRUCT state
         8 |     PERSISTENT1SHOT_STRUCT transition_one_shot
         8 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        16 |       PERSISTENT1SHOT_STATE_STRUCT state
        16 |         BOOLEAN init
        20 |         U32 iteration
        24 |         BOOLEAN prev_input
        28 |       PERSISTENT1SHOT_INPUT_STRUCT input
        28 |         BOOLEAN input
        29 |         BOOLEAN reset
        30 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        30 |         BOOLEAN output
        32 |     F32 output_previous
        36 |     F32 transition_deviation_latched
        40 |     F32 selected_input
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | LINTERP_REGION_STRUCT
         0 |   F32 breakpoint
         4 |   F32 value
         8 |   F32 slope
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_COEFF_STRUCT
         0 |   F32 K_Ts
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_STATE_STRUCT
         0 |   F32 delay
         4 |   BOOLEAN reset_on_init
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN run
         9 |   BOOLEAN hold
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_STRUCT
         0 |   REINTICH_COEFF_STRUCT * coeff
         8 |   REINTICH_STATE_STRUCT state
         8 |     F32 delay
        12 |     BOOLEAN reset_on_init
        16 |   REINTICH_INPUT_STRUCT input
        16 |     F32 IC
        20 |     F32 input
        24 |     BOOLEAN run
        25 |     BOOLEAN hold
        28 |   REINTICH_OUTPUT_STRUCT output
        28 |     F32 output
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | LINTERP_STRUCT
         0 |   U8 n_regions
         4 |   LINTERP_REGION_STRUCT [20] regions
           | [sizeof=244, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_INPUT_STRUCT
         0 |   F32 input
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN inv
         5 |   BOOLEAN satLo
         6 |   BOOLEAN satHi
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_STRUCT
         0 |   SATURATIONVF_COEFF_STRUCT * coeff
         8 |   SATURATIONVF_INPUT_STRUCT input
         8 |     F32 input
        12 |   SATURATIONVF_OUTPUT_STRUCT output
        12 |     F32 output
        16 |     BOOLEAN inv
        17 |     BOOLEAN satLo
        18 |     BOOLEAN satHi
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | REINTICHS_STATE_STRUCT
         0 |   REINTICH_STRUCT integrator
         0 |     REINTICH_COEFF_STRUCT * coeff
         8 |     REINTICH_STATE_STRUCT state
         8 |       F32 delay
        12 |       BOOLEAN reset_on_init
        16 |     REINTICH_INPUT_STRUCT input
        16 |       F32 IC
        20 |       F32 input
        24 |       BOOLEAN run
        25 |       BOOLEAN hold
        28 |     REINTICH_OUTPUT_STRUCT output
        28 |       F32 output
        32 |   SATURATIONVF_STRUCT sat
        32 |     SATURATIONVF_COEFF_STRUCT * coeff
        40 |     SATURATIONVF_INPUT_STRUCT input
        40 |       F32 input
        44 |     SATURATIONVF_OUTPUT_STRUCT output
        44 |       F32 output
        48 |       BOOLEAN inv
        49 |       BOOLEAN satLo
        50 |       BOOLEAN satHi
        56 |   BOOLEAN prev_sat_UL
        57 |   BOOLEAN prev_sat_LL
        58 |   BOOLEAN prev_sat_inv
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | REINTICHS_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN run
         9 |   BOOLEAN hold
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN sat_UL
         5 |   BOOLEAN sat_LL
         6 |   BOOLEAN inv
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_STRUCT
         0 |   REINTICHS_COEFF_STRUCT * coeff
         8 |   REINTICHS_STATE_STRUCT state
         8 |     REINTICH_STRUCT integrator
         8 |       REINTICH_COEFF_STRUCT * coeff
        16 |       REINTICH_STATE_STRUCT state
        16 |         F32 delay
        20 |         BOOLEAN reset_on_init
        24 |       REINTICH_INPUT_STRUCT input
        24 |         F32 IC
        28 |         F32 input
        32 |         BOOLEAN run
        33 |         BOOLEAN hold
        36 |       REINTICH_OUTPUT_STRUCT output
        36 |         F32 output
        40 |     SATURATIONVF_STRUCT sat
        40 |       SATURATIONVF_COEFF_STRUCT * coeff
        48 |       SATURATIONVF_INPUT_STRUCT input
        48 |         F32 input
        52 |       SATURATIONVF_OUTPUT_STRUCT output
        52 |         F32 output
        56 |         BOOLEAN inv
        57 |         BOOLEAN satLo
        58 |         BOOLEAN satHi
        64 |     BOOLEAN prev_sat_UL
        65 |     BOOLEAN prev_sat_LL
        66 |     BOOLEAN prev_sat_inv
        72 |   REINTICHS_INPUT_STRUCT input
        72 |     F32 IC
        76 |     F32 input
        80 |     BOOLEAN run
        81 |     BOOLEAN hold
        84 |   REINTICHS_OUTPUT_STRUCT output
        84 |     F32 output
        88 |     BOOLEAN sat_UL
        89 |     BOOLEAN sat_LL
        90 |     BOOLEAN inv
           | [sizeof=96, align=8]

*** Dumping AST Record Layout
         0 | RATELIMITERDYNVF_COEFF_STRUCT
         0 |   F32 ts
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | RATELIMITERDYNVF_STATE_STRUCT
         0 |   F32 previous_state
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | RATELIMITERDYNVF_INPUT_STRUCT
         0 |   F32 ic
         4 |   F32 input
         8 |   F32 smax
        12 |   F32 smin
        16 |   BOOLEAN reset
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | RATELIMITERDYNVF_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN satUL
         5 |   BOOLEAN satLL
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | RATELIMITERDYNVF_STRUCT
         0 |   RATELIMITERDYNVF_COEFF_STRUCT * coeff
         8 |   RATELIMITERDYNVF_STATE_STRUCT state
         8 |     F32 previous_state
        12 |   RATELIMITERDYNVF_INPUT_STRUCT input
        12 |     F32 ic
        16 |     F32 input
        20 |     F32 smax
        24 |     F32 smin
        28 |     BOOLEAN reset
        32 |   RATELIMITERDYNVF_OUTPUT_STRUCT output
        32 |     F32 output
        36 |     BOOLEAN satUL
        37 |     BOOLEAN satLL
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_INPUT_STRUCT
         0 |   F32 target
         4 |   F32 rate_cross_axis
         8 |   F32 rate_near_axis
        12 |   F32 attitude_near_axis
        16 |   F32 ias
        20 |   F32 actuator_position_fb
        24 |   BOOLEAN reset_integrator
           | [sizeof=28, align=4]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_STATE_STRUCT
         0 |   REINTICHS_STRUCT reintichs
         0 |     REINTICHS_COEFF_STRUCT * coeff
         8 |     REINTICHS_STATE_STRUCT state
         8 |       REINTICH_STRUCT integrator
         8 |         REINTICH_COEFF_STRUCT * coeff
        16 |         REINTICH_STATE_STRUCT state
        16 |           F32 delay
        20 |           BOOLEAN reset_on_init
        24 |         REINTICH_INPUT_STRUCT input
        24 |           F32 IC
        28 |           F32 input
        32 |           BOOLEAN run
        33 |           BOOLEAN hold
        36 |         REINTICH_OUTPUT_STRUCT output
        36 |           F32 output
        40 |       SATURATIONVF_STRUCT sat
        40 |         SATURATIONVF_COEFF_STRUCT * coeff
        48 |         SATURATIONVF_INPUT_STRUCT input
        48 |           F32 input
        52 |         SATURATIONVF_OUTPUT_STRUCT output
        52 |           F32 output
        56 |           BOOLEAN inv
        57 |           BOOLEAN satLo
        58 |           BOOLEAN satHi
        64 |       BOOLEAN prev_sat_UL
        65 |       BOOLEAN prev_sat_LL
        66 |       BOOLEAN prev_sat_inv
        72 |     REINTICHS_INPUT_STRUCT input
        72 |       F32 IC
        76 |       F32 input
        80 |       BOOLEAN run
        81 |       BOOLEAN hold
        84 |     REINTICHS_OUTPUT_STRUCT output
        84 |       F32 output
        88 |       BOOLEAN sat_UL
        89 |       BOOLEAN sat_LL
        90 |       BOOLEAN inv
        96 |   F32 prop
       100 |   F32 rate
       104 |   BOOLEAN prev_run
           | [sizeof=112, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN integ_sat_UL
         5 |   BOOLEAN integ_sat_LL
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_STRUCT
         0 |   ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
         8 |   ATTITUDE_CONTROLLER_INPUT_STRUCT input
         8 |     F32 target
        12 |     F32 rate_cross_axis
        16 |     F32 rate_near_axis
        20 |     F32 attitude_near_axis
        24 |     F32 ias
        28 |     F32 actuator_position_fb
        32 |     BOOLEAN reset_integrator
        40 |   ATTITUDE_CONTROLLER_STATE_STRUCT state
        40 |     REINTICHS_STRUCT reintichs
        40 |       REINTICHS_COEFF_STRUCT * coeff
        48 |       REINTICHS_STATE_STRUCT state
        48 |         REINTICH_STRUCT integrator
        48 |           REINTICH_COEFF_STRUCT * coeff
        56 |           REINTICH_STATE_STRUCT state
        56 |             F32 delay
        60 |             BOOLEAN reset_on_init
        64 |           REINTICH_INPUT_STRUCT input
        64 |             F32 IC
        68 |             F32 input
        72 |             BOOLEAN run
        73 |             BOOLEAN hold
        76 |           REINTICH_OUTPUT_STRUCT output
        76 |             F32 output
        80 |         SATURATIONVF_STRUCT sat
        80 |           SATURATIONVF_COEFF_STRUCT * coeff
        88 |           SATURATIONVF_INPUT_STRUCT input
        88 |             F32 input
        92 |           SATURATIONVF_OUTPUT_STRUCT output
        92 |             F32 output
        96 |             BOOLEAN inv
        97 |             BOOLEAN satLo
        98 |             BOOLEAN satHi
       104 |         BOOLEAN prev_sat_UL
       105 |         BOOLEAN prev_sat_LL
       106 |         BOOLEAN prev_sat_inv
       112 |       REINTICHS_INPUT_STRUCT input
       112 |         F32 IC
       116 |         F32 input
       120 |         BOOLEAN run
       121 |         BOOLEAN hold
       124 |       REINTICHS_OUTPUT_STRUCT output
       124 |         F32 output
       128 |         BOOLEAN sat_UL
       129 |         BOOLEAN sat_LL
       130 |         BOOLEAN inv
       136 |     F32 prop
       140 |     F32 rate
       144 |     BOOLEAN prev_run
       152 |   ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       152 |     F32 output
       156 |     BOOLEAN integ_sat_UL
       157 |     BOOLEAN integ_sat_LL
           | [sizeof=160, align=8]

*** Dumping AST Record Layout
         0 | TEST_PORT_COEFF_STRUCT
         0 |   F32 gain
         4 |   F32 bias
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_INPUT_STRUCT
         0 |   F32 input
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_STRUCT
         0 |   TEST_PORT_COEFF_STRUCT * coeff
         8 |   TEST_PORT_INPUT_STRUCT input
         8 |     F32 input
        12 |   TEST_PORT_OUTPUT_STRUCT output
        12 |     F32 output
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | CYCLIC_STRUCT
         0 |   F32 roll
         4 |   F32 pitch
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_STATE_STRUCT
         0 |   F32 s1
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_INPUT_STRUCT
         0 |   BOOLEAN set
         1 |   BOOLEAN reset
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_OUTPUT_STRUCT
         0 |   BOOLEAN output
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_STRUCT
         0 |   ROS_FLIPFLOP_STATE_STRUCT state
         0 |     F32 s1
         4 |   ROS_FLIPFLOP_INPUT_STRUCT input
         4 |     BOOLEAN set
         5 |     BOOLEAN reset
         6 |   ROS_FLIPFLOP_OUTPUT_STRUCT output
         6 |     BOOLEAN output
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | G_LIMITER_COEFF_STRUCT
         0 |   RATELIMITERDYNVF_COEFF_STRUCT ratelimiterdynvf
         0 |     F32 ts
         4 |   F32 g_limit
         8 |   F32 max_rate_limit
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_COEFF_STRUCT
         0 |   F32 epsilon
         4 |   F32 upper_sat_limit
         8 |   F32 lower_sat_limit
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_COEFF_STRUCT
         0 |   REINTICH_COEFF_STRUCT integrator_coeff
         0 |     F32 K_Ts
         4 |   SATURATIONVF_COEFF_STRUCT sat_coeff
         4 |     F32 epsilon
         8 |     F32 upper_sat_limit
        12 |     F32 lower_sat_limit
        16 |   F32 K_Ts
        20 |   F32 response_bias
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_COEFF_STRUCT
         0 |   LINTERP_STRUCT k_attitude_to_ang_accel
         0 |     U8 n_regions
         4 |     LINTERP_REGION_STRUCT [20] regions
       244 |   LINTERP_STRUCT k_rate_to_ang_accel
       244 |     U8 n_regions
       248 |     LINTERP_REGION_STRUCT [20] regions
       488 |   F32 k_attitude_to_ang_accel_integral
       492 |   F32 k_rate_to_ang_accel_cross
       496 |   REINTICHS_COEFF_STRUCT reintichs
       496 |     REINTICH_COEFF_STRUCT integrator_coeff
       496 |       F32 K_Ts
       500 |     SATURATIONVF_COEFF_STRUCT sat_coeff
       500 |       F32 epsilon
       504 |       F32 upper_sat_limit
       508 |       F32 lower_sat_limit
       512 |     F32 K_Ts
       516 |     F32 response_bias
           | [sizeof=520, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_COEFF_STRUCT
         0 |   F32 rate_limiter_lower_limit
         4 |   F32 rate_limiter_upper_limit
         8 |   G_LIMITER_COEFF_STRUCT g_limiter
         8 |     RATELIMITERDYNVF_COEFF_STRUCT ratelimiterdynvf
         8 |       F32 ts
        12 |     F32 g_limit
        16 |     F32 max_rate_limit
        20 |   ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |     LINTERP_STRUCT k_attitude_to_ang_accel
        20 |       U8 n_regions
        24 |       LINTERP_REGION_STRUCT [20] regions
       264 |     LINTERP_STRUCT k_rate_to_ang_accel
       264 |       U8 n_regions
       268 |       LINTERP_REGION_STRUCT [20] regions
       508 |     F32 k_attitude_to_ang_accel_integral
       512 |     F32 k_rate_to_ang_accel_cross
       516 |     REINTICHS_COEFF_STRUCT reintichs
       516 |       REINTICH_COEFF_STRUCT integrator_coeff
       516 |         F32 K_Ts
       520 |       SATURATIONVF_COEFF_STRUCT sat_coeff
       520 |         F32 epsilon
       524 |         F32 upper_sat_limit
       528 |         F32 lower_sat_limit
       532 |       F32 K_Ts
       536 |       F32 response_bias
       540 |   ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       540 |     LINTERP_STRUCT k_attitude_to_ang_accel
       540 |       U8 n_regions
       544 |       LINTERP_REGION_STRUCT [20] regions
       784 |     LINTERP_STRUCT k_rate_to_ang_accel
       784 |       U8 n_regions
       788 |       LINTERP_REGION_STRUCT [20] regions
      1028 |     F32 k_attitude_to_ang_accel_integral
      1032 |     F32 k_rate_to_ang_accel_cross
      1036 |     REINTICHS_COEFF_STRUCT reintichs
      1036 |       REINTICH_COEFF_STRUCT integrator_coeff
      1036 |         F32 K_Ts
      1040 |       SATURATIONVF_COEFF_STRUCT sat_coeff
      1040 |         F32 epsilon
      1044 |         F32 upper_sat_limit
      1048 |         F32 lower_sat_limit
      1052 |       F32 K_Ts
      1056 |       F32 response_bias
      1060 |   TEST_PORT_COEFF_STRUCT roll_testport
      1060 |     F32 gain
      1064 |     F32 bias
      1068 |   TEST_PORT_COEFF_STRUCT pitch_testport
      1068 |     F32 gain
      1072 |     F32 bias
           | [sizeof=1076, align=4]

*** Dumping AST Record Layout
         0 | G_LIMITER_STATE_STRUCT
         0 |   RATELIMITERDYNVF_STRUCT ratelimiter
         0 |     RATELIMITERDYNVF_COEFF_STRUCT * coeff
         8 |     RATELIMITERDYNVF_STATE_STRUCT state
         8 |       F32 previous_state
        12 |     RATELIMITERDYNVF_INPUT_STRUCT input
        12 |       F32 ic
        16 |       F32 input
        20 |       F32 smax
        24 |       F32 smin
        28 |       BOOLEAN reset
        32 |     RATELIMITERDYNVF_OUTPUT_STRUCT output
        32 |       F32 output
        36 |       BOOLEAN satUL
        37 |       BOOLEAN satLL
        40 |   F32 TAS_gt_min
        44 |   BOOLEAN first_frame
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | G_LIMITER_INPUT_STRUCT
         0 |   F32 gamma
         4 |   F32 vtas
         8 |   F32 TAS_gt_min
        12 |   BOOLEAN reset
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | G_LIMITER_OUTPUT_STRUCT
         0 |   F32 gammaRL
         4 |   BOOLEAN gammaRUL
         5 |   BOOLEAN gammaRLL
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | G_LIMITER_STRUCT
         0 |   G_LIMITER_COEFF_STRUCT * coeff
         8 |   G_LIMITER_STATE_STRUCT state
         8 |     RATELIMITERDYNVF_STRUCT ratelimiter
         8 |       RATELIMITERDYNVF_COEFF_STRUCT * coeff
        16 |       RATELIMITERDYNVF_STATE_STRUCT state
        16 |         F32 previous_state
        20 |       RATELIMITERDYNVF_INPUT_STRUCT input
        20 |         F32 ic
        24 |         F32 input
        28 |         F32 smax
        32 |         F32 smin
        36 |         BOOLEAN reset
        40 |       RATELIMITERDYNVF_OUTPUT_STRUCT output
        40 |         F32 output
        44 |         BOOLEAN satUL
        45 |         BOOLEAN satLL
        48 |     F32 TAS_gt_min
        52 |     BOOLEAN first_frame
        56 |   G_LIMITER_INPUT_STRUCT input
        56 |     F32 gamma
        60 |     F32 vtas
        64 |     F32 TAS_gt_min
        68 |     BOOLEAN reset
        72 |   G_LIMITER_OUTPUT_STRUCT output
        72 |     F32 gammaRL
        76 |     BOOLEAN gammaRUL
        77 |     BOOLEAN gammaRLL
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_STATE_STRUCT
         0 |   ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         0 |     ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
         8 |     ATTITUDE_CONTROLLER_INPUT_STRUCT input
         8 |       F32 target
        12 |       F32 rate_cross_axis
        16 |       F32 rate_near_axis
        20 |       F32 attitude_near_axis
        24 |       F32 ias
        28 |       F32 actuator_position_fb
        32 |       BOOLEAN reset_integrator
        40 |     ATTITUDE_CONTROLLER_STATE_STRUCT state
        40 |       REINTICHS_STRUCT reintichs
        40 |         REINTICHS_COEFF_STRUCT * coeff
        48 |         REINTICHS_STATE_STRUCT state
        48 |           REINTICH_STRUCT integrator
        48 |             REINTICH_COEFF_STRUCT * coeff
        56 |             REINTICH_STATE_STRUCT state
        56 |               F32 delay
        60 |               BOOLEAN reset_on_init
        64 |             REINTICH_INPUT_STRUCT input
        64 |               F32 IC
        68 |               F32 input
        72 |               BOOLEAN run
        73 |               BOOLEAN hold
        76 |             REINTICH_OUTPUT_STRUCT output
        76 |               F32 output
        80 |           SATURATIONVF_STRUCT sat
        80 |             SATURATIONVF_COEFF_STRUCT * coeff
        88 |             SATURATIONVF_INPUT_STRUCT input
        88 |               F32 input
        92 |             SATURATIONVF_OUTPUT_STRUCT output
        92 |               F32 output
        96 |               BOOLEAN inv
        97 |               BOOLEAN satLo
        98 |               BOOLEAN satHi
       104 |           BOOLEAN prev_sat_UL
       105 |           BOOLEAN prev_sat_LL
       106 |           BOOLEAN prev_sat_inv
       112 |         REINTICHS_INPUT_STRUCT input
       112 |           F32 IC
       116 |           F32 input
       120 |           BOOLEAN run
       121 |           BOOLEAN hold
       124 |         REINTICHS_OUTPUT_STRUCT output
       124 |           F32 output
       128 |           BOOLEAN sat_UL
       129 |           BOOLEAN sat_LL
       130 |           BOOLEAN inv
       136 |       F32 prop
       140 |       F32 rate
       144 |       BOOLEAN prev_run
       152 |     ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       152 |       F32 output
       156 |       BOOLEAN integ_sat_UL
       157 |       BOOLEAN integ_sat_LL
       160 |   ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       160 |     ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       168 |     ATTITUDE_CONTROLLER_INPUT_STRUCT input
       168 |       F32 target
       172 |       F32 rate_cross_axis
       176 |       F32 rate_near_axis
       180 |       F32 attitude_near_axis
       184 |       F32 ias
       188 |       F32 actuator_position_fb
       192 |       BOOLEAN reset_integrator
       200 |     ATTITUDE_CONTROLLER_STATE_STRUCT state
       200 |       REINTICHS_STRUCT reintichs
       200 |         REINTICHS_COEFF_STRUCT * coeff
       208 |         REINTICHS_STATE_STRUCT state
       208 |           REINTICH_STRUCT integrator
       208 |             REINTICH_COEFF_STRUCT * coeff
       216 |             REINTICH_STATE_STRUCT state
       216 |               F32 delay
       220 |               BOOLEAN reset_on_init
       224 |             REINTICH_INPUT_STRUCT input
       224 |               F32 IC
       228 |               F32 input
       232 |               BOOLEAN run
       233 |               BOOLEAN hold
       236 |             REINTICH_OUTPUT_STRUCT output
       236 |               F32 output
       240 |           SATURATIONVF_STRUCT sat
       240 |             SATURATIONVF_COEFF_STRUCT * coeff
       248 |             SATURATIONVF_INPUT_STRUCT input
       248 |               F32 input
       252 |             SATURATIONVF_OUTPUT_STRUCT output
       252 |               F32 output
       256 |               BOOLEAN inv
       257 |               BOOLEAN satLo
       258 |               BOOLEAN satHi
       264 |           BOOLEAN prev_sat_UL
       265 |           BOOLEAN prev_sat_LL
       266 |           BOOLEAN prev_sat_inv
       272 |         REINTICHS_INPUT_STRUCT input
       272 |           F32 IC
       276 |           F32 input
       280 |           BOOLEAN run
       281 |           BOOLEAN hold
       284 |         REINTICHS_OUTPUT_STRUCT output
       284 |           F32 output
       288 |           BOOLEAN sat_UL
       289 |           BOOLEAN sat_LL
       290 |           BOOLEAN inv
       296 |       F32 prop
       300 |       F32 rate
       304 |       BOOLEAN prev_run
       312 |     ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       312 |       F32 output
       316 |       BOOLEAN integ_sat_UL
       317 |       BOOLEAN integ_sat_LL
       320 |   G_LIMITER_STRUCT g_limiter
       320 |     G_LIMITER_COEFF_STRUCT * coeff
       328 |     G_LIMITER_STATE_STRUCT state
       328 |       RATELIMITERDYNVF_STRUCT ratelimiter
       328 |         RATELIMITERDYNVF_COEFF_STRUCT * coeff
       336 |         RATELIMITERDYNVF_STATE_STRUCT state
       336 |           F32 previous_state
       340 |         RATELIMITERDYNVF_INPUT_STRUCT input
       340 |           F32 ic
       344 |           F32 input
       348 |           F32 smax
       352 |           F32 smin
       356 |           BOOLEAN reset
       360 |         RATELIMITERDYNVF_OUTPUT_STRUCT output
       360 |           F32 output
       364 |           BOOLEAN satUL
       365 |           BOOLEAN satLL
       368 |       F32 TAS_gt_min
       372 |       BOOLEAN first_frame
       376 |     G_LIMITER_INPUT_STRUCT input
       376 |       F32 gamma
       380 |       F32 vtas
       384 |       F32 TAS_gt_min
       388 |       BOOLEAN reset
       392 |     G_LIMITER_OUTPUT_STRUCT output
       392 |       F32 gammaRL
       396 |       BOOLEAN gammaRUL
       397 |       BOOLEAN gammaRLL
       400 |   TEST_PORT_STRUCT roll_testport
       400 |     TEST_PORT_COEFF_STRUCT * coeff
       408 |     TEST_PORT_INPUT_STRUCT input
       408 |       F32 input
       412 |     TEST_PORT_OUTPUT_STRUCT output
       412 |       F32 output
       416 |   TEST_PORT_STRUCT pitch_testport
       416 |     TEST_PORT_COEFF_STRUCT * coeff
       424 |     TEST_PORT_INPUT_STRUCT input
       424 |       F32 input
       428 |     TEST_PORT_OUTPUT_STRUCT output
       428 |       F32 output
       432 |   F32 roll_rate_limiter_previous_state
       436 |   F32 roll_test_input
       440 |   F32 pitch_test_input
       444 |   BOOLEAN first_frame
       445 |   BOOLEAN adp_roll_rate_limited
       446 |   BOOLEAN adp_pitch_rate_upper_limited
       447 |   BOOLEAN adp_pitch_rate_lower_limited
       448 |   BOOLEAN prev_reset_or_UAR_mode
           | [sizeof=456, align=8]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_INPUT_STRUCT
         0 |   F32 adp_phi_cmd
         4 |   F32 adp_theta_cmd
         8 |   F32 phi
        12 |   F32 phi_dot
        16 |   F32 theta
        20 |   F32 theta_dot
        24 |   F32 tas
        28 |   BOOLEAN reset
        29 |   BOOLEAN UAR_mode
        30 |   BOOLEAN triplex_fault
        31 |   BOOLEAN vertical_sync
        32 |   BOOLEAN lateral_sync
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_STRUCT
         0 |   CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
         8 |   CYCLIC_FEEDBACK_STATE_STRUCT state
         8 |     ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         8 |       ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        16 |       ATTITUDE_CONTROLLER_INPUT_STRUCT input
        16 |         F32 target
        20 |         F32 rate_cross_axis
        24 |         F32 rate_near_axis
        28 |         F32 attitude_near_axis
        32 |         F32 ias
        36 |         F32 actuator_position_fb
        40 |         BOOLEAN reset_integrator
        48 |       ATTITUDE_CONTROLLER_STATE_STRUCT state
        48 |         REINTICHS_STRUCT reintichs
        48 |           REINTICHS_COEFF_STRUCT * coeff
        56 |           REINTICHS_STATE_STRUCT state
        56 |             REINTICH_STRUCT integrator
        56 |               REINTICH_COEFF_STRUCT * coeff
        64 |               REINTICH_STATE_STRUCT state
        64 |                 F32 delay
        68 |                 BOOLEAN reset_on_init
        72 |               REINTICH_INPUT_STRUCT input
        72 |                 F32 IC
        76 |                 F32 input
        80 |                 BOOLEAN run
        81 |                 BOOLEAN hold
        84 |               REINTICH_OUTPUT_STRUCT output
        84 |                 F32 output
        88 |             SATURATIONVF_STRUCT sat
        88 |               SATURATIONVF_COEFF_STRUCT * coeff
        96 |               SATURATIONVF_INPUT_STRUCT input
        96 |                 F32 input
       100 |               SATURATIONVF_OUTPUT_STRUCT output
       100 |                 F32 output
       104 |                 BOOLEAN inv
       105 |                 BOOLEAN satLo
       106 |                 BOOLEAN satHi
       112 |             BOOLEAN prev_sat_UL
       113 |             BOOLEAN prev_sat_LL
       114 |             BOOLEAN prev_sat_inv
       120 |           REINTICHS_INPUT_STRUCT input
       120 |             F32 IC
       124 |             F32 input
       128 |             BOOLEAN run
       129 |             BOOLEAN hold
       132 |           REINTICHS_OUTPUT_STRUCT output
       132 |             F32 output
       136 |             BOOLEAN sat_UL
       137 |             BOOLEAN sat_LL
       138 |             BOOLEAN inv
       144 |         F32 prop
       148 |         F32 rate
       152 |         BOOLEAN prev_run
       160 |       ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       160 |         F32 output
       164 |         BOOLEAN integ_sat_UL
       165 |         BOOLEAN integ_sat_LL
       168 |     ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       168 |       ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       176 |       ATTITUDE_CONTROLLER_INPUT_STRUCT input
       176 |         F32 target
       180 |         F32 rate_cross_axis
       184 |         F32 rate_near_axis
       188 |         F32 attitude_near_axis
       192 |         F32 ias
       196 |         F32 actuator_position_fb
       200 |         BOOLEAN reset_integrator
       208 |       ATTITUDE_CONTROLLER_STATE_STRUCT state
       208 |         REINTICHS_STRUCT reintichs
       208 |           REINTICHS_COEFF_STRUCT * coeff
       216 |           REINTICHS_STATE_STRUCT state
       216 |             REINTICH_STRUCT integrator
       216 |               REINTICH_COEFF_STRUCT * coeff
       224 |               REINTICH_STATE_STRUCT state
       224 |                 F32 delay
       228 |                 BOOLEAN reset_on_init
       232 |               REINTICH_INPUT_STRUCT input
       232 |                 F32 IC
       236 |                 F32 input
       240 |                 BOOLEAN run
       241 |                 BOOLEAN hold
       244 |               REINTICH_OUTPUT_STRUCT output
       244 |                 F32 output
       248 |             SATURATIONVF_STRUCT sat
       248 |               SATURATIONVF_COEFF_STRUCT * coeff
       256 |               SATURATIONVF_INPUT_STRUCT input
       256 |                 F32 input
       260 |               SATURATIONVF_OUTPUT_STRUCT output
       260 |                 F32 output
       264 |                 BOOLEAN inv
       265 |                 BOOLEAN satLo
       266 |                 BOOLEAN satHi
       272 |             BOOLEAN prev_sat_UL
       273 |             BOOLEAN prev_sat_LL
       274 |             BOOLEAN prev_sat_inv
       280 |           REINTICHS_INPUT_STRUCT input
       280 |             F32 IC
       284 |             F32 input
       288 |             BOOLEAN run
       289 |             BOOLEAN hold
       292 |           REINTICHS_OUTPUT_STRUCT output
       292 |             F32 output
       296 |             BOOLEAN sat_UL
       297 |             BOOLEAN sat_LL
       298 |             BOOLEAN inv
       304 |         F32 prop
       308 |         F32 rate
       312 |         BOOLEAN prev_run
       320 |       ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       320 |         F32 output
       324 |         BOOLEAN integ_sat_UL
       325 |         BOOLEAN integ_sat_LL
       328 |     G_LIMITER_STRUCT g_limiter
       328 |       G_LIMITER_COEFF_STRUCT * coeff
       336 |       G_LIMITER_STATE_STRUCT state
       336 |         RATELIMITERDYNVF_STRUCT ratelimiter
       336 |           RATELIMITERDYNVF_COEFF_STRUCT * coeff
       344 |           RATELIMITERDYNVF_STATE_STRUCT state
       344 |             F32 previous_state
       348 |           RATELIMITERDYNVF_INPUT_STRUCT input
       348 |             F32 ic
       352 |             F32 input
       356 |             F32 smax
       360 |             F32 smin
       364 |             BOOLEAN reset
       368 |           RATELIMITERDYNVF_OUTPUT_STRUCT output
       368 |             F32 output
       372 |             BOOLEAN satUL
       373 |             BOOLEAN satLL
       376 |         F32 TAS_gt_min
       380 |         BOOLEAN first_frame
       384 |       G_LIMITER_INPUT_STRUCT input
       384 |         F32 gamma
       388 |         F32 vtas
       392 |         F32 TAS_gt_min
       396 |         BOOLEAN reset
       400 |       G_LIMITER_OUTPUT_STRUCT output
       400 |         F32 gammaRL
       404 |         BOOLEAN gammaRUL
       405 |         BOOLEAN gammaRLL
       408 |     TEST_PORT_STRUCT roll_testport
       408 |       TEST_PORT_COEFF_STRUCT * coeff
       416 |       TEST_PORT_INPUT_STRUCT input
       416 |         F32 input
       420 |       TEST_PORT_OUTPUT_STRUCT output
       420 |         F32 output
       424 |     TEST_PORT_STRUCT pitch_testport
       424 |       TEST_PORT_COEFF_STRUCT * coeff
       432 |       TEST_PORT_INPUT_STRUCT input
       432 |         F32 input
       436 |       TEST_PORT_OUTPUT_STRUCT output
       436 |         F32 output
       440 |     F32 roll_rate_limiter_previous_state
       444 |     F32 roll_test_input
       448 |     F32 pitch_test_input
       452 |     BOOLEAN first_frame
       453 |     BOOLEAN adp_roll_rate_limited
       454 |     BOOLEAN adp_pitch_rate_upper_limited
       455 |     BOOLEAN adp_pitch_rate_lower_limited
       456 |     BOOLEAN prev_reset_or_UAR_mode
       464 |   CYCLIC_FEEDBACK_INPUT_STRUCT input
       464 |     F32 adp_phi_cmd
       468 |     F32 adp_theta_cmd
       472 |     F32 phi
       476 |     F32 phi_dot
       480 |     F32 theta
       484 |     F32 theta_dot
       488 |     F32 tas
       492 |     BOOLEAN reset
       493 |     BOOLEAN UAR_mode
       494 |     BOOLEAN triplex_fault
       495 |     BOOLEAN vertical_sync
       496 |     BOOLEAN lateral_sync
           | [sizeof=504, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_INPUT_STRUCT
         0 |   BOOLEAN run
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_OUTPUT_STRUCT
         0 |   BOOLEAN command_fail
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_STATE_STRUCT
         0 |   F32 [10] regfile
        40 |   U32 regfile_index
        44 |   F32 sum
        48 |   F32 average
        52 |   U16 sample_interval
        54 |   BOOLEAN do_first_frame
           | [sizeof=56, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_INPUT_STRUCT
         0 |   F32 input
         4 |   F32 input_IC
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_STRUCT
         0 |   TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
         8 |   TENTH_ORDER_AVERAGE_STATE_STRUCT state
         8 |     F32 [10] regfile
        48 |     U32 regfile_index
        52 |     F32 sum
        56 |     F32 average
        60 |     U16 sample_interval
        62 |     BOOLEAN do_first_frame
        64 |   TENTH_ORDER_AVERAGE_INPUT_STRUCT input
        64 |     F32 input
        68 |     F32 input_IC
        72 |     BOOLEAN reset
        76 |   TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
        76 |     F32 output
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_STATE_STRUCT
         0 |   F32 s1
         4 |   F32 s2
         8 |   BOOLEAN do_first_frame
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_INPUT_STRUCT
         0 |   F32 input
         4 |   F32 input_IC
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_STRUCT
         0 |   FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
         8 |   FIRSTORDERFILTER_STATE_STRUCT state
         8 |     F32 s1
        12 |     F32 s2
        16 |     BOOLEAN do_first_frame
        20 |   FIRSTORDERFILTER_INPUT_STRUCT input
        20 |     F32 input
        24 |     F32 input_IC
        28 |     BOOLEAN reset
        32 |   FIRSTORDERFILTER_OUTPUT_STRUCT output
        32 |     F32 output
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_STATE_STRUCT
         0 |   PERSISTENT1SHOT_STRUCT p1shot
         0 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |     PERSISTENT1SHOT_STATE_STRUCT state
         8 |       BOOLEAN init
        12 |       U32 iteration
        16 |       BOOLEAN prev_input
        20 |     PERSISTENT1SHOT_INPUT_STRUCT input
        20 |       BOOLEAN input
        21 |       BOOLEAN reset
        22 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   TENTH_ORDER_AVERAGE_STRUCT toa
        24 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        32 |     TENTH_ORDER_AVERAGE_STATE_STRUCT state
        32 |       F32 [10] regfile
        72 |       U32 regfile_index
        76 |       F32 sum
        80 |       F32 average
        84 |       U16 sample_interval
        86 |       BOOLEAN do_first_frame
        88 |     TENTH_ORDER_AVERAGE_INPUT_STRUCT input
        88 |       F32 input
        92 |       F32 input_IC
        96 |       BOOLEAN reset
       100 |     TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       100 |       F32 output
       104 |   FIRSTORDERFILTER_STRUCT wash_out
       104 |     FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       112 |     FIRSTORDERFILTER_STATE_STRUCT state
       112 |       F32 s1
       116 |       F32 s2
       120 |       BOOLEAN do_first_frame
       124 |     FIRSTORDERFILTER_INPUT_STRUCT input
       124 |       F32 input
       128 |       F32 input_IC
       132 |       BOOLEAN reset
       136 |     FIRSTORDERFILTER_OUTPUT_STRUCT output
       136 |       F32 output
       144 |   ROS_FLIPFLOP_STRUCT ros_ff
       144 |     ROS_FLIPFLOP_STATE_STRUCT state
       144 |       F32 s1
       148 |     ROS_FLIPFLOP_INPUT_STRUCT input
       148 |       BOOLEAN set
       149 |       BOOLEAN reset
       150 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
       150 |       BOOLEAN output
           | [sizeof=152, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_STRUCT
         0 |   MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
         8 |   MONITOR_COMMAND_INPUT_STRUCT input
         8 |     BOOLEAN run
         9 |   MONITOR_COMMAND_OUTPUT_STRUCT output
         9 |     BOOLEAN command_fail
        16 |   MONITOR_COMMAND_STATE_STRUCT state
        16 |     PERSISTENT1SHOT_STRUCT p1shot
        16 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |       PERSISTENT1SHOT_STATE_STRUCT state
        24 |         BOOLEAN init
        28 |         U32 iteration
        32 |         BOOLEAN prev_input
        36 |       PERSISTENT1SHOT_INPUT_STRUCT input
        36 |         BOOLEAN input
        37 |         BOOLEAN reset
        38 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |         BOOLEAN output
        40 |     TENTH_ORDER_AVERAGE_STRUCT toa
        40 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        48 |       TENTH_ORDER_AVERAGE_STATE_STRUCT state
        48 |         F32 [10] regfile
        88 |         U32 regfile_index
        92 |         F32 sum
        96 |         F32 average
       100 |         U16 sample_interval
       102 |         BOOLEAN do_first_frame
       104 |       TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       104 |         F32 input
       108 |         F32 input_IC
       112 |         BOOLEAN reset
       116 |       TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       116 |         F32 output
       120 |     FIRSTORDERFILTER_STRUCT wash_out
       120 |       FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       128 |       FIRSTORDERFILTER_STATE_STRUCT state
       128 |         F32 s1
       132 |         F32 s2
       136 |         BOOLEAN do_first_frame
       140 |       FIRSTORDERFILTER_INPUT_STRUCT input
       140 |         F32 input
       144 |         F32 input_IC
       148 |         BOOLEAN reset
       152 |       FIRSTORDERFILTER_OUTPUT_STRUCT output
       152 |         F32 output
       160 |     ROS_FLIPFLOP_STRUCT ros_ff
       160 |       ROS_FLIPFLOP_STATE_STRUCT state
       160 |         F32 s1
       164 |       ROS_FLIPFLOP_INPUT_STRUCT input
       164 |         BOOLEAN set
       165 |         BOOLEAN reset
       166 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
       166 |         BOOLEAN output
           | [sizeof=168, align=8]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_COEFF_STRUCT
         0 |   U32 sample_interval
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_COEFF_STRUCT
         0 |   F32 a1
         4 |   F32 b0
         8 |   F32 b1
        12 |   F32 k1
        16 |   F32 k2
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_COEFF_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
         0 |     U32 P
         4 |     BOOLEAN ic
         5 |     BOOLEAN rising_edge
         6 |     BOOLEAN falling_edge
         8 |   TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
         8 |     U32 sample_interval
        12 |   FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        12 |     F32 a1
        16 |     F32 b0
        20 |     F32 b1
        24 |     F32 k1
        28 |     F32 k2
        32 |   F32 wof_l_limit
        36 |   F32 wof_u_limit
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_COEFF_STRUCT
         0 |   F32 rate_l_limit
         4 |   F32 rate_u_limit
         8 |   F32 attitude_l_limit
        12 |   F32 attitude_u_limit
        16 |   MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
        16 |     PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        16 |       U32 P
        20 |       BOOLEAN ic
        21 |       BOOLEAN rising_edge
        22 |       BOOLEAN falling_edge
        24 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        24 |       U32 sample_interval
        28 |     FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        28 |       F32 a1
        32 |       F32 b0
        36 |       F32 b1
        40 |       F32 k1
        44 |       F32 k2
        48 |     F32 wof_l_limit
        52 |     F32 wof_u_limit
        56 |   MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
        56 |     PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        56 |       U32 P
        60 |       BOOLEAN ic
        61 |       BOOLEAN rising_edge
        62 |       BOOLEAN falling_edge
        64 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        64 |       U32 sample_interval
        68 |     FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        68 |       F32 a1
        72 |       F32 b0
        76 |       F32 b1
        80 |       F32 k1
        84 |       F32 k2
        88 |     F32 wof_l_limit
        92 |     F32 wof_u_limit
           | [sizeof=96, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_INPUT_STRUCT
         0 |   F32 rate
         4 |   F32 attitude
         8 |   BOOLEAN uar_mode
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_OUTPUT_STRUCT
         0 |   BOOLEAN rate_fail
         1 |   BOOLEAN attitude_fail
         2 |   BOOLEAN adp_command_fail
         3 |   BOOLEAN actuator_position_fail
           | [sizeof=4, align=1]

*** Dumping AST Record Layout
         0 | MONITOR_STATE_STRUCT
         0 |   MONITOR_COMMAND_STRUCT adp_cmd
         0 |     MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
         8 |     MONITOR_COMMAND_INPUT_STRUCT input
         8 |       BOOLEAN run
         9 |     MONITOR_COMMAND_OUTPUT_STRUCT output
         9 |       BOOLEAN command_fail
        16 |     MONITOR_COMMAND_STATE_STRUCT state
        16 |       PERSISTENT1SHOT_STRUCT p1shot
        16 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |         PERSISTENT1SHOT_STATE_STRUCT state
        24 |           BOOLEAN init
        28 |           U32 iteration
        32 |           BOOLEAN prev_input
        36 |         PERSISTENT1SHOT_INPUT_STRUCT input
        36 |           BOOLEAN input
        37 |           BOOLEAN reset
        38 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |           BOOLEAN output
        40 |       TENTH_ORDER_AVERAGE_STRUCT toa
        40 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        48 |         TENTH_ORDER_AVERAGE_STATE_STRUCT state
        48 |           F32 [10] regfile
        88 |           U32 regfile_index
        92 |           F32 sum
        96 |           F32 average
       100 |           U16 sample_interval
       102 |           BOOLEAN do_first_frame
       104 |         TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       104 |           F32 input
       108 |           F32 input_IC
       112 |           BOOLEAN reset
       116 |         TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       116 |           F32 output
       120 |       FIRSTORDERFILTER_STRUCT wash_out
       120 |         FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       128 |         FIRSTORDERFILTER_STATE_STRUCT state
       128 |           F32 s1
       132 |           F32 s2
       136 |           BOOLEAN do_first_frame
       140 |         FIRSTORDERFILTER_INPUT_STRUCT input
       140 |           F32 input
       144 |           F32 input_IC
       148 |           BOOLEAN reset
       152 |         FIRSTORDERFILTER_OUTPUT_STRUCT output
       152 |           F32 output
       160 |       ROS_FLIPFLOP_STRUCT ros_ff
       160 |         ROS_FLIPFLOP_STATE_STRUCT state
       160 |           F32 s1
       164 |         ROS_FLIPFLOP_INPUT_STRUCT input
       164 |           BOOLEAN set
       165 |           BOOLEAN reset
       166 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       166 |           BOOLEAN output
       168 |   MONITOR_COMMAND_STRUCT act_pos
       168 |     MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
       176 |     MONITOR_COMMAND_INPUT_STRUCT input
       176 |       BOOLEAN run
       177 |     MONITOR_COMMAND_OUTPUT_STRUCT output
       177 |       BOOLEAN command_fail
       184 |     MONITOR_COMMAND_STATE_STRUCT state
       184 |       PERSISTENT1SHOT_STRUCT p1shot
       184 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       192 |         PERSISTENT1SHOT_STATE_STRUCT state
       192 |           BOOLEAN init
       196 |           U32 iteration
       200 |           BOOLEAN prev_input
       204 |         PERSISTENT1SHOT_INPUT_STRUCT input
       204 |           BOOLEAN input
       205 |           BOOLEAN reset
       206 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
       206 |           BOOLEAN output
       208 |       TENTH_ORDER_AVERAGE_STRUCT toa
       208 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
       216 |         TENTH_ORDER_AVERAGE_STATE_STRUCT state
       216 |           F32 [10] regfile
       256 |           U32 regfile_index
       260 |           F32 sum
       264 |           F32 average
       268 |           U16 sample_interval
       270 |           BOOLEAN do_first_frame
       272 |         TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       272 |           F32 input
       276 |           F32 input_IC
       280 |           BOOLEAN reset
       284 |         TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       284 |           F32 output
       288 |       FIRSTORDERFILTER_STRUCT wash_out
       288 |         FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       296 |         FIRSTORDERFILTER_STATE_STRUCT state
       296 |           F32 s1
       300 |           F32 s2
       304 |           BOOLEAN do_first_frame
       308 |         FIRSTORDERFILTER_INPUT_STRUCT input
       308 |           F32 input
       312 |           F32 input_IC
       316 |           BOOLEAN reset
       320 |         FIRSTORDERFILTER_OUTPUT_STRUCT output
       320 |           F32 output
       328 |       ROS_FLIPFLOP_STRUCT ros_ff
       328 |         ROS_FLIPFLOP_STATE_STRUCT state
       328 |           F32 s1
       332 |         ROS_FLIPFLOP_INPUT_STRUCT input
       332 |           BOOLEAN set
       333 |           BOOLEAN reset
       334 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       334 |           BOOLEAN output
           | [sizeof=336, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_STRUCT
         0 |   MONITOR_COEFF_STRUCT * coeff_ptr
         8 |   MONITOR_INPUT_STRUCT input
         8 |     F32 rate
        12 |     F32 attitude
        16 |     BOOLEAN uar_mode
        20 |   MONITOR_OUTPUT_STRUCT output
        20 |     BOOLEAN rate_fail
        21 |     BOOLEAN attitude_fail
        22 |     BOOLEAN adp_command_fail
        23 |     BOOLEAN actuator_position_fail
        24 |   MONITOR_STATE_STRUCT state
        24 |     MONITOR_COMMAND_STRUCT adp_cmd
        24 |       MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
        32 |       MONITOR_COMMAND_INPUT_STRUCT input
        32 |         BOOLEAN run
        33 |       MONITOR_COMMAND_OUTPUT_STRUCT output
        33 |         BOOLEAN command_fail
        40 |       MONITOR_COMMAND_STATE_STRUCT state
        40 |         PERSISTENT1SHOT_STRUCT p1shot
        40 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        48 |           PERSISTENT1SHOT_STATE_STRUCT state
        48 |             BOOLEAN init
        52 |             U32 iteration
        56 |             BOOLEAN prev_input
        60 |           PERSISTENT1SHOT_INPUT_STRUCT input
        60 |             BOOLEAN input
        61 |             BOOLEAN reset
        62 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
        62 |             BOOLEAN output
        64 |         TENTH_ORDER_AVERAGE_STRUCT toa
        64 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        72 |           TENTH_ORDER_AVERAGE_STATE_STRUCT state
        72 |             F32 [10] regfile
       112 |             U32 regfile_index
       116 |             F32 sum
       120 |             F32 average
       124 |             U16 sample_interval
       126 |             BOOLEAN do_first_frame
       128 |           TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       128 |             F32 input
       132 |             F32 input_IC
       136 |             BOOLEAN reset
       140 |           TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       140 |             F32 output
       144 |         FIRSTORDERFILTER_STRUCT wash_out
       144 |           FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       152 |           FIRSTORDERFILTER_STATE_STRUCT state
       152 |             F32 s1
       156 |             F32 s2
       160 |             BOOLEAN do_first_frame
       164 |           FIRSTORDERFILTER_INPUT_STRUCT input
       164 |             F32 input
       168 |             F32 input_IC
       172 |             BOOLEAN reset
       176 |           FIRSTORDERFILTER_OUTPUT_STRUCT output
       176 |             F32 output
       184 |         ROS_FLIPFLOP_STRUCT ros_ff
       184 |           ROS_FLIPFLOP_STATE_STRUCT state
       184 |             F32 s1
       188 |           ROS_FLIPFLOP_INPUT_STRUCT input
       188 |             BOOLEAN set
       189 |             BOOLEAN reset
       190 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       190 |             BOOLEAN output
       192 |     MONITOR_COMMAND_STRUCT act_pos
       192 |       MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
       200 |       MONITOR_COMMAND_INPUT_STRUCT input
       200 |         BOOLEAN run
       201 |       MONITOR_COMMAND_OUTPUT_STRUCT output
       201 |         BOOLEAN command_fail
       208 |       MONITOR_COMMAND_STATE_STRUCT state
       208 |         PERSISTENT1SHOT_STRUCT p1shot
       208 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       216 |           PERSISTENT1SHOT_STATE_STRUCT state
       216 |             BOOLEAN init
       220 |             U32 iteration
       224 |             BOOLEAN prev_input
       228 |           PERSISTENT1SHOT_INPUT_STRUCT input
       228 |             BOOLEAN input
       229 |             BOOLEAN reset
       230 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
       230 |             BOOLEAN output
       232 |         TENTH_ORDER_AVERAGE_STRUCT toa
       232 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
       240 |           TENTH_ORDER_AVERAGE_STATE_STRUCT state
       240 |             F32 [10] regfile
       280 |             U32 regfile_index
       284 |             F32 sum
       288 |             F32 average
       292 |             U16 sample_interval
       294 |             BOOLEAN do_first_frame
       296 |           TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       296 |             F32 input
       300 |             F32 input_IC
       304 |             BOOLEAN reset
       308 |           TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       308 |             F32 output
       312 |         FIRSTORDERFILTER_STRUCT wash_out
       312 |           FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       320 |           FIRSTORDERFILTER_STATE_STRUCT state
       320 |             F32 s1
       324 |             F32 s2
       328 |             BOOLEAN do_first_frame
       332 |           FIRSTORDERFILTER_INPUT_STRUCT input
       332 |             F32 input
       336 |             F32 input_IC
       340 |             BOOLEAN reset
       344 |           FIRSTORDERFILTER_OUTPUT_STRUCT output
       344 |             F32 output
       352 |         ROS_FLIPFLOP_STRUCT ros_ff
       352 |           ROS_FLIPFLOP_STATE_STRUCT state
       352 |             F32 s1
       356 |           ROS_FLIPFLOP_INPUT_STRUCT input
       356 |             BOOLEAN set
       357 |             BOOLEAN reset
       358 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       358 |             BOOLEAN output
           | [sizeof=360, align=8]

*** Dumping AST Record Layout
         0 | ACTUATOR_FW_COEFF_STRUCT
         0 |   F32 MotorRevPerHallCount
         4 |   F32 GearboxReductionRatio
         8 |   F32 ArmCircumference
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | STICKSWITCHSTATESENSING_COEFF_STRUCT
         0 |   MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch1
         0 |     U32 debounce_threshold
         4 |     U32 sustain_threshold
         8 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
         8 |       U32 P
        12 |       BOOLEAN ic
        13 |       BOOLEAN rising_edge
        14 |       BOOLEAN falling_edge
        16 |   MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch2
        16 |     U32 debounce_threshold
        20 |     U32 sustain_threshold
        24 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        24 |       U32 P
        28 |       BOOLEAN ic
        29 |       BOOLEAN rising_edge
        30 |       BOOLEAN falling_edge
        32 |   MOMENTARY_SWITCH_COEFF_STRUCT ChangeModeSwitch
        32 |     U32 debounce_threshold
        36 |     U32 sustain_threshold
        40 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        40 |       U32 P
        44 |       BOOLEAN ic
        45 |       BOOLEAN rising_edge
        46 |       BOOLEAN falling_edge
        48 |   MOMENTARY_SWITCH_COEFF_STRUCT pciSwR_Switch
        48 |     U32 debounce_threshold
        52 |     U32 sustain_threshold
        56 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        56 |       U32 P
        60 |       BOOLEAN ic
        61 |       BOOLEAN rising_edge
        62 |       BOOLEAN falling_edge
        64 |   MOMENTARY_SWITCH_COEFF_STRUCT pciSwL_Switch
        64 |     U32 debounce_threshold
        68 |     U32 sustain_threshold
        72 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        72 |       U32 P
        76 |       BOOLEAN ic
        77 |       BOOLEAN rising_edge
        78 |       BOOLEAN falling_edge
        80 |   MOMENTARY_SWITCH_COEFF_STRUCT pciSwF_Switch
        80 |     U32 debounce_threshold
        84 |     U32 sustain_threshold
        88 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        88 |       U32 P
        92 |       BOOLEAN ic
        93 |       BOOLEAN rising_edge
        94 |       BOOLEAN falling_edge
        96 |   MOMENTARY_SWITCH_COEFF_STRUCT pciSwA_Switch
        96 |     U32 debounce_threshold
       100 |     U32 sustain_threshold
       104 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       104 |       U32 P
       108 |       BOOLEAN ic
       109 |       BOOLEAN rising_edge
       110 |       BOOLEAN falling_edge
           | [sizeof=112, align=4]

*** Dumping AST Record Layout
         0 | ENGAGE_LOGIC_COEFF_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoEngage
         0 |     U32 P
         4 |     BOOLEAN ic
         5 |     BOOLEAN rising_edge
         6 |     BOOLEAN falling_edge
         8 |   PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoDisengage
         8 |     U32 P
        12 |     BOOLEAN ic
        13 |     BOOLEAN rising_edge
        14 |     BOOLEAN falling_edge
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | MCP_ISM_COEFF_STRUCT
         0 |   ACTUATOR_FW_COEFF_STRUCT Roll_Actuator_FW
         0 |     F32 MotorRevPerHallCount
         4 |     F32 GearboxReductionRatio
         8 |     F32 ArmCircumference
        12 |   ACTUATOR_FW_COEFF_STRUCT Pitch_Actuator_FW
        12 |     F32 MotorRevPerHallCount
        16 |     F32 GearboxReductionRatio
        20 |     F32 ArmCircumference
        24 |   STICKSWITCHSTATESENSING_COEFF_STRUCT StickSwitchStateSensing
        24 |     MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch1
        24 |       U32 debounce_threshold
        28 |       U32 sustain_threshold
        32 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        32 |         U32 P
        36 |         BOOLEAN ic
        37 |         BOOLEAN rising_edge
        38 |         BOOLEAN falling_edge
        40 |     MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch2
        40 |       U32 debounce_threshold
        44 |       U32 sustain_threshold
        48 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        48 |         U32 P
        52 |         BOOLEAN ic
        53 |         BOOLEAN rising_edge
        54 |         BOOLEAN falling_edge
        56 |     MOMENTARY_SWITCH_COEFF_STRUCT ChangeModeSwitch
        56 |       U32 debounce_threshold
        60 |       U32 sustain_threshold
        64 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        64 |         U32 P
        68 |         BOOLEAN ic
        69 |         BOOLEAN rising_edge
        70 |         BOOLEAN falling_edge
        72 |     MOMENTARY_SWITCH_COEFF_STRUCT pciSwR_Switch
        72 |       U32 debounce_threshold
        76 |       U32 sustain_threshold
        80 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        80 |         U32 P
        84 |         BOOLEAN ic
        85 |         BOOLEAN rising_edge
        86 |         BOOLEAN falling_edge
        88 |     MOMENTARY_SWITCH_COEFF_STRUCT pciSwL_Switch
        88 |       U32 debounce_threshold
        92 |       U32 sustain_threshold
        96 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        96 |         U32 P
       100 |         BOOLEAN ic
       101 |         BOOLEAN rising_edge
       102 |         BOOLEAN falling_edge
       104 |     MOMENTARY_SWITCH_COEFF_STRUCT pciSwF_Switch
       104 |       U32 debounce_threshold
       108 |       U32 sustain_threshold
       112 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       112 |         U32 P
       116 |         BOOLEAN ic
       117 |         BOOLEAN rising_edge
       118 |         BOOLEAN falling_edge
       120 |     MOMENTARY_SWITCH_COEFF_STRUCT pciSwA_Switch
       120 |       U32 debounce_threshold
       124 |       U32 sustain_threshold
       128 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       128 |         U32 P
       132 |         BOOLEAN ic
       133 |         BOOLEAN rising_edge
       134 |         BOOLEAN falling_edge
       136 |   ENGAGE_LOGIC_COEFF_STRUCT EngageLogic
       136 |     PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoEngage
       136 |       U32 P
       140 |       BOOLEAN ic
       141 |       BOOLEAN rising_edge
       142 |       BOOLEAN falling_edge
       144 |     PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoDisengage
       144 |       U32 P
       148 |       BOOLEAN ic
       149 |       BOOLEAN rising_edge
       150 |       BOOLEAN falling_edge
           | [sizeof=152, align=4]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_INPUT_STRUCT
         0 |   BOOLEAN run
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_OUTPUT_STRUCT
         0 |   CYCLIC_STRUCT feedback
         0 |     F32 roll
         4 |     F32 pitch
         8 |   BOOLEAN uar_mode
         9 |   BOOLEAN run_outer_loop
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_INPUT_STRUCT
         0 |   F32 phi
         4 |   F32 theta
         8 |   F32 p_filt
        12 |   F32 q_filt
        16 |   BOOLEAN run
        17 |   BOOLEAN adp_fail
        18 |   BOOLEAN disable_ADP
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_OUTPUT_STRUCT
         0 |   BOOLEAN uar_mode
         1 |   BOOLEAN run_outer_loop
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_STATE_STRUCT
         0 |   ROS_FLIPFLOP_STRUCT uar_mode_ff
         0 |     ROS_FLIPFLOP_STATE_STRUCT state
         0 |       F32 s1
         4 |     ROS_FLIPFLOP_INPUT_STRUCT input
         4 |       BOOLEAN set
         5 |       BOOLEAN reset
         6 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
         6 |       BOOLEAN output
         8 |   ROS_FLIPFLOP_STRUCT phi_range_ff
         8 |     ROS_FLIPFLOP_STATE_STRUCT state
         8 |       F32 s1
        12 |     ROS_FLIPFLOP_INPUT_STRUCT input
        12 |       BOOLEAN set
        13 |       BOOLEAN reset
        14 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
        14 |       BOOLEAN output
        16 |   ROS_FLIPFLOP_STRUCT theta_range_ff
        16 |     ROS_FLIPFLOP_STATE_STRUCT state
        16 |       F32 s1
        20 |     ROS_FLIPFLOP_INPUT_STRUCT input
        20 |       BOOLEAN set
        21 |       BOOLEAN reset
        22 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   PERSISTENT1SHOT_STRUCT uar_hold_p1shot
        24 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        32 |     PERSISTENT1SHOT_STATE_STRUCT state
        32 |       BOOLEAN init
        36 |       U32 iteration
        40 |       BOOLEAN prev_input
        44 |     PERSISTENT1SHOT_INPUT_STRUCT input
        44 |       BOOLEAN input
        45 |       BOOLEAN reset
        46 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        46 |       BOOLEAN output
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_STRUCT
         0 |   UARMODELOGIC_COEFF_STRUCT * coeff_ptr
         8 |   UARMODELOGIC_INPUT_STRUCT input
         8 |     F32 phi
        12 |     F32 theta
        16 |     F32 p_filt
        20 |     F32 q_filt
        24 |     BOOLEAN run
        25 |     BOOLEAN adp_fail
        26 |     BOOLEAN disable_ADP
        28 |   UARMODELOGIC_OUTPUT_STRUCT output
        28 |     BOOLEAN uar_mode
        29 |     BOOLEAN run_outer_loop
        32 |   UARMODELOGIC_STATE_STRUCT state
        32 |     ROS_FLIPFLOP_STRUCT uar_mode_ff
        32 |       ROS_FLIPFLOP_STATE_STRUCT state
        32 |         F32 s1
        36 |       ROS_FLIPFLOP_INPUT_STRUCT input
        36 |         BOOLEAN set
        37 |         BOOLEAN reset
        38 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        38 |         BOOLEAN output
        40 |     ROS_FLIPFLOP_STRUCT phi_range_ff
        40 |       ROS_FLIPFLOP_STATE_STRUCT state
        40 |         F32 s1
        44 |       ROS_FLIPFLOP_INPUT_STRUCT input
        44 |         BOOLEAN set
        45 |         BOOLEAN reset
        46 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        46 |         BOOLEAN output
        48 |     ROS_FLIPFLOP_STRUCT theta_range_ff
        48 |       ROS_FLIPFLOP_STATE_STRUCT state
        48 |         F32 s1
        52 |       ROS_FLIPFLOP_INPUT_STRUCT input
        52 |         BOOLEAN set
        53 |         BOOLEAN reset
        54 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        54 |         BOOLEAN output
        56 |     PERSISTENT1SHOT_STRUCT uar_hold_p1shot
        56 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        64 |       PERSISTENT1SHOT_STATE_STRUCT state
        64 |         BOOLEAN init
        68 |         U32 iteration
        72 |         BOOLEAN prev_input
        76 |       PERSISTENT1SHOT_INPUT_STRUCT input
        76 |         BOOLEAN input
        77 |         BOOLEAN reset
        78 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        78 |         BOOLEAN output
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_STATE_STRUCT
         0 |   CYCLIC_FEEDBACK_STRUCT cyclic_feedback
         0 |     CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
         8 |     CYCLIC_FEEDBACK_STATE_STRUCT state
         8 |       ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         8 |         ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        16 |         ATTITUDE_CONTROLLER_INPUT_STRUCT input
        16 |           F32 target
        20 |           F32 rate_cross_axis
        24 |           F32 rate_near_axis
        28 |           F32 attitude_near_axis
        32 |           F32 ias
        36 |           F32 actuator_position_fb
        40 |           BOOLEAN reset_integrator
        48 |         ATTITUDE_CONTROLLER_STATE_STRUCT state
        48 |           REINTICHS_STRUCT reintichs
        48 |             REINTICHS_COEFF_STRUCT * coeff
        56 |             REINTICHS_STATE_STRUCT state
        56 |               REINTICH_STRUCT integrator
        56 |                 REINTICH_COEFF_STRUCT * coeff
        64 |                 REINTICH_STATE_STRUCT state
        64 |                   F32 delay
        68 |                   BOOLEAN reset_on_init
        72 |                 REINTICH_INPUT_STRUCT input
        72 |                   F32 IC
        76 |                   F32 input
        80 |                   BOOLEAN run
        81 |                   BOOLEAN hold
        84 |                 REINTICH_OUTPUT_STRUCT output
        84 |                   F32 output
        88 |               SATURATIONVF_STRUCT sat
        88 |                 SATURATIONVF_COEFF_STRUCT * coeff
        96 |                 SATURATIONVF_INPUT_STRUCT input
        96 |                   F32 input
       100 |                 SATURATIONVF_OUTPUT_STRUCT output
       100 |                   F32 output
       104 |                   BOOLEAN inv
       105 |                   BOOLEAN satLo
       106 |                   BOOLEAN satHi
       112 |               BOOLEAN prev_sat_UL
       113 |               BOOLEAN prev_sat_LL
       114 |               BOOLEAN prev_sat_inv
       120 |             REINTICHS_INPUT_STRUCT input
       120 |               F32 IC
       124 |               F32 input
       128 |               BOOLEAN run
       129 |               BOOLEAN hold
       132 |             REINTICHS_OUTPUT_STRUCT output
       132 |               F32 output
       136 |               BOOLEAN sat_UL
       137 |               BOOLEAN sat_LL
       138 |               BOOLEAN inv
       144 |           F32 prop
       148 |           F32 rate
       152 |           BOOLEAN prev_run
       160 |         ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       160 |           F32 output
       164 |           BOOLEAN integ_sat_UL
       165 |           BOOLEAN integ_sat_LL
       168 |       ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       168 |         ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       176 |         ATTITUDE_CONTROLLER_INPUT_STRUCT input
       176 |           F32 target
       180 |           F32 rate_cross_axis
       184 |           F32 rate_near_axis
       188 |           F32 attitude_near_axis
       192 |           F32 ias
       196 |           F32 actuator_position_fb
       200 |           BOOLEAN reset_integrator
       208 |         ATTITUDE_CONTROLLER_STATE_STRUCT state
       208 |           REINTICHS_STRUCT reintichs
       208 |             REINTICHS_COEFF_STRUCT * coeff
       216 |             REINTICHS_STATE_STRUCT state
       216 |               REINTICH_STRUCT integrator
       216 |                 REINTICH_COEFF_STRUCT * coeff
       224 |                 REINTICH_STATE_STRUCT state
       224 |                   F32 delay
       228 |                   BOOLEAN reset_on_init
       232 |                 REINTICH_INPUT_STRUCT input
       232 |                   F32 IC
       236 |                   F32 input
       240 |                   BOOLEAN run
       241 |                   BOOLEAN hold
       244 |                 REINTICH_OUTPUT_STRUCT output
       244 |                   F32 output
       248 |               SATURATIONVF_STRUCT sat
       248 |                 SATURATIONVF_COEFF_STRUCT * coeff
       256 |                 SATURATIONVF_INPUT_STRUCT input
       256 |                   F32 input
       260 |                 SATURATIONVF_OUTPUT_STRUCT output
       260 |                   F32 output
       264 |                   BOOLEAN inv
       265 |                   BOOLEAN satLo
       266 |                   BOOLEAN satHi
       272 |               BOOLEAN prev_sat_UL
       273 |               BOOLEAN prev_sat_LL
       274 |               BOOLEAN prev_sat_inv
       280 |             REINTICHS_INPUT_STRUCT input
       280 |               F32 IC
       284 |               F32 input
       288 |               BOOLEAN run
       289 |               BOOLEAN hold
       292 |             REINTICHS_OUTPUT_STRUCT output
       292 |               F32 output
       296 |               BOOLEAN sat_UL
       297 |               BOOLEAN sat_LL
       298 |               BOOLEAN inv
       304 |           F32 prop
       308 |           F32 rate
       312 |           BOOLEAN prev_run
       320 |         ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       320 |           F32 output
       324 |           BOOLEAN integ_sat_UL
       325 |           BOOLEAN integ_sat_LL
       328 |       G_LIMITER_STRUCT g_limiter
       328 |         G_LIMITER_COEFF_STRUCT * coeff
       336 |         G_LIMITER_STATE_STRUCT state
       336 |           RATELIMITERDYNVF_STRUCT ratelimiter
       336 |             RATELIMITERDYNVF_COEFF_STRUCT * coeff
       344 |             RATELIMITERDYNVF_STATE_STRUCT state
       344 |               F32 previous_state
       348 |             RATELIMITERDYNVF_INPUT_STRUCT input
       348 |               F32 ic
       352 |               F32 input
       356 |               F32 smax
       360 |               F32 smin
       364 |               BOOLEAN reset
       368 |             RATELIMITERDYNVF_OUTPUT_STRUCT output
       368 |               F32 output
       372 |               BOOLEAN satUL
       373 |               BOOLEAN satLL
       376 |           F32 TAS_gt_min
       380 |           BOOLEAN first_frame
       384 |         G_LIMITER_INPUT_STRUCT input
       384 |           F32 gamma
       388 |           F32 vtas
       392 |           F32 TAS_gt_min
       396 |           BOOLEAN reset
       400 |         G_LIMITER_OUTPUT_STRUCT output
       400 |           F32 gammaRL
       404 |           BOOLEAN gammaRUL
       405 |           BOOLEAN gammaRLL
       408 |       TEST_PORT_STRUCT roll_testport
       408 |         TEST_PORT_COEFF_STRUCT * coeff
       416 |         TEST_PORT_INPUT_STRUCT input
       416 |           F32 input
       420 |         TEST_PORT_OUTPUT_STRUCT output
       420 |           F32 output
       424 |       TEST_PORT_STRUCT pitch_testport
       424 |         TEST_PORT_COEFF_STRUCT * coeff
       432 |         TEST_PORT_INPUT_STRUCT input
       432 |           F32 input
       436 |         TEST_PORT_OUTPUT_STRUCT output
       436 |           F32 output
       440 |       F32 roll_rate_limiter_previous_state
       444 |       F32 roll_test_input
       448 |       F32 pitch_test_input
       452 |       BOOLEAN first_frame
       453 |       BOOLEAN adp_roll_rate_limited
       454 |       BOOLEAN adp_pitch_rate_upper_limited
       455 |       BOOLEAN adp_pitch_rate_lower_limited
       456 |       BOOLEAN prev_reset_or_UAR_mode
       464 |     CYCLIC_FEEDBACK_INPUT_STRUCT input
       464 |       F32 adp_phi_cmd
       468 |       F32 adp_theta_cmd
       472 |       F32 phi
       476 |       F32 phi_dot
       480 |       F32 theta
       484 |       F32 theta_dot
       488 |       F32 tas
       492 |       BOOLEAN reset
       493 |       BOOLEAN UAR_mode
       494 |       BOOLEAN triplex_fault
       495 |       BOOLEAN vertical_sync
       496 |       BOOLEAN lateral_sync
       504 |   UARMODELOGIC_STRUCT uar_mode_logic
       504 |     UARMODELOGIC_COEFF_STRUCT * coeff_ptr
       512 |     UARMODELOGIC_INPUT_STRUCT input
       512 |       F32 phi
       516 |       F32 theta
       520 |       F32 p_filt
       524 |       F32 q_filt
       528 |       BOOLEAN run
       529 |       BOOLEAN adp_fail
       530 |       BOOLEAN disable_ADP
       532 |     UARMODELOGIC_OUTPUT_STRUCT output
       532 |       BOOLEAN uar_mode
       533 |       BOOLEAN run_outer_loop
       536 |     UARMODELOGIC_STATE_STRUCT state
       536 |       ROS_FLIPFLOP_STRUCT uar_mode_ff
       536 |         ROS_FLIPFLOP_STATE_STRUCT state
       536 |           F32 s1
       540 |         ROS_FLIPFLOP_INPUT_STRUCT input
       540 |           BOOLEAN set
       541 |           BOOLEAN reset
       542 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       542 |           BOOLEAN output
       544 |       ROS_FLIPFLOP_STRUCT phi_range_ff
       544 |         ROS_FLIPFLOP_STATE_STRUCT state
       544 |           F32 s1
       548 |         ROS_FLIPFLOP_INPUT_STRUCT input
       548 |           BOOLEAN set
       549 |           BOOLEAN reset
       550 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       550 |           BOOLEAN output
       552 |       ROS_FLIPFLOP_STRUCT theta_range_ff
       552 |         ROS_FLIPFLOP_STATE_STRUCT state
       552 |           F32 s1
       556 |         ROS_FLIPFLOP_INPUT_STRUCT input
       556 |           BOOLEAN set
       557 |           BOOLEAN reset
       558 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       558 |           BOOLEAN output
       560 |       PERSISTENT1SHOT_STRUCT uar_hold_p1shot
       560 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       568 |         PERSISTENT1SHOT_STATE_STRUCT state
       568 |           BOOLEAN init
       572 |           U32 iteration
       576 |           BOOLEAN prev_input
       580 |         PERSISTENT1SHOT_INPUT_STRUCT input
       580 |           BOOLEAN input
       581 |           BOOLEAN reset
       582 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
       582 |           BOOLEAN output
           | [sizeof=584, align=8]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_STRUCT
         0 |   MCP_CONTROL_PRODUCER_COEFF_STRUCT * coeff_ptr
         8 |   MCP_CONTROL_PRODUCER_INPUT_STRUCT input
         8 |     BOOLEAN run
        12 |   MCP_CONTROL_PRODUCER_OUTPUT_STRUCT output
        12 |     CYCLIC_STRUCT feedback
        12 |       F32 roll
        16 |       F32 pitch
        20 |     BOOLEAN uar_mode
        21 |     BOOLEAN run_outer_loop
        24 |   MCP_CONTROL_PRODUCER_STATE_STRUCT state
        24 |     CYCLIC_FEEDBACK_STRUCT cyclic_feedback
        24 |       CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
        32 |       CYCLIC_FEEDBACK_STATE_STRUCT state
        32 |         ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
        32 |           ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        40 |           ATTITUDE_CONTROLLER_INPUT_STRUCT input
        40 |             F32 target
        44 |             F32 rate_cross_axis
        48 |             F32 rate_near_axis
        52 |             F32 attitude_near_axis
        56 |             F32 ias
        60 |             F32 actuator_position_fb
        64 |             BOOLEAN reset_integrator
        72 |           ATTITUDE_CONTROLLER_STATE_STRUCT state
        72 |             REINTICHS_STRUCT reintichs
        72 |               REINTICHS_COEFF_STRUCT * coeff
        80 |               REINTICHS_STATE_STRUCT state
        80 |                 REINTICH_STRUCT integrator
        80 |                   REINTICH_COEFF_STRUCT * coeff
        88 |                   REINTICH_STATE_STRUCT state
        88 |                     F32 delay
        92 |                     BOOLEAN reset_on_init
        96 |                   REINTICH_INPUT_STRUCT input
        96 |                     F32 IC
       100 |                     F32 input
       104 |                     BOOLEAN run
       105 |                     BOOLEAN hold
       108 |                   REINTICH_OUTPUT_STRUCT output
       108 |                     F32 output
       112 |                 SATURATIONVF_STRUCT sat
       112 |                   SATURATIONVF_COEFF_STRUCT * coeff
       120 |                   SATURATIONVF_INPUT_STRUCT input
       120 |                     F32 input
       124 |                   SATURATIONVF_OUTPUT_STRUCT output
       124 |                     F32 output
       128 |                     BOOLEAN inv
       129 |                     BOOLEAN satLo
       130 |                     BOOLEAN satHi
       136 |                 BOOLEAN prev_sat_UL
       137 |                 BOOLEAN prev_sat_LL
       138 |                 BOOLEAN prev_sat_inv
       144 |               REINTICHS_INPUT_STRUCT input
       144 |                 F32 IC
       148 |                 F32 input
       152 |                 BOOLEAN run
       153 |                 BOOLEAN hold
       156 |               REINTICHS_OUTPUT_STRUCT output
       156 |                 F32 output
       160 |                 BOOLEAN sat_UL
       161 |                 BOOLEAN sat_LL
       162 |                 BOOLEAN inv
       168 |             F32 prop
       172 |             F32 rate
       176 |             BOOLEAN prev_run
       184 |           ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       184 |             F32 output
       188 |             BOOLEAN integ_sat_UL
       189 |             BOOLEAN integ_sat_LL
       192 |         ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       192 |           ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       200 |           ATTITUDE_CONTROLLER_INPUT_STRUCT input
       200 |             F32 target
       204 |             F32 rate_cross_axis
       208 |             F32 rate_near_axis
       212 |             F32 attitude_near_axis
       216 |             F32 ias
       220 |             F32 actuator_position_fb
       224 |             BOOLEAN reset_integrator
       232 |           ATTITUDE_CONTROLLER_STATE_STRUCT state
       232 |             REINTICHS_STRUCT reintichs
       232 |               REINTICHS_COEFF_STRUCT * coeff
       240 |               REINTICHS_STATE_STRUCT state
       240 |                 REINTICH_STRUCT integrator
       240 |                   REINTICH_COEFF_STRUCT * coeff
       248 |                   REINTICH_STATE_STRUCT state
       248 |                     F32 delay
       252 |                     BOOLEAN reset_on_init
       256 |                   REINTICH_INPUT_STRUCT input
       256 |                     F32 IC
       260 |                     F32 input
       264 |                     BOOLEAN run
       265 |                     BOOLEAN hold
       268 |                   REINTICH_OUTPUT_STRUCT output
       268 |                     F32 output
       272 |                 SATURATIONVF_STRUCT sat
       272 |                   SATURATIONVF_COEFF_STRUCT * coeff
       280 |                   SATURATIONVF_INPUT_STRUCT input
       280 |                     F32 input
       284 |                   SATURATIONVF_OUTPUT_STRUCT output
       284 |                     F32 output
       288 |                     BOOLEAN inv
       289 |                     BOOLEAN satLo
       290 |                     BOOLEAN satHi
       296 |                 BOOLEAN prev_sat_UL
       297 |                 BOOLEAN prev_sat_LL
       298 |                 BOOLEAN prev_sat_inv
       304 |               REINTICHS_INPUT_STRUCT input
       304 |                 F32 IC
       308 |                 F32 input
       312 |                 BOOLEAN run
       313 |                 BOOLEAN hold
       316 |               REINTICHS_OUTPUT_STRUCT output
       316 |                 F32 output
       320 |                 BOOLEAN sat_UL
       321 |                 BOOLEAN sat_LL
       322 |                 BOOLEAN inv
       328 |             F32 prop
       332 |             F32 rate
       336 |             BOOLEAN prev_run
       344 |           ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       344 |             F32 output
       348 |             BOOLEAN integ_sat_UL
       349 |             BOOLEAN integ_sat_LL
       352 |         G_LIMITER_STRUCT g_limiter
       352 |           G_LIMITER_COEFF_STRUCT * coeff
       360 |           G_LIMITER_STATE_STRUCT state
       360 |             RATELIMITERDYNVF_STRUCT ratelimiter
       360 |               RATELIMITERDYNVF_COEFF_STRUCT * coeff
       368 |               RATELIMITERDYNVF_STATE_STRUCT state
       368 |                 F32 previous_state
       372 |               RATELIMITERDYNVF_INPUT_STRUCT input
       372 |                 F32 ic
       376 |                 F32 input
       380 |                 F32 smax
       384 |                 F32 smin
       388 |                 BOOLEAN reset
       392 |               RATELIMITERDYNVF_OUTPUT_STRUCT output
       392 |                 F32 output
       396 |                 BOOLEAN satUL
       397 |                 BOOLEAN satLL
       400 |             F32 TAS_gt_min
       404 |             BOOLEAN first_frame
       408 |           G_LIMITER_INPUT_STRUCT input
       408 |             F32 gamma
       412 |             F32 vtas
       416 |             F32 TAS_gt_min
       420 |             BOOLEAN reset
       424 |           G_LIMITER_OUTPUT_STRUCT output
       424 |             F32 gammaRL
       428 |             BOOLEAN gammaRUL
       429 |             BOOLEAN gammaRLL
       432 |         TEST_PORT_STRUCT roll_testport
       432 |           TEST_PORT_COEFF_STRUCT * coeff
       440 |           TEST_PORT_INPUT_STRUCT input
       440 |             F32 input
       444 |           TEST_PORT_OUTPUT_STRUCT output
       444 |             F32 output
       448 |         TEST_PORT_STRUCT pitch_testport
       448 |           TEST_PORT_COEFF_STRUCT * coeff
       456 |           TEST_PORT_INPUT_STRUCT input
       456 |             F32 input
       460 |           TEST_PORT_OUTPUT_STRUCT output
       460 |             F32 output
       464 |         F32 roll_rate_limiter_previous_state
       468 |         F32 roll_test_input
       472 |         F32 pitch_test_input
       476 |         BOOLEAN first_frame
       477 |         BOOLEAN adp_roll_rate_limited
       478 |         BOOLEAN adp_pitch_rate_upper_limited
       479 |         BOOLEAN adp_pitch_rate_lower_limited
       480 |         BOOLEAN prev_reset_or_UAR_mode
       488 |       CYCLIC_FEEDBACK_INPUT_STRUCT input
       488 |         F32 adp_phi_cmd
       492 |         F32 adp_theta_cmd
       496 |         F32 phi
       500 |         F32 phi_dot
       504 |         F32 theta
       508 |         F32 theta_dot
       512 |         F32 tas
       516 |         BOOLEAN reset
       517 |         BOOLEAN UAR_mode
       518 |         BOOLEAN triplex_fault
       519 |         BOOLEAN vertical_sync
       520 |         BOOLEAN lateral_sync
       528 |     UARMODELOGIC_STRUCT uar_mode_logic
       528 |       UARMODELOGIC_COEFF_STRUCT * coeff_ptr
       536 |       UARMODELOGIC_INPUT_STRUCT input
       536 |         F32 phi
       540 |         F32 theta
       544 |         F32 p_filt
       548 |         F32 q_filt
       552 |         BOOLEAN run
       553 |         BOOLEAN adp_fail
       554 |         BOOLEAN disable_ADP
       556 |       UARMODELOGIC_OUTPUT_STRUCT output
       556 |         BOOLEAN uar_mode
       557 |         BOOLEAN run_outer_loop
       560 |       UARMODELOGIC_STATE_STRUCT state
       560 |         ROS_FLIPFLOP_STRUCT uar_mode_ff
       560 |           ROS_FLIPFLOP_STATE_STRUCT state
       560 |             F32 s1
       564 |           ROS_FLIPFLOP_INPUT_STRUCT input
       564 |             BOOLEAN set
       565 |             BOOLEAN reset
       566 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       566 |             BOOLEAN output
       568 |         ROS_FLIPFLOP_STRUCT phi_range_ff
       568 |           ROS_FLIPFLOP_STATE_STRUCT state
       568 |             F32 s1
       572 |           ROS_FLIPFLOP_INPUT_STRUCT input
       572 |             BOOLEAN set
       573 |             BOOLEAN reset
       574 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       574 |             BOOLEAN output
       576 |         ROS_FLIPFLOP_STRUCT theta_range_ff
       576 |           ROS_FLIPFLOP_STATE_STRUCT state
       576 |             F32 s1
       580 |           ROS_FLIPFLOP_INPUT_STRUCT input
       580 |             BOOLEAN set
       581 |             BOOLEAN reset
       582 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       582 |             BOOLEAN output
       584 |         PERSISTENT1SHOT_STRUCT uar_hold_p1shot
       584 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       592 |           PERSISTENT1SHOT_STATE_STRUCT state
       592 |             BOOLEAN init
       596 |             U32 iteration
       600 |             BOOLEAN prev_input
       604 |           PERSISTENT1SHOT_INPUT_STRUCT input
       604 |             BOOLEAN input
       605 |             BOOLEAN reset
       606 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
       606 |             BOOLEAN output
           | [sizeof=608, align=8]

*** Dumping AST Record Layout
         0 | struct _I2C_COMMON_STRUCT
         0 |   I2C_ASYNC_STATUS async_status
         4 |   BOOLEAN initialized
         8 |   U32 data_valid_frame
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PIN_PWM_HW_STRUCT
         0 |   PIN_PERIPH_HW_STRUCT GPIO
         0 |     U32 port
         4 |     U8 pin
         8 |     U32 pin_config
        12 |   U32 pwm_out_bits
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | BLDC_COMMUTATION_HW_STRUCT
         0 |   PIN_GPIO_HW_STRUCT AH
         0 |     U32 port
         4 |     U8 pin
         8 |   PIN_GPIO_HW_STRUCT AL
         8 |     U32 port
        12 |     U8 pin
        16 |   PIN_GPIO_HW_STRUCT BH
        16 |     U32 port
        20 |     U8 pin
        24 |   PIN_GPIO_HW_STRUCT BL
        24 |     U32 port
        28 |     U8 pin
        32 |   PIN_GPIO_HW_STRUCT CH
        32 |     U32 port
        36 |     U8 pin
        40 |   PIN_GPIO_HW_STRUCT CL
        40 |     U32 port
        44 |     U8 pin
           | [sizeof=48, align=4]

*** Dumping AST Record Layout
         0 | BLDC_FEEDBACK_HW_STRUCT
         0 |   PIN_GPIO_HW_STRUCT A
         0 |     U32 port
         4 |     U8 pin
         8 |   PIN_GPIO_HW_STRUCT B
         8 |     U32 port
        12 |     U8 pin
        16 |   PIN_GPIO_HW_STRUCT C
        16 |     U32 port
        20 |     U8 pin
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | BLDC_POWER_HW_COEFF_STRUCT
         0 |   U16 rise
         2 |   U16 fall
         4 |   U32 period
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SIGNAL_ADC_COEFF_STRUCT
         0 |   F32 gain
         4 |   F32 bias
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | BLDC_MODULE_COEFF_STRUCT
         0 |   BLDC_POWER_HW_COEFF_STRUCT power
         0 |     U16 rise
         2 |     U16 fall
         4 |     U32 period
         8 |   SIGNAL_ADC_COEFF_STRUCT coil_current
         8 |     F32 gain
        12 |     F32 bias
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | BLDC_LOOP_COEFF_STRUCT
         0 |   BLDC_MODULE_COEFF_STRUCT BLDC_module
         0 |     BLDC_POWER_HW_COEFF_STRUCT power
         0 |       U16 rise
         2 |       U16 fall
         4 |       U32 period
         8 |     SIGNAL_ADC_COEFF_STRUCT coil_current
         8 |       F32 gain
        12 |       F32 bias
        16 |   U32 feedback_ISR_counter_threshold
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | BLDC_POWER_HW_STRUCT
         0 |   PIN_PWM_HW_STRUCT pin_high
         0 |     PIN_PERIPH_HW_STRUCT GPIO
         0 |       U32 port
         4 |       U8 pin
         8 |       U32 pin_config
        12 |     U32 pwm_out_bits
        16 |   PIN_PWM_HW_STRUCT pin_low
        16 |     PIN_PERIPH_HW_STRUCT GPIO
        16 |       U32 port
        20 |       U8 pin
        24 |       U32 pin_config
        28 |     U32 pwm_out_bits
        32 |   SIGNALS_PWM_UNIT_ENUM logical_unit
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct BLDC_MODULE_HW_STRUCT::(anonymous at ..\..\..\MCP\Header/BLDC_Module_HW.h:254:5)
         0 |   BLDC_COMMUTATION_HW_STRUCT commutation
         0 |     PIN_GPIO_HW_STRUCT AH
         0 |       U32 port
         4 |       U8 pin
         8 |     PIN_GPIO_HW_STRUCT AL
         8 |       U32 port
        12 |       U8 pin
        16 |     PIN_GPIO_HW_STRUCT BH
        16 |       U32 port
        20 |       U8 pin
        24 |     PIN_GPIO_HW_STRUCT BL
        24 |       U32 port
        28 |       U8 pin
        32 |     PIN_GPIO_HW_STRUCT CH
        32 |       U32 port
        36 |       U8 pin
        40 |     PIN_GPIO_HW_STRUCT CL
        40 |       U32 port
        44 |       U8 pin
        48 |   BLDC_POWER_HW_STRUCT power
        48 |     PIN_PWM_HW_STRUCT pin_high
        48 |       PIN_PERIPH_HW_STRUCT GPIO
        48 |         U32 port
        52 |         U8 pin
        56 |         U32 pin_config
        60 |       U32 pwm_out_bits
        64 |     PIN_PWM_HW_STRUCT pin_low
        64 |       PIN_PERIPH_HW_STRUCT GPIO
        64 |         U32 port
        68 |         U8 pin
        72 |         U32 pin_config
        76 |       U32 pwm_out_bits
        80 |     SIGNALS_PWM_UNIT_ENUM logical_unit
           | [sizeof=84, align=4]

*** Dumping AST Record Layout
         0 | BLDC_MODULE_HW_STRUCT
         0 |   BLDC_FEEDBACK_HW_STRUCT feedback
         0 |     PIN_GPIO_HW_STRUCT A
         0 |       U32 port
         4 |       U8 pin
         8 |     PIN_GPIO_HW_STRUCT B
         8 |       U32 port
        12 |       U8 pin
        16 |     PIN_GPIO_HW_STRUCT C
        16 |       U32 port
        20 |       U8 pin
        24 |   struct BLDC_MODULE_HW_STRUCT::(anonymous at ..\..\..\MCP\Header/BLDC_Module_HW.h:254:5) control
        24 |     BLDC_COMMUTATION_HW_STRUCT commutation
        24 |       PIN_GPIO_HW_STRUCT AH
        24 |         U32 port
        28 |         U8 pin
        32 |       PIN_GPIO_HW_STRUCT AL
        32 |         U32 port
        36 |         U8 pin
        40 |       PIN_GPIO_HW_STRUCT BH
        40 |         U32 port
        44 |         U8 pin
        48 |       PIN_GPIO_HW_STRUCT BL
        48 |         U32 port
        52 |         U8 pin
        56 |       PIN_GPIO_HW_STRUCT CH
        56 |         U32 port
        60 |         U8 pin
        64 |       PIN_GPIO_HW_STRUCT CL
        64 |         U32 port
        68 |         U8 pin
        72 |     BLDC_POWER_HW_STRUCT power
        72 |       PIN_PWM_HW_STRUCT pin_high
        72 |         PIN_PERIPH_HW_STRUCT GPIO
        72 |           U32 port
        76 |           U8 pin
        80 |           U32 pin_config
        84 |         U32 pwm_out_bits
        88 |       PIN_PWM_HW_STRUCT pin_low
        88 |         PIN_PERIPH_HW_STRUCT GPIO
        88 |           U32 port
        92 |           U8 pin
        96 |           U32 pin_config
       100 |         U32 pwm_out_bits
       104 |       SIGNALS_PWM_UNIT_ENUM logical_unit
       108 |   int coil_current_channel
       112 |   PIN_GPIO_HW_STRUCT enable_vote
       112 |     U32 port
       116 |     U8 pin
       120 |   const U8 * name_ptr
       128 |   U32 mID
           | [sizeof=136, align=8]

*** Dumping AST Record Layout
         0 | ACTUATOR_MOTOR_COEFF_STRUCT
         0 |   BLDC_LOOP_COEFF_STRUCT BLDC_loop
         0 |     BLDC_MODULE_COEFF_STRUCT BLDC_module
         0 |       BLDC_POWER_HW_COEFF_STRUCT power
         0 |         U16 rise
         2 |         U16 fall
         4 |         U32 period
         8 |       SIGNAL_ADC_COEFF_STRUCT coil_current
         8 |         F32 gain
        12 |         F32 bias
        16 |     U32 feedback_ISR_counter_threshold
        20 |   F32 feedback_counts_to_angle_gain
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | BLDC_LOOP_STATE_STRUCT
         0 |   S32 feedback_integral
         4 |   U32 feedback_ISR_counter
         8 |   U32 feedback_errors
        12 |   BLDC_FEEDBACK_STATE_ENUM feedback_state_prev
        16 |   BLDC_LOOP_MODE_ENUM mode
        20 |   BOOLEAN run_clockwise
        21 |   BOOLEAN feedback_ISR_fault
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | BLDC_LOOP_STRUCT
         0 |   const BLDC_LOOP_COEFF_STRUCT * coeff_ptr
         8 |   const BLDC_MODULE_HW_STRUCT * hardware_ptr
        16 |   BLDC_LOOP_STATE_STRUCT state
        16 |     S32 feedback_integral
        20 |     U32 feedback_ISR_counter
        24 |     U32 feedback_errors
        28 |     BLDC_FEEDBACK_STATE_ENUM feedback_state_prev
        32 |     BLDC_LOOP_MODE_ENUM mode
        36 |     BOOLEAN run_clockwise
        37 |     BOOLEAN feedback_ISR_fault
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | SATURATIONDYNVF_COEFF_STRUCT
         0 |   F32 epsilon
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SERVO_LOOP_COEFF_STRUCT
         0 |   TEST_PORT_COEFF_STRUCT testport_case1
         0 |     F32 gain
         4 |     F32 bias
         8 |   SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
         8 |     F32 epsilon
        12 |   REINTICHS_COEFF_STRUCT ReInt_ICHS
        12 |     REINTICH_COEFF_STRUCT integrator_coeff
        12 |       F32 K_Ts
        16 |     SATURATIONVF_COEFF_STRUCT sat_coeff
        16 |       F32 epsilon
        20 |       F32 upper_sat_limit
        24 |       F32 lower_sat_limit
        28 |     F32 K_Ts
        32 |     F32 response_bias
        36 |   F32 k_ts
        40 |   F32 k
        44 |   F32 k2
        48 |   F32 k3
        52 |   F32 k4
        56 |   F32 max_current
        60 |   F32 rate_limiter_upper_limit
        64 |   F32 rate_limiter_lower_limit
           | [sizeof=68, align=4]

*** Dumping AST Record Layout
         0 | ACTUATOR_COEFF_STRUCT
         0 |   ACTUATOR_MOTOR_COEFF_STRUCT [2] motors
        48 |   SERVO_LOOP_COEFF_STRUCT servo_loop
        48 |     TEST_PORT_COEFF_STRUCT testport_case1
        48 |       F32 gain
        52 |       F32 bias
        56 |     SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
        56 |       F32 epsilon
        60 |     REINTICHS_COEFF_STRUCT ReInt_ICHS
        60 |       REINTICH_COEFF_STRUCT integrator_coeff
        60 |         F32 K_Ts
        64 |       SATURATIONVF_COEFF_STRUCT sat_coeff
        64 |         F32 epsilon
        68 |         F32 upper_sat_limit
        72 |         F32 lower_sat_limit
        76 |       F32 K_Ts
        80 |       F32 response_bias
        84 |     F32 k_ts
        88 |     F32 k
        92 |     F32 k2
        96 |     F32 k3
       100 |     F32 k4
       104 |     F32 max_current
       108 |     F32 rate_limiter_upper_limit
       112 |     F32 rate_limiter_lower_limit
       116 |   ACTUATOR_DIRECTION_ENUM direction
           | [sizeof=120, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\MCP\Header/Actuator_Mgmt.h:187:9)
         0 |   U32 feedback_errors
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\MCP\Header/Actuator_Mgmt.h:185:5)
         0 |   struct (anonymous struct at ..\..\..\MCP\Header/Actuator_Mgmt.h:187:9) [2] motor
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | ANNUNCIATORS_PATTERN_COEFF_STRUCT
         0 |   F32 on_duration_seconds
         4 |   F32 off_duration_seconds
         8 |   U32 num_repeats
        12 |   BOOLEAN end_state
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | VALID_VECTOR3_STRUCT
         0 |   BOOLEAN valid
         4 |   VECTOR3 sample
         4 |     F32 X
         8 |     F32 Y
        12 |     F32 Z
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | SCALAR_KALMAN_FILTER_COEFF_STRUCT
         0 |   F32 kalman_gain
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SCALAR_KALMAN_FILTER_INPUT_STRUCT
         0 |   F32 input
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SCALAR_KALMAN_FILTER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SCALAR_KALMAN_FILTER_STRUCT
         0 |   SCALAR_KALMAN_FILTER_COEFF_STRUCT * coeff_ptr
         8 |   SCALAR_KALMAN_FILTER_INPUT_STRUCT input
         8 |     F32 input
        12 |   SCALAR_KALMAN_FILTER_OUTPUT_STRUCT output
        12 |     F32 output
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | SINGLE_AXIS_FILTERS_STATE_STRUCT
         0 |   SCALAR_KALMAN_FILTER_STRUCT kalman_filter
         0 |     SCALAR_KALMAN_FILTER_COEFF_STRUCT * coeff_ptr
         8 |     SCALAR_KALMAN_FILTER_INPUT_STRUCT input
         8 |       F32 input
        12 |     SCALAR_KALMAN_FILTER_OUTPUT_STRUCT output
        12 |       F32 output
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | SINGLE_AXIS_FILTERS_COEFF_STRUCT
         0 |   SCALAR_KALMAN_FILTER_COEFF_STRUCT kalman_filter_coeffs
         0 |     F32 kalman_gain
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SINGLE_AXIS_FILTERS_STRUCT
         0 |   SINGLE_AXIS_FILTERS_STATE_STRUCT state
         0 |     SCALAR_KALMAN_FILTER_STRUCT kalman_filter
         0 |       SCALAR_KALMAN_FILTER_COEFF_STRUCT * coeff_ptr
         8 |       SCALAR_KALMAN_FILTER_INPUT_STRUCT input
         8 |         F32 input
        12 |       SCALAR_KALMAN_FILTER_OUTPUT_STRUCT output
        12 |         F32 output
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | MATRIX3X3
         0 |   VECTOR3 row1
         0 |     F32 X
         4 |     F32 Y
         8 |     F32 Z
        12 |   VECTOR3 row2
        12 |     F32 X
        16 |     F32 Y
        20 |     F32 Z
        24 |   VECTOR3 row3
        24 |     F32 X
        28 |     F32 Y
        32 |     F32 Z
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | THREE_AXIS_SENSOR_CALIBRATION_STRUCT
         0 |   MATRIX3X3 sensor_counts_to_body_axes
         0 |     VECTOR3 row1
         0 |       F32 X
         4 |       F32 Y
         8 |       F32 Z
        12 |     VECTOR3 row2
        12 |       F32 X
        16 |       F32 Y
        20 |       F32 Z
        24 |     VECTOR3 row3
        24 |       F32 X
        28 |       F32 Y
        32 |       F32 Z
        36 |   VECTOR3 bias
        36 |     F32 X
        40 |     F32 Y
        44 |     F32 Z
           | [sizeof=48, align=4]

*** Dumping AST Record Layout
         0 | SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT
         0 |   F32 scale
         4 |   F32 bias
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | COMP_FILTER_SEGMENT_COEFF_STRUCT
         0 |   F32 k
         4 |   F32 k_n
         8 |   REINTICH_COEFF_STRUCT integrator_coeff
         8 |     F32 K_Ts
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | THREE_AXIS_FILTERS_COEFF_STRUCT
         0 |   SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | VALID_F32_STRUCT
         0 |   BOOLEAN valid
         4 |   F32 sample
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_DATA_VECTOR3_STRUCT
         0 |   BOOLEAN valid
         1 |   U8 num_samples
         4 |   VECTOR3 [32] samples
       388 |   VECTOR3 average
       388 |     F32 X
       392 |     F32 Y
       396 |     F32 Z
           | [sizeof=400, align=4]

*** Dumping AST Record Layout
         0 | SINGLE_AXIS_SENSOR_STRUCT
         0 |   SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT * calibration
         8 |   SENSOR_SAMPLE_RATE_STRUCT * sample_rate
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | COMP_FILTER_SEGMENT_STATE_STRUCT
         0 |   REINTICH_STRUCT integrator
         0 |     REINTICH_COEFF_STRUCT * coeff
         8 |     REINTICH_STATE_STRUCT state
         8 |       F32 delay
        12 |       BOOLEAN reset_on_init
        16 |     REINTICH_INPUT_STRUCT input
        16 |       F32 IC
        20 |       F32 input
        24 |       BOOLEAN run
        25 |       BOOLEAN hold
        28 |     REINTICH_OUTPUT_STRUCT output
        28 |       F32 output
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | COMP_FILTER_SEGMENT_INPUT_STRUCT
         0 |   F32 input
         4 |   F32 input_nth_order
         8 |   F32 input_nth_order_dot
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | COMP_FILTER_SEGMENT_STRUCT
         0 |   COMP_FILTER_SEGMENT_COEFF_STRUCT * coeff_ptr
         8 |   COMP_FILTER_SEGMENT_STATE_STRUCT state
         8 |     REINTICH_STRUCT integrator
         8 |       REINTICH_COEFF_STRUCT * coeff
        16 |       REINTICH_STATE_STRUCT state
        16 |         F32 delay
        20 |         BOOLEAN reset_on_init
        24 |       REINTICH_INPUT_STRUCT input
        24 |         F32 IC
        28 |         F32 input
        32 |         BOOLEAN run
        33 |         BOOLEAN hold
        36 |       REINTICH_OUTPUT_STRUCT output
        36 |         F32 output
        40 |   COMP_FILTER_SEGMENT_INPUT_STRUCT input
        40 |     F32 input
        44 |     F32 input_nth_order
        48 |     F32 input_nth_order_dot
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | THREE_AXIS_SENSOR_STRUCT
         0 |   THREE_AXIS_SENSOR_CALIBRATION_STRUCT * calibration
         8 |   SENSOR_SAMPLE_RATE_STRUCT * sample_rate
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | SENSOR_MGMT_MFG_CALIBRATION_STRUCT
         0 |   THREE_AXIS_SENSOR_CALIBRATION_STRUCT gyro_calibration
         0 |     MATRIX3X3 sensor_counts_to_body_axes
         0 |       VECTOR3 row1
         0 |         F32 X
         4 |         F32 Y
         8 |         F32 Z
        12 |       VECTOR3 row2
        12 |         F32 X
        16 |         F32 Y
        20 |         F32 Z
        24 |       VECTOR3 row3
        24 |         F32 X
        28 |         F32 Y
        32 |         F32 Z
        36 |     VECTOR3 bias
        36 |       F32 X
        40 |       F32 Y
        44 |       F32 Z
        48 |   THREE_AXIS_SENSOR_CALIBRATION_STRUCT accel_calibration
        48 |     MATRIX3X3 sensor_counts_to_body_axes
        48 |       VECTOR3 row1
        48 |         F32 X
        52 |         F32 Y
        56 |         F32 Z
        60 |       VECTOR3 row2
        60 |         F32 X
        64 |         F32 Y
        68 |         F32 Z
        72 |       VECTOR3 row3
        72 |         F32 X
        76 |         F32 Y
        80 |         F32 Z
        84 |     VECTOR3 bias
        84 |       F32 X
        88 |       F32 Y
        92 |       F32 Z
           | [sizeof=96, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_MGMT_INST_CALIBRATION_STRUCT
         0 |   THREE_AXIS_SENSOR_CALIBRATION_STRUCT [3] mag_calibration
       144 |   THREE_AXIS_SENSOR_CALIBRATION_STRUCT remote_accel_calibration_orient
       144 |     MATRIX3X3 sensor_counts_to_body_axes
       144 |       VECTOR3 row1
       144 |         F32 X
       148 |         F32 Y
       152 |         F32 Z
       156 |       VECTOR3 row2
       156 |         F32 X
       160 |         F32 Y
       164 |         F32 Z
       168 |       VECTOR3 row3
       168 |         F32 X
       172 |         F32 Y
       176 |         F32 Z
       180 |     VECTOR3 bias
       180 |       F32 X
       184 |       F32 Y
       188 |       F32 Z
       192 |   THREE_AXIS_SENSOR_CALIBRATION_STRUCT remote_accel_calibration_correct
       192 |     MATRIX3X3 sensor_counts_to_body_axes
       192 |       VECTOR3 row1
       192 |         F32 X
       196 |         F32 Y
       200 |         F32 Z
       204 |       VECTOR3 row2
       204 |         F32 X
       208 |         F32 Y
       212 |         F32 Z
       216 |       VECTOR3 row3
       216 |         F32 X
       220 |         F32 Y
       224 |         F32 Z
       228 |     VECTOR3 bias
       228 |       F32 X
       232 |       F32 Y
       236 |       F32 Z
       240 |   SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT [2] differential_pressure_calibration
       256 |   SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT [2] static_pressure_calibration
           | [sizeof=272, align=4]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_COEFF_STRUCT
         0 |   F32 phi_upper_limit
         4 |   F32 phi_lower_limit
         8 |   F32 theta_upper_limit
        12 |   F32 theta_lower_limit
        16 |   F32 p_filt_upper_limit
        20 |   F32 p_filt_lower_limit
        24 |   F32 q_filt_upper_limit
        28 |   F32 q_filt_lower_limit
        32 |   PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
        32 |     U32 P
        36 |     BOOLEAN ic
        37 |     BOOLEAN rising_edge
        38 |     BOOLEAN falling_edge
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_COEFF_STRUCT
         0 |   CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
         0 |     F32 rate_limiter_lower_limit
         4 |     F32 rate_limiter_upper_limit
         8 |     G_LIMITER_COEFF_STRUCT g_limiter
         8 |       RATELIMITERDYNVF_COEFF_STRUCT ratelimiterdynvf
         8 |         F32 ts
        12 |       F32 g_limit
        16 |       F32 max_rate_limit
        20 |     ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |       LINTERP_STRUCT k_attitude_to_ang_accel
        20 |         U8 n_regions
        24 |         LINTERP_REGION_STRUCT [20] regions
       264 |       LINTERP_STRUCT k_rate_to_ang_accel
       264 |         U8 n_regions
       268 |         LINTERP_REGION_STRUCT [20] regions
       508 |       F32 k_attitude_to_ang_accel_integral
       512 |       F32 k_rate_to_ang_accel_cross
       516 |       REINTICHS_COEFF_STRUCT reintichs
       516 |         REINTICH_COEFF_STRUCT integrator_coeff
       516 |           F32 K_Ts
       520 |         SATURATIONVF_COEFF_STRUCT sat_coeff
       520 |           F32 epsilon
       524 |           F32 upper_sat_limit
       528 |           F32 lower_sat_limit
       532 |         F32 K_Ts
       536 |         F32 response_bias
       540 |     ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       540 |       LINTERP_STRUCT k_attitude_to_ang_accel
       540 |         U8 n_regions
       544 |         LINTERP_REGION_STRUCT [20] regions
       784 |       LINTERP_STRUCT k_rate_to_ang_accel
       784 |         U8 n_regions
       788 |         LINTERP_REGION_STRUCT [20] regions
      1028 |       F32 k_attitude_to_ang_accel_integral
      1032 |       F32 k_rate_to_ang_accel_cross
      1036 |       REINTICHS_COEFF_STRUCT reintichs
      1036 |         REINTICH_COEFF_STRUCT integrator_coeff
      1036 |           F32 K_Ts
      1040 |         SATURATIONVF_COEFF_STRUCT sat_coeff
      1040 |           F32 epsilon
      1044 |           F32 upper_sat_limit
      1048 |           F32 lower_sat_limit
      1052 |         F32 K_Ts
      1056 |         F32 response_bias
      1060 |     TEST_PORT_COEFF_STRUCT roll_testport
      1060 |       F32 gain
      1064 |       F32 bias
      1068 |     TEST_PORT_COEFF_STRUCT pitch_testport
      1068 |       F32 gain
      1072 |       F32 bias
      1076 |   UARMODELOGIC_COEFF_STRUCT uar_mode_logic
      1076 |     F32 phi_upper_limit
      1080 |     F32 phi_lower_limit
      1084 |     F32 theta_upper_limit
      1088 |     F32 theta_lower_limit
      1092 |     F32 p_filt_upper_limit
      1096 |     F32 p_filt_lower_limit
      1100 |     F32 q_filt_upper_limit
      1104 |     F32 q_filt_lower_limit
      1108 |     PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
      1108 |       U32 P
      1112 |       BOOLEAN ic
      1113 |       BOOLEAN rising_edge
      1114 |       BOOLEAN falling_edge
           | [sizeof=1116, align=4]

*** Dumping AST Record Layout
         0 | INNER_LOOP_MONITORS_COEFF_STRUCT
         0 |   MONITOR_COEFF_STRUCT roll_coeff
         0 |     F32 rate_l_limit
         4 |     F32 rate_u_limit
         8 |     F32 attitude_l_limit
        12 |     F32 attitude_u_limit
        16 |     MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
        16 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        16 |         U32 P
        20 |         BOOLEAN ic
        21 |         BOOLEAN rising_edge
        22 |         BOOLEAN falling_edge
        24 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        24 |         U32 sample_interval
        28 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        28 |         F32 a1
        32 |         F32 b0
        36 |         F32 b1
        40 |         F32 k1
        44 |         F32 k2
        48 |       F32 wof_l_limit
        52 |       F32 wof_u_limit
        56 |     MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
        56 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        56 |         U32 P
        60 |         BOOLEAN ic
        61 |         BOOLEAN rising_edge
        62 |         BOOLEAN falling_edge
        64 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        64 |         U32 sample_interval
        68 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        68 |         F32 a1
        72 |         F32 b0
        76 |         F32 b1
        80 |         F32 k1
        84 |         F32 k2
        88 |       F32 wof_l_limit
        92 |       F32 wof_u_limit
        96 |   MONITOR_COEFF_STRUCT pitch_coeff
        96 |     F32 rate_l_limit
       100 |     F32 rate_u_limit
       104 |     F32 attitude_l_limit
       108 |     F32 attitude_u_limit
       112 |     MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
       112 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       112 |         U32 P
       116 |         BOOLEAN ic
       117 |         BOOLEAN rising_edge
       118 |         BOOLEAN falling_edge
       120 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       120 |         U32 sample_interval
       124 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       124 |         F32 a1
       128 |         F32 b0
       132 |         F32 b1
       136 |         F32 k1
       140 |         F32 k2
       144 |       F32 wof_l_limit
       148 |       F32 wof_u_limit
       152 |     MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
       152 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       152 |         U32 P
       156 |         BOOLEAN ic
       157 |         BOOLEAN rising_edge
       158 |         BOOLEAN falling_edge
       160 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       160 |         U32 sample_interval
       164 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       164 |         F32 a1
       168 |         F32 b0
       172 |         F32 b1
       176 |         F32 k1
       180 |         F32 k2
       184 |       F32 wof_l_limit
       188 |       F32 wof_u_limit
       192 |   F32 lf_l_limit
       196 |   PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
       196 |     U32 P
       200 |     BOOLEAN ic
       201 |     BOOLEAN rising_edge
       202 |     BOOLEAN falling_edge
           | [sizeof=204, align=4]

*** Dumping AST Record Layout
         0 | SCHEDULEDRATELIMITER_COEFF_STRUCT
         0 |   LINTERP_STRUCT upper_linterp
         0 |     U8 n_regions
         4 |     LINTERP_REGION_STRUCT [20] regions
       244 |   LINTERP_STRUCT lower_linterp
       244 |     U8 n_regions
       248 |     LINTERP_REGION_STRUCT [20] regions
       488 |   F32 ts
           | [sizeof=492, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT
         0 |   TEST_PORT_COEFF_STRUCT roll_input_testport_coeff
         0 |     F32 gain
         4 |     F32 bias
         8 |   TEST_PORT_COEFF_STRUCT pitch_input_testport_coeff
         8 |     F32 gain
        12 |     F32 bias
        16 |   SCHEDULEDRATELIMITER_COEFF_STRUCT roll_scheduledRL_coeff
        16 |     LINTERP_STRUCT upper_linterp
        16 |       U8 n_regions
        20 |       LINTERP_REGION_STRUCT [20] regions
       260 |     LINTERP_STRUCT lower_linterp
       260 |       U8 n_regions
       264 |       LINTERP_REGION_STRUCT [20] regions
       504 |     F32 ts
       508 |   SCHEDULEDRATELIMITER_COEFF_STRUCT pitch_scheduledRL_coeff
       508 |     LINTERP_STRUCT upper_linterp
       508 |       U8 n_regions
       512 |       LINTERP_REGION_STRUCT [20] regions
       752 |     LINTERP_STRUCT lower_linterp
       752 |       U8 n_regions
       756 |       LINTERP_REGION_STRUCT [20] regions
       996 |     F32 ts
      1000 |   TEST_PORT_COEFF_STRUCT roll_unlimited_testport_coeff
      1000 |     F32 gain
      1004 |     F32 bias
      1008 |   TEST_PORT_COEFF_STRUCT pitch_unlimited_testport_coeff
      1008 |     F32 gain
      1012 |     F32 bias
      1016 |   F32 roll_rigging_gain
      1020 |   F32 pitch_rigging_gain
      1024 |   F32 inv_roll_rigging_gain
      1028 |   F32 inv_pitch_rigging_gain
      1032 |   F32 sin_wave_frequency
      1036 |   F32 sin_wave_amplitude
      1040 |   SERVO_LOOP_COEFF_STRUCT roll_servo_loop_coeff
      1040 |     TEST_PORT_COEFF_STRUCT testport_case1
      1040 |       F32 gain
      1044 |       F32 bias
      1048 |     SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      1048 |       F32 epsilon
      1052 |     REINTICHS_COEFF_STRUCT ReInt_ICHS
      1052 |       REINTICH_COEFF_STRUCT integrator_coeff
      1052 |         F32 K_Ts
      1056 |       SATURATIONVF_COEFF_STRUCT sat_coeff
      1056 |         F32 epsilon
      1060 |         F32 upper_sat_limit
      1064 |         F32 lower_sat_limit
      1068 |       F32 K_Ts
      1072 |       F32 response_bias
      1076 |     F32 k_ts
      1080 |     F32 k
      1084 |     F32 k2
      1088 |     F32 k3
      1092 |     F32 k4
      1096 |     F32 max_current
      1100 |     F32 rate_limiter_upper_limit
      1104 |     F32 rate_limiter_lower_limit
      1108 |   SERVO_LOOP_COEFF_STRUCT pitch_servo_loop_coeff
      1108 |     TEST_PORT_COEFF_STRUCT testport_case1
      1108 |       F32 gain
      1112 |       F32 bias
      1116 |     SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      1116 |       F32 epsilon
      1120 |     REINTICHS_COEFF_STRUCT ReInt_ICHS
      1120 |       REINTICH_COEFF_STRUCT integrator_coeff
      1120 |         F32 K_Ts
      1124 |       SATURATIONVF_COEFF_STRUCT sat_coeff
      1124 |         F32 epsilon
      1128 |         F32 upper_sat_limit
      1132 |         F32 lower_sat_limit
      1136 |       F32 K_Ts
      1140 |       F32 response_bias
      1144 |     F32 k_ts
      1148 |     F32 k
      1152 |     F32 k2
      1156 |     F32 k3
      1160 |     F32 k4
      1164 |     F32 max_current
      1168 |     F32 rate_limiter_upper_limit
      1172 |     F32 rate_limiter_lower_limit
           | [sizeof=1176, align=4]

*** Dumping AST Record Layout
         0 | MCP_COEFF_STRUCT
         0 |   MCP_ISM_COEFF_STRUCT ism
         0 |     ACTUATOR_FW_COEFF_STRUCT Roll_Actuator_FW
         0 |       F32 MotorRevPerHallCount
         4 |       F32 GearboxReductionRatio
         8 |       F32 ArmCircumference
        12 |     ACTUATOR_FW_COEFF_STRUCT Pitch_Actuator_FW
        12 |       F32 MotorRevPerHallCount
        16 |       F32 GearboxReductionRatio
        20 |       F32 ArmCircumference
        24 |     STICKSWITCHSTATESENSING_COEFF_STRUCT StickSwitchStateSensing
        24 |       MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch1
        24 |         U32 debounce_threshold
        28 |         U32 sustain_threshold
        32 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        32 |           U32 P
        36 |           BOOLEAN ic
        37 |           BOOLEAN rising_edge
        38 |           BOOLEAN falling_edge
        40 |       MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch2
        40 |         U32 debounce_threshold
        44 |         U32 sustain_threshold
        48 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        48 |           U32 P
        52 |           BOOLEAN ic
        53 |           BOOLEAN rising_edge
        54 |           BOOLEAN falling_edge
        56 |       MOMENTARY_SWITCH_COEFF_STRUCT ChangeModeSwitch
        56 |         U32 debounce_threshold
        60 |         U32 sustain_threshold
        64 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        64 |           U32 P
        68 |           BOOLEAN ic
        69 |           BOOLEAN rising_edge
        70 |           BOOLEAN falling_edge
        72 |       MOMENTARY_SWITCH_COEFF_STRUCT pciSwR_Switch
        72 |         U32 debounce_threshold
        76 |         U32 sustain_threshold
        80 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        80 |           U32 P
        84 |           BOOLEAN ic
        85 |           BOOLEAN rising_edge
        86 |           BOOLEAN falling_edge
        88 |       MOMENTARY_SWITCH_COEFF_STRUCT pciSwL_Switch
        88 |         U32 debounce_threshold
        92 |         U32 sustain_threshold
        96 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        96 |           U32 P
       100 |           BOOLEAN ic
       101 |           BOOLEAN rising_edge
       102 |           BOOLEAN falling_edge
       104 |       MOMENTARY_SWITCH_COEFF_STRUCT pciSwF_Switch
       104 |         U32 debounce_threshold
       108 |         U32 sustain_threshold
       112 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       112 |           U32 P
       116 |           BOOLEAN ic
       117 |           BOOLEAN rising_edge
       118 |           BOOLEAN falling_edge
       120 |       MOMENTARY_SWITCH_COEFF_STRUCT pciSwA_Switch
       120 |         U32 debounce_threshold
       124 |         U32 sustain_threshold
       128 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       128 |           U32 P
       132 |           BOOLEAN ic
       133 |           BOOLEAN rising_edge
       134 |           BOOLEAN falling_edge
       136 |     ENGAGE_LOGIC_COEFF_STRUCT EngageLogic
       136 |       PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoEngage
       136 |         U32 P
       140 |         BOOLEAN ic
       141 |         BOOLEAN rising_edge
       142 |         BOOLEAN falling_edge
       144 |       PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoDisengage
       144 |         U32 P
       148 |         BOOLEAN ic
       149 |         BOOLEAN rising_edge
       150 |         BOOLEAN falling_edge
       152 |   MCP_CONTROL_PRODUCER_COEFF_STRUCT control_coeff
       152 |     CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
       152 |       F32 rate_limiter_lower_limit
       156 |       F32 rate_limiter_upper_limit
       160 |       G_LIMITER_COEFF_STRUCT g_limiter
       160 |         RATELIMITERDYNVF_COEFF_STRUCT ratelimiterdynvf
       160 |           F32 ts
       164 |         F32 g_limit
       168 |         F32 max_rate_limit
       172 |       ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
       172 |         LINTERP_STRUCT k_attitude_to_ang_accel
       172 |           U8 n_regions
       176 |           LINTERP_REGION_STRUCT [20] regions
       416 |         LINTERP_STRUCT k_rate_to_ang_accel
       416 |           U8 n_regions
       420 |           LINTERP_REGION_STRUCT [20] regions
       660 |         F32 k_attitude_to_ang_accel_integral
       664 |         F32 k_rate_to_ang_accel_cross
       668 |         REINTICHS_COEFF_STRUCT reintichs
       668 |           REINTICH_COEFF_STRUCT integrator_coeff
       668 |             F32 K_Ts
       672 |           SATURATIONVF_COEFF_STRUCT sat_coeff
       672 |             F32 epsilon
       676 |             F32 upper_sat_limit
       680 |             F32 lower_sat_limit
       684 |           F32 K_Ts
       688 |           F32 response_bias
       692 |       ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       692 |         LINTERP_STRUCT k_attitude_to_ang_accel
       692 |           U8 n_regions
       696 |           LINTERP_REGION_STRUCT [20] regions
       936 |         LINTERP_STRUCT k_rate_to_ang_accel
       936 |           U8 n_regions
       940 |           LINTERP_REGION_STRUCT [20] regions
      1180 |         F32 k_attitude_to_ang_accel_integral
      1184 |         F32 k_rate_to_ang_accel_cross
      1188 |         REINTICHS_COEFF_STRUCT reintichs
      1188 |           REINTICH_COEFF_STRUCT integrator_coeff
      1188 |             F32 K_Ts
      1192 |           SATURATIONVF_COEFF_STRUCT sat_coeff
      1192 |             F32 epsilon
      1196 |             F32 upper_sat_limit
      1200 |             F32 lower_sat_limit
      1204 |           F32 K_Ts
      1208 |           F32 response_bias
      1212 |       TEST_PORT_COEFF_STRUCT roll_testport
      1212 |         F32 gain
      1216 |         F32 bias
      1220 |       TEST_PORT_COEFF_STRUCT pitch_testport
      1220 |         F32 gain
      1224 |         F32 bias
      1228 |     UARMODELOGIC_COEFF_STRUCT uar_mode_logic
      1228 |       F32 phi_upper_limit
      1232 |       F32 phi_lower_limit
      1236 |       F32 theta_upper_limit
      1240 |       F32 theta_lower_limit
      1244 |       F32 p_filt_upper_limit
      1248 |       F32 p_filt_lower_limit
      1252 |       F32 q_filt_upper_limit
      1256 |       F32 q_filt_lower_limit
      1260 |       PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
      1260 |         U32 P
      1264 |         BOOLEAN ic
      1265 |         BOOLEAN rising_edge
      1266 |         BOOLEAN falling_edge
      1268 |   INNER_LOOP_MONITORS_COEFF_STRUCT monitors_coeff
      1268 |     MONITOR_COEFF_STRUCT roll_coeff
      1268 |       F32 rate_l_limit
      1272 |       F32 rate_u_limit
      1276 |       F32 attitude_l_limit
      1280 |       F32 attitude_u_limit
      1284 |       MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
      1284 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1284 |           U32 P
      1288 |           BOOLEAN ic
      1289 |           BOOLEAN rising_edge
      1290 |           BOOLEAN falling_edge
      1292 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1292 |           U32 sample_interval
      1296 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1296 |           F32 a1
      1300 |           F32 b0
      1304 |           F32 b1
      1308 |           F32 k1
      1312 |           F32 k2
      1316 |         F32 wof_l_limit
      1320 |         F32 wof_u_limit
      1324 |       MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
      1324 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1324 |           U32 P
      1328 |           BOOLEAN ic
      1329 |           BOOLEAN rising_edge
      1330 |           BOOLEAN falling_edge
      1332 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1332 |           U32 sample_interval
      1336 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1336 |           F32 a1
      1340 |           F32 b0
      1344 |           F32 b1
      1348 |           F32 k1
      1352 |           F32 k2
      1356 |         F32 wof_l_limit
      1360 |         F32 wof_u_limit
      1364 |     MONITOR_COEFF_STRUCT pitch_coeff
      1364 |       F32 rate_l_limit
      1368 |       F32 rate_u_limit
      1372 |       F32 attitude_l_limit
      1376 |       F32 attitude_u_limit
      1380 |       MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
      1380 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1380 |           U32 P
      1384 |           BOOLEAN ic
      1385 |           BOOLEAN rising_edge
      1386 |           BOOLEAN falling_edge
      1388 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1388 |           U32 sample_interval
      1392 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1392 |           F32 a1
      1396 |           F32 b0
      1400 |           F32 b1
      1404 |           F32 k1
      1408 |           F32 k2
      1412 |         F32 wof_l_limit
      1416 |         F32 wof_u_limit
      1420 |       MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
      1420 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1420 |           U32 P
      1424 |           BOOLEAN ic
      1425 |           BOOLEAN rising_edge
      1426 |           BOOLEAN falling_edge
      1428 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1428 |           U32 sample_interval
      1432 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1432 |           F32 a1
      1436 |           F32 b0
      1440 |           F32 b1
      1444 |           F32 k1
      1448 |           F32 k2
      1452 |         F32 wof_l_limit
      1456 |         F32 wof_u_limit
      1460 |     F32 lf_l_limit
      1464 |     PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
      1464 |       U32 P
      1468 |       BOOLEAN ic
      1469 |       BOOLEAN rising_edge
      1470 |       BOOLEAN falling_edge
      1472 |   CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT cyclic_servo_controller_coeff
      1472 |     TEST_PORT_COEFF_STRUCT roll_input_testport_coeff
      1472 |       F32 gain
      1476 |       F32 bias
      1480 |     TEST_PORT_COEFF_STRUCT pitch_input_testport_coeff
      1480 |       F32 gain
      1484 |       F32 bias
      1488 |     SCHEDULEDRATELIMITER_COEFF_STRUCT roll_scheduledRL_coeff
      1488 |       LINTERP_STRUCT upper_linterp
      1488 |         U8 n_regions
      1492 |         LINTERP_REGION_STRUCT [20] regions
      1732 |       LINTERP_STRUCT lower_linterp
      1732 |         U8 n_regions
      1736 |         LINTERP_REGION_STRUCT [20] regions
      1976 |       F32 ts
      1980 |     SCHEDULEDRATELIMITER_COEFF_STRUCT pitch_scheduledRL_coeff
      1980 |       LINTERP_STRUCT upper_linterp
      1980 |         U8 n_regions
      1984 |         LINTERP_REGION_STRUCT [20] regions
      2224 |       LINTERP_STRUCT lower_linterp
      2224 |         U8 n_regions
      2228 |         LINTERP_REGION_STRUCT [20] regions
      2468 |       F32 ts
      2472 |     TEST_PORT_COEFF_STRUCT roll_unlimited_testport_coeff
      2472 |       F32 gain
      2476 |       F32 bias
      2480 |     TEST_PORT_COEFF_STRUCT pitch_unlimited_testport_coeff
      2480 |       F32 gain
      2484 |       F32 bias
      2488 |     F32 roll_rigging_gain
      2492 |     F32 pitch_rigging_gain
      2496 |     F32 inv_roll_rigging_gain
      2500 |     F32 inv_pitch_rigging_gain
      2504 |     F32 sin_wave_frequency
      2508 |     F32 sin_wave_amplitude
      2512 |     SERVO_LOOP_COEFF_STRUCT roll_servo_loop_coeff
      2512 |       TEST_PORT_COEFF_STRUCT testport_case1
      2512 |         F32 gain
      2516 |         F32 bias
      2520 |       SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      2520 |         F32 epsilon
      2524 |       REINTICHS_COEFF_STRUCT ReInt_ICHS
      2524 |         REINTICH_COEFF_STRUCT integrator_coeff
      2524 |           F32 K_Ts
      2528 |         SATURATIONVF_COEFF_STRUCT sat_coeff
      2528 |           F32 epsilon
      2532 |           F32 upper_sat_limit
      2536 |           F32 lower_sat_limit
      2540 |         F32 K_Ts
      2544 |         F32 response_bias
      2548 |       F32 k_ts
      2552 |       F32 k
      2556 |       F32 k2
      2560 |       F32 k3
      2564 |       F32 k4
      2568 |       F32 max_current
      2572 |       F32 rate_limiter_upper_limit
      2576 |       F32 rate_limiter_lower_limit
      2580 |     SERVO_LOOP_COEFF_STRUCT pitch_servo_loop_coeff
      2580 |       TEST_PORT_COEFF_STRUCT testport_case1
      2580 |         F32 gain
      2584 |         F32 bias
      2588 |       SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      2588 |         F32 epsilon
      2592 |       REINTICHS_COEFF_STRUCT ReInt_ICHS
      2592 |         REINTICH_COEFF_STRUCT integrator_coeff
      2592 |           F32 K_Ts
      2596 |         SATURATIONVF_COEFF_STRUCT sat_coeff
      2596 |           F32 epsilon
      2600 |           F32 upper_sat_limit
      2604 |           F32 lower_sat_limit
      2608 |         F32 K_Ts
      2612 |         F32 response_bias
      2616 |       F32 k_ts
      2620 |       F32 k
      2624 |       F32 k2
      2628 |       F32 k3
      2632 |       F32 k4
      2636 |       F32 max_current
      2640 |       F32 rate_limiter_upper_limit
      2644 |       F32 rate_limiter_lower_limit
      2648 |   F32 gain
      2652 |   F32 gain1
      2656 |   F32 sin_wave_frequency
      2660 |   F32 sin_wave_amplitude
           | [sizeof=2664, align=4]

*** Dumping AST Record Layout
         0 | struct CONFIG_MGMT_MCP_BINARY_SEGMENT
         0 |   U32 software_verson_num
         4 |   U32 flash_crc
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_MGMT_MFG_REMOTE_CALIBRATION_STRUCT
         0 |   THREE_AXIS_SENSOR_CALIBRATION_STRUCT mag_calibration
         0 |     MATRIX3X3 sensor_counts_to_body_axes
         0 |       VECTOR3 row1
         0 |         F32 X
         4 |         F32 Y
         8 |         F32 Z
        12 |       VECTOR3 row2
        12 |         F32 X
        16 |         F32 Y
        20 |         F32 Z
        24 |       VECTOR3 row3
        24 |         F32 X
        28 |         F32 Y
        32 |         F32 Z
        36 |     VECTOR3 bias
        36 |       F32 X
        40 |       F32 Y
        44 |       F32 Z
           | [sizeof=48, align=4]

*** Dumping AST Record Layout
         0 | struct CONFIG_MGMT_REMOTE_NVRAM_MFG_SEGMENT
         0 |   U32 major
         4 |   U32 minor
         8 |   SENSOR_MGMT_MFG_REMOTE_CALIBRATION_STRUCT calibration
         8 |     THREE_AXIS_SENSOR_CALIBRATION_STRUCT mag_calibration
         8 |       MATRIX3X3 sensor_counts_to_body_axes
         8 |         VECTOR3 row1
         8 |           F32 X
        12 |           F32 Y
        16 |           F32 Z
        20 |         VECTOR3 row2
        20 |           F32 X
        24 |           F32 Y
        28 |           F32 Z
        32 |         VECTOR3 row3
        32 |           F32 X
        36 |           F32 Y
        40 |           F32 Z
        44 |       VECTOR3 bias
        44 |         F32 X
        48 |         F32 Y
        52 |         F32 Z
        56 |   U8 [11] serial_number
        67 |   U8 [15] time_stamp
           | [sizeof=84, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_MGMT_MFG_REMOTE_OAT_CALIBRATION_STRUCT
         0 |   SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT OAT_calibration
         0 |     F32 scale
         4 |     F32 bias
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct CONFIG_MGMT_REMOTE_OAT_NVRAM_MFG_SEGMENT
         0 |   U32 major
         4 |   U32 minor
         8 |   SENSOR_MGMT_MFG_REMOTE_OAT_CALIBRATION_STRUCT calibration
         8 |     SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT OAT_calibration
         8 |       F32 scale
        12 |       F32 bias
        16 |   U8 [11] serial_number
        27 |   U8 [15] time_stamp
           | [sizeof=44, align=4]

*** Dumping AST Record Layout
         0 | EULER_RATES
         0 |   F32 phi_dot
         4 |   F32 theta_dot
         8 |   F32 psi_dot
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5)
     0:0-0 |   BOOLEAN accel_valid
     0:1-1 |   BOOLEAN ADAHRS_valid
     0:2-2 |   BOOLEAN adc0_valid
     0:3-3 |   BOOLEAN adc1_valid
     0:4-4 |   BOOLEAN differential_pressure0_valid
     0:5-5 |   BOOLEAN differential_pressure1_valid
     0:6-6 |   BOOLEAN gyro_valid
     0:7-7 |   BOOLEAN mag_valid
     1:0-0 |   BOOLEAN oat_valid
     1:1-1 |   BOOLEAN remote_accel_valid
     1:2-2 |   BOOLEAN static_pressure0_valid
     1:3-3 |   BOOLEAN static_pressure1_valid
     1:4-4 |   BOOLEAN Autopilot_Engaged
     1:5-5 |   BOOLEAN Autopilot_Ready
     1:6-6 |   BOOLEAN UAR_Mode
     1:7-7 |   BOOLEAN Pilot_Override
     2:0-0 |   BOOLEAN Video_Sync_Light_Output
           | [sizeof=3, align=1]

*** Dumping AST Record Layout
         0 | System_Flags
         0 |   U32 flags_u32
         0 |   struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5) flags_bf
     0:0-0 |     BOOLEAN accel_valid
     0:1-1 |     BOOLEAN ADAHRS_valid
     0:2-2 |     BOOLEAN adc0_valid
     0:3-3 |     BOOLEAN adc1_valid
     0:4-4 |     BOOLEAN differential_pressure0_valid
     0:5-5 |     BOOLEAN differential_pressure1_valid
     0:6-6 |     BOOLEAN gyro_valid
     0:7-7 |     BOOLEAN mag_valid
     1:0-0 |     BOOLEAN oat_valid
     1:1-1 |     BOOLEAN remote_accel_valid
     1:2-2 |     BOOLEAN static_pressure0_valid
     1:3-3 |     BOOLEAN static_pressure1_valid
     1:4-4 |     BOOLEAN Autopilot_Engaged
     1:5-5 |     BOOLEAN Autopilot_Ready
     1:6-6 |     BOOLEAN UAR_Mode
     1:7-7 |     BOOLEAN Pilot_Override
     2:0-0 |     BOOLEAN Video_Sync_Light_Output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:108:5)
     0:0-0 |   BOOLEAN Roll_Rate_Fail
     0:1-1 |   BOOLEAN Roll_ADP_Cmd_Fail
     0:2-2 |   BOOLEAN Roll_ACT_POS_Fail
     0:3-3 |   BOOLEAN Roll_ATT_Fail
     0:4-4 |   BOOLEAN Pitch_Rate_Fail
     0:5-5 |   BOOLEAN Pitch_ADP_Cmd_Fail
     0:6-6 |   BOOLEAN Pitch_ACT_Pos_Fail
     0:7-7 |   BOOLEAN Pitch_ATT_Fail
     1:0-0 |   BOOLEAN Combined_Fail_Status
     1:1-1 |   BOOLEAN Roll_Servoloop_CurrSatLL
     1:2-2 |   BOOLEAN Roll_Servoloop_CurrSatUL
     1:3-3 |   BOOLEAN Roll_Servoloop_PLSat
     1:4-4 |   BOOLEAN Roll_Servoloop_RLSat
     1:5-5 |   BOOLEAN Pitch_Servoloop_CurrSatLL
     1:6-6 |   BOOLEAN Pitch_Servoloop_CurrSatUL
     1:7-7 |   BOOLEAN Pitch_Servoloop_PLSat
     2:0-0 |   BOOLEAN Pitch_Servoloop_RLSat
     2:1-1 |   BOOLEAN Roll_Rate_Limited
     2:2-2 |   BOOLEAN Pitch_Rate_Limited
     2:3-3 |   BOOLEAN Roll_Att_Ctrl_Integ_Sat_UL
     2:4-4 |   BOOLEAN Roll_Att_Ctrl_Integ_Sat_LL
     2:5-5 |   BOOLEAN Pitch_Att_Ctrl_Integ_Sat_UL
     2:6-6 |   BOOLEAN Pitch_Att_Ctrl_Integ_Sat_LL
     2:7-7 |   BOOLEAN Roll_ADP_Rate_Limit
     3:0-0 |   BOOLEAN Pitch_ADP_Rate_Upper_Limit
     3:1-1 |   BOOLEAN Pitch_ADP_Rate_Lower_Limit
     3:2-2 |   BOOLEAN Lateral_Sync
     3:3-3 |   BOOLEAN Vertical_Sync
           | [sizeof=4, align=1]

*** Dumping AST Record Layout
         0 | CLAW_Flags
         0 |   U32 flags_u32
         0 |   struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:108:5) flags_bf
     0:0-0 |     BOOLEAN Roll_Rate_Fail
     0:1-1 |     BOOLEAN Roll_ADP_Cmd_Fail
     0:2-2 |     BOOLEAN Roll_ACT_POS_Fail
     0:3-3 |     BOOLEAN Roll_ATT_Fail
     0:4-4 |     BOOLEAN Pitch_Rate_Fail
     0:5-5 |     BOOLEAN Pitch_ADP_Cmd_Fail
     0:6-6 |     BOOLEAN Pitch_ACT_Pos_Fail
     0:7-7 |     BOOLEAN Pitch_ATT_Fail
     1:0-0 |     BOOLEAN Combined_Fail_Status
     1:1-1 |     BOOLEAN Roll_Servoloop_CurrSatLL
     1:2-2 |     BOOLEAN Roll_Servoloop_CurrSatUL
     1:3-3 |     BOOLEAN Roll_Servoloop_PLSat
     1:4-4 |     BOOLEAN Roll_Servoloop_RLSat
     1:5-5 |     BOOLEAN Pitch_Servoloop_CurrSatLL
     1:6-6 |     BOOLEAN Pitch_Servoloop_CurrSatUL
     1:7-7 |     BOOLEAN Pitch_Servoloop_PLSat
     2:0-0 |     BOOLEAN Pitch_Servoloop_RLSat
     2:1-1 |     BOOLEAN Roll_Rate_Limited
     2:2-2 |     BOOLEAN Pitch_Rate_Limited
     2:3-3 |     BOOLEAN Roll_Att_Ctrl_Integ_Sat_UL
     2:4-4 |     BOOLEAN Roll_Att_Ctrl_Integ_Sat_LL
     2:5-5 |     BOOLEAN Pitch_Att_Ctrl_Integ_Sat_UL
     2:6-6 |     BOOLEAN Pitch_Att_Ctrl_Integ_Sat_LL
     2:7-7 |     BOOLEAN Roll_ADP_Rate_Limit
     3:0-0 |     BOOLEAN Pitch_ADP_Rate_Upper_Limit
     3:1-1 |     BOOLEAN Pitch_ADP_Rate_Lower_Limit
     3:2-2 |     BOOLEAN Lateral_Sync
     3:3-3 |     BOOLEAN Vertical_Sync
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TELEMETRY_LOG_STRUCT
         0 |   EULER_ANGLES eulers
         0 |     F32 phi
         4 |     F32 theta
         8 |     F32 psi
        12 |   EULER_RATES euler_rates
        12 |     F32 phi_dot
        16 |     F32 theta_dot
        20 |     F32 psi_dot
        24 |   VECTOR3 rates
        24 |     F32 X
        28 |     F32 Y
        32 |     F32 Z
        36 |   VECTOR3 accels
        36 |     F32 X
        40 |     F32 Y
        44 |     F32 Z
        48 |   CYCLIC_STRUCT actuator_positions
        48 |     F32 roll
        52 |     F32 pitch
        56 |   CYCLIC_STRUCT actuator_commands
        56 |     F32 roll
        60 |     F32 pitch
        64 |   CYCLIC_STRUCT adp_commands
        64 |     F32 roll
        68 |     F32 pitch
        72 |   CYCLIC_STRUCT motor_A_current
        72 |     F32 roll
        76 |     F32 pitch
        80 |   CYCLIC_STRUCT motor_B_current
        80 |     F32 roll
        84 |     F32 pitch
        88 |   CYCLIC_STRUCT actuator_mvc
        88 |     F32 roll
        92 |     F32 pitch
        96 |   CYCLIC_STRUCT attitude_controller_integrators
        96 |     F32 roll
       100 |     F32 pitch
       104 |   CYCLIC_STRUCT attitude_controller_props
       104 |     F32 roll
       108 |     F32 pitch
       112 |   CYCLIC_STRUCT attitude_controller_rates
       112 |     F32 roll
       116 |     F32 pitch
       120 |   CYCLIC_STRUCT attitude_controller_output
       120 |     F32 roll
       124 |     F32 pitch
       128 |   F32 TAS
       132 |   F32 oat
       136 |   F32 IAS
       140 |   F32 baro_altitude
       144 |   U32 framenumber
       148 |   U32 latest_fault
       152 |   System_Flags sys_flags
       152 |     U32 flags_u32
       152 |     struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5) flags_bf
   152:0-0 |       BOOLEAN accel_valid
   152:1-1 |       BOOLEAN ADAHRS_valid
   152:2-2 |       BOOLEAN adc0_valid
   152:3-3 |       BOOLEAN adc1_valid
   152:4-4 |       BOOLEAN differential_pressure0_valid
   152:5-5 |       BOOLEAN differential_pressure1_valid
   152:6-6 |       BOOLEAN gyro_valid
   152:7-7 |       BOOLEAN mag_valid
   153:0-0 |       BOOLEAN oat_valid
   153:1-1 |       BOOLEAN remote_accel_valid
   153:2-2 |       BOOLEAN static_pressure0_valid
   153:3-3 |       BOOLEAN static_pressure1_valid
   153:4-4 |       BOOLEAN Autopilot_Engaged
   153:5-5 |       BOOLEAN Autopilot_Ready
   153:6-6 |       BOOLEAN UAR_Mode
   153:7-7 |       BOOLEAN Pilot_Override
   154:0-0 |       BOOLEAN Video_Sync_Light_Output
       156 |   CLAW_Flags claw_flags
       156 |     U32 flags_u32
       156 |     struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:108:5) flags_bf
   156:0-0 |       BOOLEAN Roll_Rate_Fail
   156:1-1 |       BOOLEAN Roll_ADP_Cmd_Fail
   156:2-2 |       BOOLEAN Roll_ACT_POS_Fail
   156:3-3 |       BOOLEAN Roll_ATT_Fail
   156:4-4 |       BOOLEAN Pitch_Rate_Fail
   156:5-5 |       BOOLEAN Pitch_ADP_Cmd_Fail
   156:6-6 |       BOOLEAN Pitch_ACT_Pos_Fail
   156:7-7 |       BOOLEAN Pitch_ATT_Fail
   157:0-0 |       BOOLEAN Combined_Fail_Status
   157:1-1 |       BOOLEAN Roll_Servoloop_CurrSatLL
   157:2-2 |       BOOLEAN Roll_Servoloop_CurrSatUL
   157:3-3 |       BOOLEAN Roll_Servoloop_PLSat
   157:4-4 |       BOOLEAN Roll_Servoloop_RLSat
   157:5-5 |       BOOLEAN Pitch_Servoloop_CurrSatLL
   157:6-6 |       BOOLEAN Pitch_Servoloop_CurrSatUL
   157:7-7 |       BOOLEAN Pitch_Servoloop_PLSat
   158:0-0 |       BOOLEAN Pitch_Servoloop_RLSat
   158:1-1 |       BOOLEAN Roll_Rate_Limited
   158:2-2 |       BOOLEAN Pitch_Rate_Limited
   158:3-3 |       BOOLEAN Roll_Att_Ctrl_Integ_Sat_UL
   158:4-4 |       BOOLEAN Roll_Att_Ctrl_Integ_Sat_LL
   158:5-5 |       BOOLEAN Pitch_Att_Ctrl_Integ_Sat_UL
   158:6-6 |       BOOLEAN Pitch_Att_Ctrl_Integ_Sat_LL
   158:7-7 |       BOOLEAN Roll_ADP_Rate_Limit
   159:0-0 |       BOOLEAN Pitch_ADP_Rate_Upper_Limit
   159:1-1 |       BOOLEAN Pitch_ADP_Rate_Lower_Limit
   159:2-2 |       BOOLEAN Lateral_Sync
   159:3-3 |       BOOLEAN Vertical_Sync
       160 |   F32 coefficient_changed_value
       164 |   COEFF_CHANGE_COEFF_INDEX coefficient_changed_index
       166 |   USER_INPUT_FLAGS button_states
           | [sizeof=168, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26b0b10 <..\..\..\Common\Header/Helitrak_Types.h:227:9, line:232:1> line:227:9 struct definition
|-FullComment 0x2dfea30 <line:222:4, line:226:76>
| |-ParagraphComment 0x2dfe830 <line:222:4, line:223:4>
| | |-TextComment 0x2dfe7e0 <line:222:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dfe800 <line:223:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dfe850 <col:5, col:26> Text=" EULER_ANGLES"
| |-ParagraphComment 0x2dfe8b8 <line:224:1, col:4>
| | `-TextComment 0x2dfe890 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dfe8d8 <col:5, line:226:76> Name="brief"
|   `-ParagraphComment 0x2dfe9f0 <line:224:11, line:226:76>
|     |-TextComment 0x2dfe900 <line:224:11, col:55> Text=" Structure which holds the three euler angles"
|     |-TextComment 0x2dfe920 <line:225:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dfe968 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2dfe988 <col:16, col:34> Text="{HAP1-SDD-COM, 829}"
|     `-TextComment 0x2dfe9a8 <line:226:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x26b0bd0 <line:229:5, col:9> col:9 phi 'F32':'float'
|-FieldDecl 0x26b0c30 <line:230:5, col:9> col:9 theta 'F32':'float'
`-FieldDecl 0x26b0c90 <line:231:5, col:9> col:9 psi 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.EULER_ANGLES = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26b0dd0 <..\..\..\Common\Header/Helitrak_Types.h:240:9, line:245:1> line:240:9 struct definition
|-FullComment 0x2dfecb8 <line:235:4, line:239:76>
| |-ParagraphComment 0x2dfeae0 <line:235:4, line:236:4>
| | |-TextComment 0x2dfea90 <line:235:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dfeab0 <line:236:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dfeb00 <col:5, col:25> Text=" EULER_RATES"
| |-ParagraphComment 0x2dfeb68 <line:237:1, col:4>
| | `-TextComment 0x2dfeb40 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dfeb88 <col:5, line:239:76> Name="brief"
|   `-ParagraphComment 0x2dfec78 <line:237:11, line:239:76>
|     |-TextComment 0x2dfebb0 <line:237:11, col:83> Text=" Structure which holds the rates of rotation about the three euler angles"
|     |-TextComment 0x2dfebd0 <line:238:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dfebf0 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2dfec10 <col:16, col:35> Text="{HAP1-SDD-COM, 2517}"
|     `-TextComment 0x2dfec30 <line:239:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x26b0e90 <line:242:5, col:9> col:9 phi_dot 'F32':'float'
|-FieldDecl 0x26b0ef0 <line:243:5, col:9> col:9 theta_dot 'F32':'float'
`-FieldDecl 0x26b0f50 <line:244:5, col:9> col:9 psi_dot 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.EULER_RATES = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26b04f0 <..\..\..\Common\Header/Helitrak_Types.h:201:9, line:206:1> line:201:9 struct definition
|-FullComment 0x2dfef40 <line:196:4, line:200:76>
| |-ParagraphComment 0x2dfed68 <line:196:4, line:197:4>
| | |-TextComment 0x2dfed18 <line:196:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dfed38 <line:197:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dfed88 <col:5, col:21> Text=" VECTOR3"
| |-ParagraphComment 0x2dfedf0 <line:198:1, col:4>
| | `-TextComment 0x2dfedc8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dfee10 <col:5, line:200:76> Name="brief"
|   `-ParagraphComment 0x2dfef00 <line:198:11, line:200:76>
|     |-TextComment 0x2dfee38 <line:198:11, col:59> Text=" Structure which holds the elements of a 3-vector"
|     |-TextComment 0x2dfee58 <line:199:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dfee78 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2dfee98 <col:16, col:34> Text="{HAP1-SDD-COM, 534}"
|     `-TextComment 0x2dfeeb8 <line:200:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x26b05d0 <line:203:5, col:9> col:9 X 'F32':'float'
|-FieldDecl 0x26b0630 <line:204:5, col:9> col:9 Y 'F32':'float'
`-FieldDecl 0x26b0690 <line:205:5, col:9> col:9 Z 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.VECTOR3 = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26b29c0 <..\..\..\Common\Header/Helitrak_Types.h:378:9, line:382:1> line:378:9 struct definition
|-FullComment 0x2dff1c8 <line:373:4, line:377:76>
| |-ParagraphComment 0x2dfeff0 <line:373:4, line:374:4>
| | |-TextComment 0x2dfefa0 <line:373:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dfefc0 <line:374:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dff010 <col:5, col:27> Text=" CYCLIC_STRUCT"
| |-ParagraphComment 0x2dff078 <line:375:1, col:4>
| | `-TextComment 0x2dff050 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dff098 <col:5, line:377:76> Name="brief"
|   `-ParagraphComment 0x2dff188 <line:375:11, line:377:76>
|     |-TextComment 0x2dff0c0 <line:375:11, col:51> Text=" Structure which holds the pitch and roll"
|     |-TextComment 0x2dff0e0 <line:376:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dff100 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2dff120 <col:16, col:35> Text="{HAP1-SDD-COM, 2534}"
|     `-TextComment 0x2dff140 <line:377:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x26b2a80 <line:380:5, col:9> col:9 roll 'F32':'float'
`-FieldDecl 0x26b2ae0 <line:381:5, col:9> col:9 pitch 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.CYCLIC_STRUCT = type { float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a28d10 <..\..\..\Common\Header\Union_Flags.h:63:5, line:95:5> line:63:5 struct definition
|-FieldDecl 0x2a28df8 <line:67:9, col:47> col:17 accel_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a28dc0 <col:47> 'int' 1
|-FieldDecl 0x2a28e80 <line:68:9, col:47> col:17 ADAHRS_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a28e48 <col:47> 'int' 1
|-FieldDecl 0x2a28f08 <line:69:9, col:47> col:17 adc0_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a28ed0 <col:47> 'int' 1
|-FieldDecl 0x2a28f90 <line:70:9, col:47> col:17 adc1_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a28f58 <col:47> 'int' 1
|-FieldDecl 0x2a29018 <line:71:9, col:47> col:17 differential_pressure0_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a28fe0 <col:47> 'int' 1
|-FieldDecl 0x2a290a0 <line:72:9, col:47> col:17 differential_pressure1_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a29068 <col:47> 'int' 1
|-FieldDecl 0x2a29128 <line:73:9, col:47> col:17 gyro_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a290f0 <col:47> 'int' 1
|-FieldDecl 0x2a2e230 <line:74:9, col:47> col:17 mag_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a29178 <col:47> 'int' 1
|-FieldDecl 0x2a2e2b8 <line:75:9, col:47> col:17 oat_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e280 <col:47> 'int' 1
|-FieldDecl 0x2a2e340 <line:76:9, col:47> col:17 remote_accel_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e308 <col:47> 'int' 1
|-FieldDecl 0x2a2e3c8 <line:77:9, col:47> col:17 static_pressure0_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e390 <col:47> 'int' 1
|-FieldDecl 0x2a2e450 <line:78:9, col:47> col:17 static_pressure1_valid 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e418 <col:47> 'int' 1
|-FieldDecl 0x2a2e4d8 <line:81:9, col:47> col:17 Autopilot_Engaged 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e4a0 <col:47> 'int' 1
|-FieldDecl 0x2a2e560 <line:82:9, col:47> col:17 Autopilot_Ready 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e528 <col:47> 'int' 1
|-FieldDecl 0x2a2e5e8 <line:83:9, col:47> col:17 UAR_Mode 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e5b0 <col:47> 'int' 1
|-FieldDecl 0x2a2e670 <line:84:9, col:47> col:17 Pilot_Override 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2e638 <col:47> 'int' 1
`-FieldDecl 0x2a2e6f8 <line:87:9, col:47> col:17 Video_Sync_Light_Output 'BOOLEAN':'unsigned char'
  `-IntegerLiteral 0x2a2e6c0 <col:47> 'int' 1

Layout: <CGRecordLayout
  LLVMType:%struct.anon = type { i8, i8, i8 }
  IsZeroInitializable:1
  BitFields:[
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a28c08 <..\..\..\Common\Header\Union_Flags.h:60:9, line:97:1> line:60:9 union definition
|-FullComment 0x2dff450 <line:55:4, line:59:77>
| |-ParagraphComment 0x2dff278 <line:55:4, line:56:4>
| | |-TextComment 0x2dff228 <line:55:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dff248 <line:56:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dff298 <col:5, col:22> Text=" System_Flags"
| |-ParagraphComment 0x2dff300 <line:57:1, col:4>
| | `-TextComment 0x2dff2d8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dff320 <col:5, line:59:77> Name="brief"
|   `-ParagraphComment 0x2dff410 <line:57:11, line:59:77>
|     |-TextComment 0x2dff348 <line:57:11, col:62> Text=" Union of U32 and bitfields for boolean system flags"
|     |-TextComment 0x2dff368 <line:58:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dff388 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2dff3a8 <col:16, col:33> Text="{HAP1-SDD-Com,xxx}"
|     `-TextComment 0x2dff3c8 <line:59:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2a28cc0 <line:62:5, col:9> col:9 flags_u32 'U32':'unsigned long'
|-RecordDecl 0x2a28d10 <line:63:5, line:95:5> line:63:5 struct definition
| |-FieldDecl 0x2a28df8 <line:67:9, col:47> col:17 accel_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a28dc0 <col:47> 'int' 1
| |-FieldDecl 0x2a28e80 <line:68:9, col:47> col:17 ADAHRS_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a28e48 <col:47> 'int' 1
| |-FieldDecl 0x2a28f08 <line:69:9, col:47> col:17 adc0_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a28ed0 <col:47> 'int' 1
| |-FieldDecl 0x2a28f90 <line:70:9, col:47> col:17 adc1_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a28f58 <col:47> 'int' 1
| |-FieldDecl 0x2a29018 <line:71:9, col:47> col:17 differential_pressure0_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a28fe0 <col:47> 'int' 1
| |-FieldDecl 0x2a290a0 <line:72:9, col:47> col:17 differential_pressure1_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a29068 <col:47> 'int' 1
| |-FieldDecl 0x2a29128 <line:73:9, col:47> col:17 gyro_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a290f0 <col:47> 'int' 1
| |-FieldDecl 0x2a2e230 <line:74:9, col:47> col:17 mag_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a29178 <col:47> 'int' 1
| |-FieldDecl 0x2a2e2b8 <line:75:9, col:47> col:17 oat_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e280 <col:47> 'int' 1
| |-FieldDecl 0x2a2e340 <line:76:9, col:47> col:17 remote_accel_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e308 <col:47> 'int' 1
| |-FieldDecl 0x2a2e3c8 <line:77:9, col:47> col:17 static_pressure0_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e390 <col:47> 'int' 1
| |-FieldDecl 0x2a2e450 <line:78:9, col:47> col:17 static_pressure1_valid 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e418 <col:47> 'int' 1
| |-FieldDecl 0x2a2e4d8 <line:81:9, col:47> col:17 Autopilot_Engaged 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e4a0 <col:47> 'int' 1
| |-FieldDecl 0x2a2e560 <line:82:9, col:47> col:17 Autopilot_Ready 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e528 <col:47> 'int' 1
| |-FieldDecl 0x2a2e5e8 <line:83:9, col:47> col:17 UAR_Mode 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e5b0 <col:47> 'int' 1
| |-FieldDecl 0x2a2e670 <line:84:9, col:47> col:17 Pilot_Override 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2e638 <col:47> 'int' 1
| `-FieldDecl 0x2a2e6f8 <line:87:9, col:47> col:17 Video_Sync_Light_Output 'BOOLEAN':'unsigned char'
|   `-IntegerLiteral 0x2a2e6c0 <col:47> 'int' 1
`-FieldDecl 0x2a2e7a8 <line:63:5, line:95:7> col:7 flags_bf 'struct (anonymous struct at ..\..\..\Common\Header\Union_Flags.h:63:5)':'struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5)'

Layout: <CGRecordLayout
  LLVMType:%union.System_Flags = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a2ea00 <..\..\..\Common\Header\Union_Flags.h:108:5, line:151:5> line:108:5 struct definition
|-FieldDecl 0x2a2eae8 <line:111:9, col:47> col:17 Roll_Rate_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2eab0 <col:47> 'int' 1
|-FieldDecl 0x2a2eb70 <line:112:9, col:47> col:17 Roll_ADP_Cmd_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2eb38 <col:47> 'int' 1
|-FieldDecl 0x2a2ebf8 <line:113:9, col:47> col:17 Roll_ACT_POS_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2ebc0 <col:47> 'int' 1
|-FieldDecl 0x2a2ec80 <line:114:9, col:47> col:17 Roll_ATT_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2ec48 <col:47> 'int' 1
|-FieldDecl 0x2a2ed08 <line:116:9, col:47> col:17 Pitch_Rate_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2ecd0 <col:47> 'int' 1
|-FieldDecl 0x2a2ed90 <line:117:9, col:47> col:17 Pitch_ADP_Cmd_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2ed58 <col:47> 'int' 1
|-FieldDecl 0x2a2ee18 <line:118:9, col:47> col:17 Pitch_ACT_Pos_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2ede0 <col:47> 'int' 1
|-FieldDecl 0x2a2eea0 <line:119:9, col:47> col:17 Pitch_ATT_Fail 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2ee68 <col:47> 'int' 1
|-FieldDecl 0x2a2ef28 <line:121:9, col:47> col:17 Combined_Fail_Status 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2eef0 <col:47> 'int' 1
|-FieldDecl 0x2a2efb0 <line:124:9, col:47> col:17 Roll_Servoloop_CurrSatLL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2ef78 <col:47> 'int' 1
|-FieldDecl 0x2a2f038 <line:125:9, col:47> col:17 Roll_Servoloop_CurrSatUL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f000 <col:47> 'int' 1
|-FieldDecl 0x2a2f0c0 <line:126:9, col:47> col:17 Roll_Servoloop_PLSat 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f088 <col:47> 'int' 1
|-FieldDecl 0x2a2f148 <line:127:9, col:47> col:17 Roll_Servoloop_RLSat 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f110 <col:47> 'int' 1
|-FieldDecl 0x2a2f1d0 <line:129:9, col:47> col:17 Pitch_Servoloop_CurrSatLL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f198 <col:47> 'int' 1
|-FieldDecl 0x2a2f278 <line:130:9, col:47> col:17 Pitch_Servoloop_CurrSatUL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f240 <col:47> 'int' 1
|-FieldDecl 0x2a2f300 <line:131:9, col:47> col:17 Pitch_Servoloop_PLSat 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f2c8 <col:47> 'int' 1
|-FieldDecl 0x2a2f388 <line:132:9, col:47> col:17 Pitch_Servoloop_RLSat 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f350 <col:47> 'int' 1
|-FieldDecl 0x2a2f410 <line:135:9, col:47> col:17 Roll_Rate_Limited 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f3d8 <col:47> 'int' 1
|-FieldDecl 0x2a2f498 <line:136:9, col:47> col:17 Pitch_Rate_Limited 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f460 <col:47> 'int' 1
|-FieldDecl 0x2a2f520 <line:137:9, col:47> col:17 Roll_Att_Ctrl_Integ_Sat_UL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f4e8 <col:47> 'int' 1
|-FieldDecl 0x2a2f5a8 <line:139:9, col:47> col:17 Roll_Att_Ctrl_Integ_Sat_LL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f570 <col:47> 'int' 1
|-FieldDecl 0x2a2f630 <line:140:9, col:47> col:17 Pitch_Att_Ctrl_Integ_Sat_UL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f5f8 <col:47> 'int' 1
|-FieldDecl 0x2a2f6b8 <line:141:9, col:47> col:17 Pitch_Att_Ctrl_Integ_Sat_LL 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f680 <col:47> 'int' 1
|-FieldDecl 0x2a2f740 <line:142:9, col:47> col:17 Roll_ADP_Rate_Limit 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f708 <col:47> 'int' 1
|-FieldDecl 0x2a2f7c8 <line:144:9, col:47> col:17 Pitch_ADP_Rate_Upper_Limit 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f790 <col:47> 'int' 1
|-FieldDecl 0x2a2f850 <line:145:9, col:47> col:17 Pitch_ADP_Rate_Lower_Limit 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f818 <col:47> 'int' 1
|-FieldDecl 0x2a2f8d8 <line:146:9, col:47> col:17 Lateral_Sync 'BOOLEAN':'unsigned char'
| `-IntegerLiteral 0x2a2f8a0 <col:47> 'int' 1
`-FieldDecl 0x2a2f960 <line:147:9, col:47> col:17 Vertical_Sync 'BOOLEAN':'unsigned char'
  `-IntegerLiteral 0x2a2f928 <col:47> 'int' 1

Layout: <CGRecordLayout
  LLVMType:%struct.anon.0 = type { i8, i8, i8, i8 }
  IsZeroInitializable:1
  BitFields:[
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:8 StorageOffset:0>
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:8 StorageOffset:1>
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:8 StorageOffset:2>
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:8 StorageOffset:3>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:8 StorageOffset:3>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:8 StorageOffset:3>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:8 StorageOffset:3>
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a2e8f0 <..\..\..\Common\Header\Union_Flags.h:105:9, line:153:1> line:105:9 union definition
|-FullComment 0x2dff6d8 <line:100:4, line:104:77>
| |-ParagraphComment 0x2dff500 <line:100:4, line:101:4>
| | |-TextComment 0x2dff4b0 <line:100:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dff4d0 <line:101:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dff520 <col:5, col:20> Text=" CLAW_Flags"
| |-ParagraphComment 0x2dff588 <line:102:1, col:4>
| | `-TextComment 0x2dff560 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dff5a8 <col:5, line:104:77> Name="brief"
|   `-ParagraphComment 0x2dff698 <line:102:11, line:104:77>
|     |-TextComment 0x2dff5d0 <line:102:11, col:67> Text=" Union of U32 and bitfields for boolean control law flags"
|     |-TextComment 0x2dff5f0 <line:103:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dff610 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2dff630 <col:16, col:33> Text="{HAP1-SDD-Com,xxx}"
|     `-TextComment 0x2dff650 <line:104:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2a2e9b0 <line:107:5, col:9> col:9 flags_u32 'U32':'unsigned long'
|-RecordDecl 0x2a2ea00 <line:108:5, line:151:5> line:108:5 struct definition
| |-FieldDecl 0x2a2eae8 <line:111:9, col:47> col:17 Roll_Rate_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2eab0 <col:47> 'int' 1
| |-FieldDecl 0x2a2eb70 <line:112:9, col:47> col:17 Roll_ADP_Cmd_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2eb38 <col:47> 'int' 1
| |-FieldDecl 0x2a2ebf8 <line:113:9, col:47> col:17 Roll_ACT_POS_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2ebc0 <col:47> 'int' 1
| |-FieldDecl 0x2a2ec80 <line:114:9, col:47> col:17 Roll_ATT_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2ec48 <col:47> 'int' 1
| |-FieldDecl 0x2a2ed08 <line:116:9, col:47> col:17 Pitch_Rate_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2ecd0 <col:47> 'int' 1
| |-FieldDecl 0x2a2ed90 <line:117:9, col:47> col:17 Pitch_ADP_Cmd_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2ed58 <col:47> 'int' 1
| |-FieldDecl 0x2a2ee18 <line:118:9, col:47> col:17 Pitch_ACT_Pos_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2ede0 <col:47> 'int' 1
| |-FieldDecl 0x2a2eea0 <line:119:9, col:47> col:17 Pitch_ATT_Fail 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2ee68 <col:47> 'int' 1
| |-FieldDecl 0x2a2ef28 <line:121:9, col:47> col:17 Combined_Fail_Status 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2eef0 <col:47> 'int' 1
| |-FieldDecl 0x2a2efb0 <line:124:9, col:47> col:17 Roll_Servoloop_CurrSatLL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2ef78 <col:47> 'int' 1
| |-FieldDecl 0x2a2f038 <line:125:9, col:47> col:17 Roll_Servoloop_CurrSatUL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f000 <col:47> 'int' 1
| |-FieldDecl 0x2a2f0c0 <line:126:9, col:47> col:17 Roll_Servoloop_PLSat 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f088 <col:47> 'int' 1
| |-FieldDecl 0x2a2f148 <line:127:9, col:47> col:17 Roll_Servoloop_RLSat 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f110 <col:47> 'int' 1
| |-FieldDecl 0x2a2f1d0 <line:129:9, col:47> col:17 Pitch_Servoloop_CurrSatLL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f198 <col:47> 'int' 1
| |-FieldDecl 0x2a2f278 <line:130:9, col:47> col:17 Pitch_Servoloop_CurrSatUL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f240 <col:47> 'int' 1
| |-FieldDecl 0x2a2f300 <line:131:9, col:47> col:17 Pitch_Servoloop_PLSat 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f2c8 <col:47> 'int' 1
| |-FieldDecl 0x2a2f388 <line:132:9, col:47> col:17 Pitch_Servoloop_RLSat 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f350 <col:47> 'int' 1
| |-FieldDecl 0x2a2f410 <line:135:9, col:47> col:17 Roll_Rate_Limited 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f3d8 <col:47> 'int' 1
| |-FieldDecl 0x2a2f498 <line:136:9, col:47> col:17 Pitch_Rate_Limited 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f460 <col:47> 'int' 1
| |-FieldDecl 0x2a2f520 <line:137:9, col:47> col:17 Roll_Att_Ctrl_Integ_Sat_UL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f4e8 <col:47> 'int' 1
| |-FieldDecl 0x2a2f5a8 <line:139:9, col:47> col:17 Roll_Att_Ctrl_Integ_Sat_LL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f570 <col:47> 'int' 1
| |-FieldDecl 0x2a2f630 <line:140:9, col:47> col:17 Pitch_Att_Ctrl_Integ_Sat_UL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f5f8 <col:47> 'int' 1
| |-FieldDecl 0x2a2f6b8 <line:141:9, col:47> col:17 Pitch_Att_Ctrl_Integ_Sat_LL 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f680 <col:47> 'int' 1
| |-FieldDecl 0x2a2f740 <line:142:9, col:47> col:17 Roll_ADP_Rate_Limit 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f708 <col:47> 'int' 1
| |-FieldDecl 0x2a2f7c8 <line:144:9, col:47> col:17 Pitch_ADP_Rate_Upper_Limit 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f790 <col:47> 'int' 1
| |-FieldDecl 0x2a2f850 <line:145:9, col:47> col:17 Pitch_ADP_Rate_Lower_Limit 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f818 <col:47> 'int' 1
| |-FieldDecl 0x2a2f8d8 <line:146:9, col:47> col:17 Lateral_Sync 'BOOLEAN':'unsigned char'
| | `-IntegerLiteral 0x2a2f8a0 <col:47> 'int' 1
| `-FieldDecl 0x2a2f960 <line:147:9, col:47> col:17 Vertical_Sync 'BOOLEAN':'unsigned char'
|   `-IntegerLiteral 0x2a2f928 <col:47> 'int' 1
`-FieldDecl 0x2a2fa08 <line:108:5, line:151:7> col:7 flags_bf 'struct (anonymous struct at ..\..\..\Common\Header\Union_Flags.h:108:5)':'struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:108:5)'

Layout: <CGRecordLayout
  LLVMType:%union.CLAW_Flags = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a3c6b0 <..\..\..\MCP\Header\Telemetry_Log.h:143:9, line:202:1> line:143:9 struct definition
|-FullComment 0x2dffa20 <line:136:4, line:142:77>
| |-ParagraphComment 0x2dff788 <line:136:4, line:137:4>
| | |-TextComment 0x2dff738 <line:136:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dff758 <line:137:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dff7a8 <col:5, col:34> Text=" TELEMETRY_LOG_STRUCT"
| |-ParagraphComment 0x2dff810 <line:138:1, col:4>
| | `-TextComment 0x2dff7e8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dff830 <col:5, line:142:77> Name="brief"
|   `-ParagraphComment 0x2dff9e0 <line:138:11, line:142:77>
|     |-TextComment 0x2dff858 <line:138:11, col:76> Text=" Stores flight data to be transmitted via CAN to a remote computer"
|     |-TextComment 0x2dff878 <line:139:1, col:27> Text="    or data recording unit."
|     |-TextComment 0x2dff898 <line:140:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dff8d8 <col:5, col:12> Name="MCPReqt" RenderNormal
|     |-TextComment 0x2dff8f8 <col:13, col:31> Text="{HAP1-SDD-MCP,4184}"
|     |-TextComment 0x2dff918 <line:141:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dff938 <col:5, col:12> Name="MCPReqt" RenderNormal
|     |-TextComment 0x2dff958 <col:13, col:30> Text="{HAP1-SDD-MCP,xxx}"
|     `-TextComment 0x2dff978 <line:142:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2a3c770 <line:160:5, col:29> col:29 eulers 'EULER_ANGLES':'EULER_ANGLES'
|-FieldDecl 0x2a3c7d0 <line:161:5, col:29> col:29 euler_rates 'EULER_RATES':'EULER_RATES'
|-FieldDecl 0x2a3c830 <line:162:5, col:29> col:29 rates 'VECTOR3':'VECTOR3'
|-FieldDecl 0x2a3c890 <line:163:5, col:29> col:29 accels 'VECTOR3':'VECTOR3'
|-FieldDecl 0x2a3c8f0 <line:165:5, col:29> col:29 actuator_positions 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3c950 <line:166:5, col:29> col:29 actuator_commands 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3c9b0 <line:167:5, col:29> col:29 adp_commands 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3ca10 <line:168:5, col:29> col:29 motor_A_current 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3ca70 <line:169:5, col:29> col:29 motor_B_current 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3cad0 <line:170:5, col:29> col:29 actuator_mvc 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3cb30 <line:171:5, col:29> col:29 attitude_controller_integrators 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3cb90 <line:172:5, col:29> col:29 attitude_controller_props 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3cbf0 <line:173:5, col:29> col:29 attitude_controller_rates 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3cc50 <line:174:5, col:29> col:29 attitude_controller_output 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2a3ccb0 <line:176:5, col:29> col:29 TAS 'F32':'float'
|-FieldDecl 0x2a3cd10 <line:177:5, col:29> col:29 oat 'F32':'float'
|-FieldDecl 0x2a3cd70 <line:180:5, col:29> col:29 IAS 'F32':'float'
|-FieldDecl 0x2a3cdd0 <line:181:5, col:29> col:29 baro_altitude 'F32':'float'
|-FieldDecl 0x2a3ce30 <line:190:5, col:29> col:29 framenumber 'U32':'unsigned long'
|-FieldDecl 0x2a3ce90 <line:191:5, col:29> col:29 latest_fault 'U32':'unsigned long'
|-FieldDecl 0x2a3cf10 <line:192:5, col:29> col:29 sys_flags 'System_Flags':'System_Flags'
|-FieldDecl 0x2a3cf90 <line:193:5, col:29> col:29 claw_flags 'CLAW_Flags':'CLAW_Flags'
|-FieldDecl 0x2a3cff0 <line:196:5, col:21> col:21 coefficient_changed_value 'F32':'float'
|-FieldDecl 0x2a3d050 <line:197:5, col:30> col:30 coefficient_changed_index 'COEFF_CHANGE_COEFF_INDEX':'unsigned short'
`-FieldDecl 0x2a3d0b0 <line:200:5, col:29> col:29 button_states 'USER_INPUT_FLAGS':'unsigned short'

Layout: <CGRecordLayout
  LLVMType:%struct.TELEMETRY_LOG_STRUCT = type { %struct.EULER_ANGLES, %struct.EULER_RATES, %struct.VECTOR3, %struct.VECTOR3, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, float, float, float, float, i32, i32, %union.System_Flags, %union.CLAW_Flags, float, i16, i16 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bc8908 <..\..\..\Model\Inner_Loop\Header/Input_Signal_Module.h:59:9, line:65:1> line:59:9 struct definition
|-FullComment 0x2dffd40 <line:54:4, line:58:76>
| |-ParagraphComment 0x2dffb18 <line:54:4, line:55:4>
| | |-TextComment 0x2dffac8 <line:54:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dffae8 <line:55:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dffb38 <col:5, col:38> Text=" ACTUATOR_FW_COEFF_STRUCT"
| |-ParagraphComment 0x2dffba0 <line:56:1, col:4>
| | `-TextComment 0x2dffb78 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dffbc0 <col:5, line:58:76> Name="brief"
|   `-ParagraphComment 0x2dffce0 <line:56:11, line:58:76>
|     |-TextComment 0x2dffbe8 <line:56:11, col:61> Text=" Coefficient structure for Actuator Firmware block."
|     |-TextComment 0x2dffc08 <line:57:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dffc58 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2dffc78 <col:24, col:40> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2dffc98 <line:58:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2bc89c0 <line:61:5, col:9> col:9 MotorRevPerHallCount 'F32':'float'
|-FieldDecl 0x2bc8a20 <line:62:5, col:9> col:9 GearboxReductionRatio 'F32':'float'
`-FieldDecl 0x2bc8a80 <line:63:5, col:9> col:9 ArmCircumference 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.ACTUATOR_FW_COEFF_STRUCT = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26da508 <..\..\..\Model\Common\Header\Persistent1Shot.h:53:9, line:60:1> line:53:9 struct definition
|-FullComment 0x2dffff0 <line:48:4, line:52:77>
| |-ParagraphComment 0x2dffdf0 <line:48:4, line:49:4>
| | |-TextComment 0x2dffda0 <line:48:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2dffdc0 <line:49:1, col:4> Text="    "
| |-VerbatimLineComment 0x2dffe10 <col:5, col:42> Text=" PERSISTENT1SHOT_COEFF_STRUCT"
| |-ParagraphComment 0x2dffe78 <line:50:1, col:4>
| | `-TextComment 0x2dffe50 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2dffe98 <col:5, line:52:77> Name="brief"
|   `-ParagraphComment 0x2dfffb0 <line:50:11, line:52:77>
|     |-TextComment 0x2dffec0 <line:50:11, col:56> Text=" Coefficients struct for Persistent1Shot block"
|     |-TextComment 0x2dffee0 <line:51:1, col:4> Text="    "
|     |-InlineCommandComment 0x2dfff28 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2dfff48 <col:21, col:37> Text="{HAP1-SDD-MC,436}"
|     `-TextComment 0x2dfff68 <line:52:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x26db620 <line:55:5, col:9> col:9 P 'U32':'unsigned long'
|-FieldDecl 0x26db680 <line:56:5, col:13> col:13 ic 'BOOLEAN':'unsigned char'
|-FieldDecl 0x26db6e0 <line:57:5, col:13> col:13 rising_edge 'BOOLEAN':'unsigned char'
`-FieldDecl 0x26db740 <line:58:5, col:13> col:13 falling_edge 'BOOLEAN':'unsigned char'

Layout: <CGRecordLayout
  LLVMType:%struct.PERSISTENT1SHOT_COEFF_STRUCT = type { i32, i8, i8, i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26dcde8 <..\..\..\Model\Common\Header\Momentary_Switch.h:53:9, line:60:1> line:53:9 struct definition
|-FullComment 0x2e00278 <line:48:4, line:52:76>
| |-ParagraphComment 0x2e000a0 <line:48:4, line:49:4>
| | |-TextComment 0x2e00050 <line:48:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e00070 <line:49:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e000c0 <col:5, col:43> Text=" MOMENTARY_SWITCH_COEFF_STRUCT"
| |-ParagraphComment 0x2e00128 <line:50:1, col:4>
| | `-TextComment 0x2e00100 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e00148 <col:5, line:52:76> Name="brief"
|   `-ParagraphComment 0x2e00238 <line:50:11, line:52:76>
|     |-TextComment 0x2e00170 <line:50:11, col:55> Text=" Coefficients struct for the Momentary Switch"
|     |-TextComment 0x2e00190 <line:51:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e001b0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2e001d0 <col:21, col:37> Text="{HAP1-SDD-MC,773}"
|     `-TextComment 0x2e001f0 <line:52:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x26dcea0 <line:55:5, col:9> col:9 debounce_threshold 'U32':'unsigned long'
|-FieldDecl 0x26dcf00 <line:56:5, col:9> col:9 sustain_threshold 'U32':'unsigned long'
`-FieldDecl 0x26dcf60 <line:58:5, col:34> col:34 switch_opened_one_shot_coeff 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.MOMENTARY_SWITCH_COEFF_STRUCT = type { i32, i32, %struct.PERSISTENT1SHOT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bd0e28 <..\..\..\Model\Inner_Loop\Header/Input_Signal_Module.h:68:9, line:78:1> line:68:9 struct definition
|-FieldDecl 0x2bd0ee0 <line:70:5, col:35> col:35 EngageSwitch1 'MOMENTARY_SWITCH_COEFF_STRUCT':'MOMENTARY_SWITCH_COEFF_STRUCT'
|-FieldDecl 0x2bd0f40 <line:71:5, col:35> col:35 EngageSwitch2 'MOMENTARY_SWITCH_COEFF_STRUCT':'MOMENTARY_SWITCH_COEFF_STRUCT'
|-FieldDecl 0x2bd0fa0 <line:72:5, col:35> col:35 ChangeModeSwitch 'MOMENTARY_SWITCH_COEFF_STRUCT':'MOMENTARY_SWITCH_COEFF_STRUCT'
|-FieldDecl 0x2bd1000 <line:73:5, col:35> col:35 pciSwR_Switch 'MOMENTARY_SWITCH_COEFF_STRUCT':'MOMENTARY_SWITCH_COEFF_STRUCT'
|-FieldDecl 0x2bd1060 <line:74:5, col:35> col:35 pciSwL_Switch 'MOMENTARY_SWITCH_COEFF_STRUCT':'MOMENTARY_SWITCH_COEFF_STRUCT'
|-FieldDecl 0x2bd10c0 <line:75:5, col:35> col:35 pciSwF_Switch 'MOMENTARY_SWITCH_COEFF_STRUCT':'MOMENTARY_SWITCH_COEFF_STRUCT'
`-FieldDecl 0x2bd1120 <line:76:5, col:35> col:35 pciSwA_Switch 'MOMENTARY_SWITCH_COEFF_STRUCT':'MOMENTARY_SWITCH_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.STICKSWITCHSTATESENSING_COEFF_STRUCT = type { %struct.MOMENTARY_SWITCH_COEFF_STRUCT, %struct.MOMENTARY_SWITCH_COEFF_STRUCT, %struct.MOMENTARY_SWITCH_COEFF_STRUCT, %struct.MOMENTARY_SWITCH_COEFF_STRUCT, %struct.MOMENTARY_SWITCH_COEFF_STRUCT, %struct.MOMENTARY_SWITCH_COEFF_STRUCT, %struct.MOMENTARY_SWITCH_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bd1230 <..\..\..\Model\Inner_Loop\Header/Input_Signal_Module.h:80:9, line:84:1> line:80:9 struct definition
|-FieldDecl 0x2bd12f0 <line:81:5, col:34> col:34 cmdHAPtoEngage 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'
`-FieldDecl 0x2bd1350 <line:82:5, col:34> col:34 cmdHAPtoDisengage 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.ENGAGE_LOGIC_COEFF_STRUCT = type { %struct.PERSISTENT1SHOT_COEFF_STRUCT, %struct.PERSISTENT1SHOT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bd1490 <..\..\..\Model\Inner_Loop\Header/Input_Signal_Module.h:91:9, line:98:1> line:91:9 struct definition
|-FullComment 0x2e00500 <line:86:4, line:90:76>
| |-ParagraphComment 0x2e00328 <line:86:4, line:87:4>
| | |-TextComment 0x2e002d8 <line:86:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e002f8 <line:87:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e00348 <col:5, col:34> Text=" MCP_ISM_COEFF_STRUCT"
| |-ParagraphComment 0x2e003b0 <line:88:1, col:4>
| | `-TextComment 0x2e00388 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e003d0 <col:5, line:90:76> Name="brief"
|   `-ParagraphComment 0x2e004c0 <line:88:11, line:90:76>
|     |-TextComment 0x2e003f8 <line:88:11, col:66> Text=" Coefficient structure for an Input_Signal_Module block."
|     |-TextComment 0x2e00418 <line:89:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e00438 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2e00458 <col:24, col:40> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2e00478 <line:90:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2bd1570 <line:93:5, col:30> col:30 Roll_Actuator_FW 'ACTUATOR_FW_COEFF_STRUCT':'ACTUATOR_FW_COEFF_STRUCT'
|-FieldDecl 0x2bd15d0 <line:94:5, col:30> col:30 Pitch_Actuator_FW 'ACTUATOR_FW_COEFF_STRUCT':'ACTUATOR_FW_COEFF_STRUCT'
|-FieldDecl 0x2bd1650 <line:95:5, col:42> col:42 StickSwitchStateSensing 'STICKSWITCHSTATESENSING_COEFF_STRUCT':'STICKSWITCHSTATESENSING_COEFF_STRUCT'
`-FieldDecl 0x2bd16d0 <line:96:5, col:31> col:31 EngageLogic 'ENGAGE_LOGIC_COEFF_STRUCT':'ENGAGE_LOGIC_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.MCP_ISM_COEFF_STRUCT = type { %struct.ACTUATOR_FW_COEFF_STRUCT, %struct.ACTUATOR_FW_COEFF_STRUCT, %struct.STICKSWITCHSTATESENSING_COEFF_STRUCT, %struct.ENGAGE_LOGIC_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a50960 <..\..\..\Model\Common\Header/RateLimiterDynVF.h:57:9, line:61:1> line:57:9 struct definition
|-FullComment 0x2e00788 <line:52:4, line:56:76>
| |-ParagraphComment 0x2e005b0 <line:52:4, line:53:4>
| | |-TextComment 0x2e00560 <line:52:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e00580 <line:53:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e005d0 <col:5, col:43> Text=" RATELIMITERDYNVF_COEFF_STRUCT"
| |-ParagraphComment 0x2e00638 <line:54:1, col:4>
| | `-TextComment 0x2e00610 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e00658 <col:5, line:56:76> Name="brief"
|   `-ParagraphComment 0x2e00748 <line:54:11, line:56:76>
|     |-TextComment 0x2e00680 <line:54:11, col:44> Text=" Coeff struct for RateLimiterDynVF"
|     |-TextComment 0x2e006a0 <line:55:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e006c0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2e006e0 <col:21, col:37> Text="{HAP1-SDD-MC,xxx}"
|     `-TextComment 0x2e00700 <line:56:1, col:76> Text="   ======================================================================== "
`-FieldDecl 0x2a50a20 <line:59:5, col:9> col:9 ts 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.RATELIMITERDYNVF_COEFF_STRUCT = type { float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a52ac8 <..\..\..\Model\Common\Header\G_Limiter.h:58:9, line:65:1> line:58:9 struct definition
|-FullComment 0x2e00a38 <line:53:4, line:57:76>
| |-ParagraphComment 0x2e00838 <line:53:4, line:54:4>
| | |-TextComment 0x2e007e8 <line:53:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e00808 <line:54:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e00858 <col:5, col:36> Text=" G_LIMITER_COEFF_STRUCT"
| |-ParagraphComment 0x2e008c0 <line:55:1, col:4>
| | `-TextComment 0x2e00898 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e008e0 <col:5, line:57:76> Name="brief"
|   `-ParagraphComment 0x2e009f8 <line:55:11, line:57:76>
|     |-TextComment 0x2e00908 <line:55:11, col:55> Text=" Coefficient structure for a G_Limiter block."
|     |-TextComment 0x2e00928 <line:56:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e00970 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2e00990 <col:19, col:35> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2e009b0 <line:57:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a52b80 <line:60:5, col:35> col:35 ratelimiterdynvf 'RATELIMITERDYNVF_COEFF_STRUCT':'RATELIMITERDYNVF_COEFF_STRUCT'
|-FieldDecl 0x2a52be0 <line:62:5, col:9> col:9 g_limit 'F32':'float'
`-FieldDecl 0x2a52c40 <line:63:5, col:9> col:9 max_rate_limit 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.G_LIMITER_COEFF_STRUCT = type { %struct.RATELIMITERDYNVF_COEFF_STRUCT, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a45fb8 <..\..\..\Common\Header\Linterp.h:81:9, line:88:1> line:81:9 struct definition
|-FullComment 0x2e00d90 <line:70:4, line:80:76>
| |-ParagraphComment 0x2e00ae8 <line:70:4, line:71:4>
| | |-TextComment 0x2e00a98 <line:70:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e00ab8 <line:71:1, col:4> Text="    "
| |-BlockCommandComment 0x2e00b08 <col:5, col:101> Name="brief"
| | `-ParagraphComment 0x2e00b58 <col:11, col:101>
| |   `-TextComment 0x2e00b30 <col:11, col:101> Text=" This structure defines a linear equation for each region, with the formula:  y = m * x + b"
| |-ParagraphComment 0x2e00c18 <line:73:1, line:76:44>
| | |-TextComment 0x2e00b78 <line:73:1, col:9> Text="    where"
| | |-TextComment 0x2e00b98 <line:74:1, col:26> Text="        y = linterp result"
| | |-TextComment 0x2e00bb8 <line:75:1, col:27> Text="        m = slope in region"
| | `-TextComment 0x2e00bd8 <line:76:1, col:44> Text="        x = distance into the current region"
| `-ParagraphComment 0x2e00d50 <line:78:1, line:80:76>
|   |-TextComment 0x2e00c38 <line:78:1, col:4> Text="    "
|   |-InlineCommandComment 0x2e00c58 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2e00c78 <col:16, col:34> Text="{HAP1-SDD-COM, 927}"
|   |-TextComment 0x2e00c98 <line:79:1, col:4> Text="    "
|   |-InlineCommandComment 0x2e00cb8 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2e00cd8 <col:16, col:34> Text="{HAP1-SDD-COM, 921}"
|   `-TextComment 0x2e00cf8 <line:80:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a46070 <line:83:5, col:9> col:9 breakpoint 'F32':'float'
|-FieldDecl 0x2a460d0 <line:84:5, col:9> col:9 value 'F32':'float'
`-FieldDecl 0x2a46130 <line:85:5, col:9> col:9 slope 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.LINTERP_REGION_STRUCT = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a462a0 <..\..\..\Common\Header\Linterp.h:99:9, line:104:1> line:99:9 struct definition
|-FullComment 0x2e01110 <line:91:4, line:98:76>
| |-ParagraphComment 0x2e00e40 <line:91:4, line:92:4>
| | |-TextComment 0x2e00df0 <line:91:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e00e10 <line:92:1, col:4> Text="    "
| |-BlockCommandComment 0x2e00e60 <col:5, col:97> Name="brief"
| | `-ParagraphComment 0x2e00eb0 <col:11, col:97>
| |   `-TextComment 0x2e00e88 <col:11, col:97> Text=" This structure defines the number and set of linear equations for linear interpolation"
| `-ParagraphComment 0x2e010d8 <line:94:1, line:98:76>
|   |-TextComment 0x2e00ed0 <line:94:1, col:4> Text="    "
|   |-InlineCommandComment 0x2e00ef0 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2e00f10 <col:16, col:34> Text="{HAP1-SDD-COM, 917}"
|   |-TextComment 0x2e00f30 <line:95:1, col:4> Text="    "
|   |-InlineCommandComment 0x2e00f50 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2e00f70 <col:16, col:34> Text="{HAP1-SDD-COM, 920}"
|   |-TextComment 0x2e00f90 <line:96:1, col:4> Text="    "
|   |-InlineCommandComment 0x2e00fb0 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2e00fd0 <col:16, col:34> Text="{HAP1-SDD-COM, 928}"
|   |-TextComment 0x2e00ff0 <line:97:1, col:4> Text="    "
|   |-InlineCommandComment 0x2e01010 <col:5, col:15> Name="CommonReqt" RenderNormal
|   |-TextComment 0x2e01030 <col:16, col:34> Text="{HAP1-SDD-COM, 934}"
|   `-TextComment 0x2e01050 <line:98:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a46360 <line:101:5, col:8> col:8 n_regions 'U8':'unsigned char'
`-FieldDecl 0x2a464f8 <line:102:5, col:52> col:27 regions 'LINTERP_REGION_STRUCT [20]'

Layout: <CGRecordLayout
  LLVMType:%struct.LINTERP_STRUCT = type { i8, [20 x %struct.LINTERP_REGION_STRUCT] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a41678 <..\..\..\Model\Common\Header/ReIntICH.h:53:9, line:57:1> line:53:9 struct definition
|-FullComment 0x2e01398 <line:48:4, line:52:76>
| |-ParagraphComment 0x2e011c0 <line:48:4, line:49:4>
| | |-TextComment 0x2e01170 <line:48:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e01190 <line:49:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e011e0 <col:5, col:35> Text=" REINTICH_COEFF_STRUCT"
| |-ParagraphComment 0x2e01248 <line:50:1, col:4>
| | `-TextComment 0x2e01220 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e01268 <col:5, line:52:76> Name="brief"
|   `-ParagraphComment 0x2e01358 <line:50:11, line:52:76>
|     |-TextComment 0x2e01290 <line:50:11, col:43> Text=" Coefficients struct for ReIntICH"
|     |-TextComment 0x2e012b0 <line:51:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e012d0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2e012f0 <col:21, col:37> Text="{HAP1-SDD-MC,529}"
|     `-TextComment 0x2e01310 <line:52:1, col:76> Text="   ======================================================================== "
`-FieldDecl 0x2a41730 <line:55:5, col:9> col:9 K_Ts 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.REINTICH_COEFF_STRUCT = type { float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a46960 <..\..\..\Model\Common\Header/SaturationVF.h:58:9, line:64:1> line:58:9 struct definition
|-FullComment 0x2e01620 <line:53:4, line:57:76>
| |-ParagraphComment 0x2e01448 <line:53:4, line:54:4>
| | |-TextComment 0x2e013f8 <line:53:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e01418 <line:54:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e01468 <col:5, col:39> Text=" SATURATIONVF_COEFF_STRUCT"
| |-ParagraphComment 0x2e014d0 <line:55:1, col:4>
| | `-TextComment 0x2e014a8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e014f0 <col:5, line:57:76> Name="brief"
|   `-ParagraphComment 0x2e015e0 <line:55:11, line:57:76>
|     |-TextComment 0x2e01518 <line:55:11, col:47> Text=" Coefficients struct for SaturationVF"
|     |-TextComment 0x2e01538 <line:56:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e01558 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2e01578 <col:21, col:37> Text="{HAP1-SDD-MC,xxx}"
|     `-TextComment 0x2e01598 <line:57:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a46a20 <line:60:5, col:9> col:9 epsilon 'F32':'float'
|-FieldDecl 0x2a46a80 <line:61:5, col:9> col:9 upper_sat_limit 'F32':'float'
`-FieldDecl 0x2a46ae0 <line:62:5, col:9> col:9 lower_sat_limit 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.SATURATIONVF_COEFF_STRUCT = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a490c8 <..\..\..\Model\Common\Header\ReIntICHS.h:70:9, line:78:1> line:70:9 struct definition
|-FullComment 0x2e018a8 <line:65:4, line:69:76>
| |-ParagraphComment 0x2e016d0 <line:65:4, line:66:4>
| | |-TextComment 0x2e01680 <line:65:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e016a0 <line:66:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e016f0 <col:5, col:36> Text=" REINTICHS_COEFF_STRUCT"
| |-ParagraphComment 0x2e01758 <line:67:1, col:4>
| | `-TextComment 0x2e01730 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e01778 <col:5, line:69:76> Name="brief"
|   `-ParagraphComment 0x2e01868 <line:67:11, line:69:76>
|     |-TextComment 0x2e017a0 <line:67:11, col:44> Text=" Coefficients struct for ReIntICHS"
|     |-TextComment 0x2e017c0 <line:68:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e017e0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2e01800 <col:21, col:38> Text="{HAP1-SDD-MC,1026}"
|     `-TextComment 0x2e01820 <line:69:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a49180 <line:72:5, col:28> col:28 integrator_coeff 'REINTICH_COEFF_STRUCT':'REINTICH_COEFF_STRUCT'
|-FieldDecl 0x2a4a200 <line:73:5, col:31> col:31 sat_coeff 'SATURATIONVF_COEFF_STRUCT':'SATURATIONVF_COEFF_STRUCT'
|-FieldDecl 0x2a4a260 <line:75:5, col:9> col:9 K_Ts 'F32':'float'
`-FieldDecl 0x2a4a2c0 <line:76:5, col:9> col:9 response_bias 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.REINTICHS_COEFF_STRUCT = type { %struct.REINTICH_COEFF_STRUCT, %struct.SATURATIONVF_COEFF_STRUCT, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a4c528 <..\..\..\Model\Inner_Loop\Header/Attitude_Controller.h:76:9, line:85:1> line:76:9 struct definition
|-FullComment 0x2e01ba8 <line:70:4, line:75:76>
| |-ParagraphComment 0x2e01958 <line:70:4, line:71:4>
| | |-TextComment 0x2e01908 <line:70:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e01928 <line:71:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e01978 <col:5, col:46> Text=" ATTITUDE_CONTROLLER_COEFF_STRUCT"
| |-ParagraphComment 0x2e019e0 <line:72:1, col:4>
| | `-TextComment 0x2e019b8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e01a00 <col:5, line:75:76> Name="brief"
|   `-ParagraphComment 0x2e01b68 <line:72:11, line:75:76>
|     |-TextComment 0x2e01a28 <line:72:11, col:73> Text=" Coefficient structure for a generic Attitude_Controller block."
|     |-TextComment 0x2e01a48 <line:73:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e01a68 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2e01a88 <col:19, col:35> Text="{HAP1-SDD-IL,504}"
|     |-TextComment 0x2e01aa8 <line:74:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e01ac8 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2e01ae8 <col:19, col:35> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2e01b08 <line:75:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a4c5e0 <line:78:5, col:20> col:20 k_attitude_to_ang_accel 'LINTERP_STRUCT':'LINTERP_STRUCT'
|-FieldDecl 0x2a4c640 <line:79:5, col:20> col:20 k_rate_to_ang_accel 'LINTERP_STRUCT':'LINTERP_STRUCT'
|-FieldDecl 0x2a4c6a0 <line:80:5, col:9> col:9 k_attitude_to_ang_accel_integral 'F32':'float'
|-FieldDecl 0x2a4c700 <line:81:5, col:9> col:9 k_rate_to_ang_accel_cross 'F32':'float'
`-FieldDecl 0x2a4c760 <line:83:5, col:28> col:28 reintichs 'REINTICHS_COEFF_STRUCT':'REINTICHS_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.ATTITUDE_CONTROLLER_COEFF_STRUCT = type { %struct.LINTERP_STRUCT, %struct.LINTERP_STRUCT, float, float, %struct.REINTICHS_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a54c58 <..\..\..\Model\Common\Header\Test_Port.h:58:9, line:63:1> line:58:9 struct definition
|-FullComment 0x2c6f130 <line:53:4, line:57:76>
| |-ParagraphComment 0x2e01c58 <line:53:4, line:54:4>
| | |-TextComment 0x2e01c08 <line:53:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e01c28 <line:54:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e01c78 <col:5, col:36> Text=" TEST_PORT_COEFF_STRUCT"
| |-ParagraphComment 0x2e01ce0 <line:55:1, col:4>
| | `-TextComment 0x2e01cb8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c6f000 <col:5, line:57:76> Name="brief"
|   `-ParagraphComment 0x2c6f0f0 <line:55:11, line:57:76>
|     |-TextComment 0x2c6f028 <line:55:11, col:44> Text=" Coefficients struct for Test_Port"
|     |-TextComment 0x2c6f048 <line:56:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6f068 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c6f088 <col:21, col:37> Text="{HAP1-SDD-MC,992}"
|     `-TextComment 0x2c6f0a8 <line:57:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a54d10 <line:60:5, col:9> col:9 gain 'F32':'float'
`-FieldDecl 0x2a54d70 <line:61:5, col:9> col:9 bias 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.TEST_PORT_COEFF_STRUCT = type { float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a68fc0 <..\..\..\Model\Inner_Loop\Header/Cyclic_Feedback.h:80:9, line:94:1> line:80:9 struct definition
|-FullComment 0x2c6f430 <line:74:4, line:79:76>
| |-ParagraphComment 0x2c6f1e0 <line:74:4, line:75:4>
| | |-TextComment 0x2c6f190 <line:74:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c6f1b0 <line:75:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c6f200 <col:5, col:42> Text=" CYCLIC_FEEDBACK_COEFF_STRUCT"
| |-ParagraphComment 0x2c6f268 <line:76:1, col:4>
| | `-TextComment 0x2c6f240 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c6f288 <col:5, line:79:76> Name="brief"
|   `-ParagraphComment 0x2c6f3f0 <line:76:11, line:79:76>
|     |-TextComment 0x2c6f2b0 <line:76:11, col:61> Text=" Coefficient structure for a Cyclic Feedback block."
|     |-TextComment 0x2c6f2d0 <line:77:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6f2f0 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c6f310 <col:19, col:35> Text="{HAP1-SDD-IL,662}"
|     |-TextComment 0x2c6f330 <line:78:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6f350 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c6f370 <col:19, col:35> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2c6f390 <line:79:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a69080 <line:83:5, col:9> col:9 rate_limiter_lower_limit 'F32':'float'
|-FieldDecl 0x2a690e0 <line:84:5, col:9> col:9 rate_limiter_upper_limit 'F32':'float'
|-FieldDecl 0x2a69140 <line:86:5, col:28> col:28 g_limiter 'G_LIMITER_COEFF_STRUCT':'G_LIMITER_COEFF_STRUCT'
|-FieldDecl 0x2a691a0 <line:88:5, col:38> col:38 Roll_AttitudeController 'ATTITUDE_CONTROLLER_COEFF_STRUCT':'ATTITUDE_CONTROLLER_COEFF_STRUCT'
|-FieldDecl 0x2a69200 <line:89:5, col:38> col:38 Pitch_AttitudeController 'ATTITUDE_CONTROLLER_COEFF_STRUCT':'ATTITUDE_CONTROLLER_COEFF_STRUCT'
|-FieldDecl 0x2a69260 <line:91:5, col:28> col:28 roll_testport 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
`-FieldDecl 0x2a692c0 <line:92:5, col:28> col:28 pitch_testport 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.CYCLIC_FEEDBACK_COEFF_STRUCT = type { float, float, %struct.G_LIMITER_COEFF_STRUCT, %struct.ATTITUDE_CONTROLLER_COEFF_STRUCT, %struct.ATTITUDE_CONTROLLER_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a7d698 <..\..\..\Model\Inner_Loop\Header/UARModeLogic.h:57:9, line:71:1> line:57:9 struct definition
|-FullComment 0x2c6f730 <line:51:4, line:56:76>
| |-ParagraphComment 0x2c6f4e0 <line:51:4, line:52:4>
| | |-TextComment 0x2c6f490 <line:51:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c6f4b0 <line:52:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c6f500 <col:5, col:39> Text=" UARMODELOGIC_COEFF_STRUCT"
| |-ParagraphComment 0x2c6f568 <line:53:1, col:4>
| | `-TextComment 0x2c6f540 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c6f588 <col:5, line:56:76> Name="brief"
|   `-ParagraphComment 0x2c6f6f0 <line:53:11, line:56:76>
|     |-TextComment 0x2c6f5b0 <line:53:11, col:60> Text=" Coefficient structure for a UAR Mode Logic block."
|     |-TextComment 0x2c6f5d0 <line:54:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6f5f0 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2c6f610 <col:24, col:40> Text="{HAP1-SDD-IL,896}"
|     |-TextComment 0x2c6f630 <line:55:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6f650 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2c6f670 <col:24, col:40> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2c6f690 <line:56:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a7d750 <line:59:5, col:9> col:9 phi_upper_limit 'F32':'float'
|-FieldDecl 0x2a7d7b0 <line:60:5, col:9> col:9 phi_lower_limit 'F32':'float'
|-FieldDecl 0x2a7d810 <line:61:5, col:9> col:9 theta_upper_limit 'F32':'float'
|-FieldDecl 0x2a7d870 <line:62:5, col:9> col:9 theta_lower_limit 'F32':'float'
|-FieldDecl 0x2a7d8d0 <line:63:5, col:9> col:9 p_filt_upper_limit 'F32':'float'
|-FieldDecl 0x2a7d930 <line:64:5, col:9> col:9 p_filt_lower_limit 'F32':'float'
|-FieldDecl 0x2a7d990 <line:65:5, col:9> col:9 q_filt_upper_limit 'F32':'float'
|-FieldDecl 0x2a7d9f0 <line:66:5, col:9> col:9 q_filt_lower_limit 'F32':'float'
`-FieldDecl 0x2a7da50 <line:68:5, col:34> col:34 uar_hold_p1shot 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.UARMODELOGIC_COEFF_STRUCT = type { float, float, float, float, float, float, float, float, %struct.PERSISTENT1SHOT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a7fc78 <..\..\..\Model\Inner_Loop\Header/MCP_Control_Producer.h:74:9, line:79:1> line:74:9 struct definition
|-FullComment 0x2c6fa30 <line:68:4, line:73:76>
| |-ParagraphComment 0x2c6f7e0 <line:68:4, line:69:4>
| | |-TextComment 0x2c6f790 <line:68:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c6f7b0 <line:69:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c6f800 <col:5, col:47> Text=" MCP_CONTROL_PRODUCER_COEFF_STRUCT"
| |-ParagraphComment 0x2c6f868 <line:70:1, col:4>
| | `-TextComment 0x2c6f840 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c6f888 <col:5, line:73:76> Name="brief"
|   `-ParagraphComment 0x2c6f9f0 <line:70:11, line:73:76>
|     |-TextComment 0x2c6f8b0 <line:70:11, col:67> Text=" Coefficient structure for an MCP Control Producer block."
|     |-TextComment 0x2c6f8d0 <line:71:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6f8f0 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2c6f910 <col:24, col:40> Text="{HAP1-SDD-IL,853}"
|     |-TextComment 0x2c6f930 <line:72:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6f950 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c6f970 <col:19, col:35> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2c6f990 <line:73:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a7fd30 <line:76:5, col:34> col:34 cyclic_feedback 'CYCLIC_FEEDBACK_COEFF_STRUCT':'CYCLIC_FEEDBACK_COEFF_STRUCT'
`-FieldDecl 0x2a7fd90 <line:77:5, col:31> col:31 uar_mode_logic 'UARMODELOGIC_COEFF_STRUCT':'UARMODELOGIC_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.MCP_CONTROL_PRODUCER_COEFF_STRUCT = type { %struct.CYCLIC_FEEDBACK_COEFF_STRUCT, %struct.UARMODELOGIC_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c157f0 <..\..\..\Model\Common\Header\Tenth_Order_Average.h:65:9, line:69:1> line:65:9 struct definition
|-FullComment 0x2c6fcb8 <line:60:4, line:64:76>
| |-ParagraphComment 0x2c6fae0 <line:60:4, line:61:4>
| | |-TextComment 0x2c6fa90 <line:60:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c6fab0 <line:61:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c6fb00 <col:5, col:46> Text=" TENTH_ORDER_AVERAGE_COEFF_STRUCT"
| |-ParagraphComment 0x2c6fb68 <line:62:1, col:4>
| | `-TextComment 0x2c6fb40 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c6fb88 <col:5, line:64:76> Name="brief"
|   `-ParagraphComment 0x2c6fc78 <line:62:11, line:64:76>
|     |-TextComment 0x2c6fbb0 <line:62:11, col:54> Text=" Coefficients struct for Tenth Order Average"
|     |-TextComment 0x2c6fbd0 <line:63:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6fbf0 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c6fc10 <col:21, col:37> Text="{HAP1-SDD-MC,463}"
|     `-TextComment 0x2c6fc30 <line:64:1, col:76> Text="   ======================================================================== "
`-FieldDecl 0x2c158b0 <line:67:5, col:9> col:9 sample_interval 'U32':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%struct.TENTH_ORDER_AVERAGE_COEFF_STRUCT = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2c18438 <..\..\..\Model\Common\Header\FirstOrderFilter.h:54:9, line:62:1> line:54:9 struct definition
|-FullComment 0x2c6ff40 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c6fd68 <line:49:4, line:50:4>
| | |-TextComment 0x2c6fd18 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c6fd38 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c6fd88 <col:5, col:43> Text=" FIRSTORDERFILTER_COEFF_STRUCT"
| |-ParagraphComment 0x2c6fdf0 <line:51:1, col:4>
| | `-TextComment 0x2c6fdc8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c6fe10 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c6ff00 <line:51:11, line:53:76>
|     |-TextComment 0x2c6fe38 <line:51:11, col:53> Text=" Coefficients struct for First Order Filter"
|     |-TextComment 0x2c6fe58 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c6fe78 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c6fe98 <col:21, col:37> Text="{HAP1-SDD-MC,474}"
|     `-TextComment 0x2c6feb8 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2c184f0 <line:56:5, col:9> col:9 a1 'F32':'float'
|-FieldDecl 0x2c18550 <line:57:5, col:9> col:9 b0 'F32':'float'
|-FieldDecl 0x2c185b0 <line:58:5, col:9> col:9 b1 'F32':'float'
|-FieldDecl 0x2c18610 <line:59:5, col:9> col:9 k1 'F32':'float'
`-FieldDecl 0x2c18670 <line:60:5, col:9> col:9 k2 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.FIRSTORDERFILTER_COEFF_STRUCT = type { float, float, float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bc18e8 <..\..\..\Model\Inner_Loop\Header/Monitor_Command.h:54:9, line:62:1> line:54:9 struct definition
|-FullComment 0x2c701c8 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c6fff0 <line:49:4, line:50:4>
| | |-TextComment 0x2c6ffa0 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c6ffc0 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c70010 <col:5, col:42> Text=" MONITOR_COMMAND_COEFF_STRUCT"
| |-ParagraphComment 0x2c70078 <line:51:1, col:4>
| | `-TextComment 0x2c70050 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c70098 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c70188 <line:51:11, line:53:76>
|     |-TextComment 0x2c700c0 <line:51:11, col:55> Text=" coefficient struct for monitor command block"
|     |-TextComment 0x2c700e0 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c70100 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c70120 <col:19, col:35> Text="{HAP1-SDD-IL,543}"
|     `-TextComment 0x2c70140 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2bc19a0 <line:56:5, col:41> col:41 p1shot_coeff 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'
|-FieldDecl 0x2bc1a00 <line:57:5, col:41> col:41 toa_coeff 'TENTH_ORDER_AVERAGE_COEFF_STRUCT':'TENTH_ORDER_AVERAGE_COEFF_STRUCT'
|-FieldDecl 0x2bc1a60 <line:58:5, col:41> col:41 wash_out_coeff 'FIRSTORDERFILTER_COEFF_STRUCT':'FIRSTORDERFILTER_COEFF_STRUCT'
|-FieldDecl 0x2bc1ac0 <line:59:5, col:41> col:41 wof_l_limit 'F32':'float'
`-FieldDecl 0x2bc1b20 <line:60:5, col:41> col:41 wof_u_limit 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.MONITOR_COMMAND_COEFF_STRUCT = type { %struct.PERSISTENT1SHOT_COEFF_STRUCT, %struct.TENTH_ORDER_AVERAGE_COEFF_STRUCT, %struct.FIRSTORDERFILTER_COEFF_STRUCT, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bc3408 <..\..\..\Model\Inner_Loop\Header/Monitor.h:52:9, line:61:1> line:52:9 struct definition
|-FullComment 0x2c70450 <line:47:4, line:51:76>
| |-ParagraphComment 0x2c70278 <line:47:4, line:48:4>
| | |-TextComment 0x2c70228 <line:47:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c70248 <line:48:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c70298 <col:5, col:34> Text=" MONITOR_COEFF_STRUCT"
| |-ParagraphComment 0x2c70300 <line:49:1, col:4>
| | `-TextComment 0x2c702d8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c70320 <col:5, line:51:76> Name="brief"
|   `-ParagraphComment 0x2c70410 <line:49:11, line:51:76>
|     |-TextComment 0x2c70348 <line:49:11, col:47> Text=" coefficient struct for monitor block"
|     |-TextComment 0x2c70368 <line:50:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c70388 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c703a8 <col:19, col:35> Text="{HAP1-SDD-IL,535}"
|     `-TextComment 0x2c703c8 <line:51:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2bc34c0 <line:54:5, col:9> col:9 rate_l_limit 'F32':'float'
|-FieldDecl 0x2bc3520 <line:55:5, col:9> col:9 rate_u_limit 'F32':'float'
|-FieldDecl 0x2bc3580 <line:56:5, col:9> col:9 attitude_l_limit 'F32':'float'
|-FieldDecl 0x2bc35e0 <line:57:5, col:9> col:9 attitude_u_limit 'F32':'float'
|-FieldDecl 0x2bc3640 <line:58:5, col:34> col:34 adp_cmd_coeff 'MONITOR_COMMAND_COEFF_STRUCT':'MONITOR_COMMAND_COEFF_STRUCT'
`-FieldDecl 0x2bc36a0 <line:59:5, col:34> col:34 act_pos_coeff 'MONITOR_COMMAND_COEFF_STRUCT':'MONITOR_COMMAND_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.MONITOR_COEFF_STRUCT = type { float, float, float, float, %struct.MONITOR_COMMAND_COEFF_STRUCT, %struct.MONITOR_COMMAND_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bc5e28 <..\..\..\Model\Inner_Loop\Header/Inner_Loop_Monitors.h:52:9, line:60:1> line:52:9 struct definition
|-FullComment 0x2c706d8 <line:47:4, line:51:76>
| |-ParagraphComment 0x2c70500 <line:47:4, line:48:4>
| | |-TextComment 0x2c704b0 <line:47:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c704d0 <line:48:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c70520 <col:5, col:46> Text=" INNER_LOOP_MONITORS_COEFF_STRUCT"
| |-ParagraphComment 0x2c70588 <line:49:1, col:4>
| | `-TextComment 0x2c70560 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c705a8 <col:5, line:51:76> Name="brief"
|   `-ParagraphComment 0x2c70698 <line:49:11, line:51:76>
|     |-TextComment 0x2c705d0 <line:49:11, col:60> Text=" coefficients struct for inner loop monitors block"
|     |-TextComment 0x2c705f0 <line:50:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c70610 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2c70630 <col:24, col:40> Text="{HAP1-SDD-IL,713}"
|     `-TextComment 0x2c70650 <line:51:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2bc5ee0 <line:54:5, col:37> col:37 roll_coeff 'MONITOR_COEFF_STRUCT':'MONITOR_COEFF_STRUCT'
|-FieldDecl 0x2bc5f40 <line:55:5, col:37> col:37 pitch_coeff 'MONITOR_COEFF_STRUCT':'MONITOR_COEFF_STRUCT'
|-FieldDecl 0x2bc5fa0 <line:56:5, col:37> col:37 lf_l_limit 'F32':'float'
`-FieldDecl 0x2bc6000 <line:58:5, col:37> col:37 pos_coeff 'PERSISTENT1SHOT_COEFF_STRUCT':'PERSISTENT1SHOT_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.INNER_LOOP_MONITORS_COEFF_STRUCT = type { %struct.MONITOR_COEFF_STRUCT, %struct.MONITOR_COEFF_STRUCT, float, %struct.PERSISTENT1SHOT_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a6d270 <..\..\..\Model\Common\Header\ScheduledRateLimiter.h:54:9, line:61:1> line:54:9 struct definition
|-FullComment 0x2c70960 <line:49:4, line:53:76>
| |-ParagraphComment 0x2c70788 <line:49:4, line:50:4>
| | |-TextComment 0x2c70738 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c70758 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c707a8 <col:5, col:47> Text=" SCHEDULEDRATELIMITER_COEFF_STRUCT"
| |-ParagraphComment 0x2c70810 <line:51:1, col:4>
| | `-TextComment 0x2c707e8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c70830 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2c70920 <line:51:11, line:53:76>
|     |-TextComment 0x2c70858 <line:51:11, col:61> Text=" Coefficients struct for the Scheduled Rate Limiter"
|     |-TextComment 0x2c70878 <line:52:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c70898 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c708b8 <col:21, col:37> Text="{HAP1-SDD-MC,835}"
|     `-TextComment 0x2c708d8 <line:53:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a6d330 <line:56:5, col:20> col:20 upper_linterp 'LINTERP_STRUCT':'LINTERP_STRUCT'
|-FieldDecl 0x2a6d390 <line:57:5, col:20> col:20 lower_linterp 'LINTERP_STRUCT':'LINTERP_STRUCT'
`-FieldDecl 0x2a6d3f0 <line:59:5, col:9> col:9 ts 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.SCHEDULEDRATELIMITER_COEFF_STRUCT = type { %struct.LINTERP_STRUCT, %struct.LINTERP_STRUCT, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a71148 <..\..\..\Model\Common\Header\SaturationDynVF.h:59:9, line:63:1> line:59:9 struct definition
|-FullComment 0x2c70be8 <line:54:4, line:58:76>
| |-ParagraphComment 0x2c70a10 <line:54:4, line:55:4>
| | |-TextComment 0x2c709c0 <line:54:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c709e0 <line:55:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c70a30 <col:5, col:42> Text=" SATURATIONDYNVF_COEFF_STRUCT"
| |-ParagraphComment 0x2c70a98 <line:56:1, col:4>
| | `-TextComment 0x2c70a70 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c70ab8 <col:5, line:58:76> Name="brief"
|   `-ParagraphComment 0x2c70ba8 <line:56:11, line:58:76>
|     |-TextComment 0x2c70ae0 <line:56:11, col:50> Text=" Coefficients struct for SaturationDynVF"
|     |-TextComment 0x2c70b00 <line:57:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c70b20 <col:5, col:20> Name="ModelCommonReqt" RenderNormal
|     |-TextComment 0x2c70b40 <col:21, col:37> Text="{HAP1-SDD-MC,xxx}"
|     `-TextComment 0x2c70b60 <line:58:1, col:76> Text="   ======================================================================== "
`-FieldDecl 0x2a71200 <line:61:5, col:9> col:9 epsilon 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.SATURATIONDYNVF_COEFF_STRUCT = type { float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a72d18 <..\..\..\Model\Inner_Loop\Header\Servo_Loop.h:74:9, line:89:1> line:74:9 struct definition
|-FullComment 0x2c70ee8 <line:68:4, line:73:76>
| |-ParagraphComment 0x2c70c98 <line:68:4, line:69:4>
| | |-TextComment 0x2c70c48 <line:68:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c70c68 <line:69:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c70cb8 <col:5, col:37> Text=" SERVO_LOOP_COEFF_STRUCT"
| |-ParagraphComment 0x2c70d20 <line:70:1, col:4>
| | `-TextComment 0x2c70cf8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2c70d40 <col:5, line:73:76> Name="brief"
|   `-ParagraphComment 0x2c70ea8 <line:70:11, line:73:76>
|     |-TextComment 0x2c70d68 <line:70:11, col:51> Text=" coefficients struct for servo loop block"
|     |-TextComment 0x2c70d88 <line:71:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c70da8 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c70dc8 <col:19, col:35> Text="{HAP1-SDD-IL,479}"
|     |-TextComment 0x2c70de8 <line:72:1, col:4> Text="    "
|     |-InlineCommandComment 0x2c70e08 <col:5, col:18> Name="InnerLoopReqt" RenderNormal
|     |-TextComment 0x2c70e28 <col:19, col:35> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2c70e48 <line:73:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a72dd0 <line:76:5, col:28> col:28 testport_case1 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2a72e30 <line:77:5, col:34> col:34 SaturationDynVF 'SATURATIONDYNVF_COEFF_STRUCT':'SATURATIONDYNVF_COEFF_STRUCT'
|-FieldDecl 0x2a72e90 <line:78:5, col:28> col:28 ReInt_ICHS 'REINTICHS_COEFF_STRUCT':'REINTICHS_COEFF_STRUCT'
|-FieldDecl 0x2a72ef0 <line:80:5, col:9> col:9 k_ts 'F32':'float'
|-FieldDecl 0x2a72f50 <line:81:5, col:9> col:9 k 'F32':'float'
|-FieldDecl 0x2a72fb0 <line:82:5, col:9> col:9 k2 'F32':'float'
|-FieldDecl 0x2a73060 <line:83:5, col:9> col:9 k3 'F32':'float'
|-FieldDecl 0x2a730c0 <line:84:5, col:9> col:9 k4 'F32':'float'
|-FieldDecl 0x2a73120 <line:85:5, col:9> col:9 max_current 'F32':'float'
|-FieldDecl 0x2a73180 <line:86:5, col:9> col:9 rate_limiter_upper_limit 'F32':'float'
`-FieldDecl 0x2a731e0 <line:87:5, col:9> col:9 rate_limiter_lower_limit 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.SERVO_LOOP_COEFF_STRUCT = type { %struct.TEST_PORT_COEFF_STRUCT, %struct.SATURATIONDYNVF_COEFF_STRUCT, %struct.REINTICHS_COEFF_STRUCT, float, float, float, float, float, float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2a76b88 <..\..\..\Model\Inner_Loop\Header/Cyclic_Servo_Controller.h:56:9, line:81:1> line:56:9 struct definition
|-FullComment 0x2e01ea8 <line:51:4, line:55:76>
| |-ParagraphComment 0x2c70f98 <line:51:4, line:52:4>
| | |-TextComment 0x2c70f48 <line:51:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2c70f68 <line:52:1, col:4> Text="    "
| |-VerbatimLineComment 0x2c70fb8 <col:5, col:50> Text=" CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT"
| |-ParagraphComment 0x2e01d58 <line:53:1, col:4>
| | `-TextComment 0x2e01d30 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e01d78 <col:5, line:55:76> Name="brief"
|   `-ParagraphComment 0x2e01e68 <line:53:11, line:55:76>
|     |-TextComment 0x2e01da0 <line:53:11, col:65> Text=" Coefficient struct for a cyclic servo controller block"
|     |-TextComment 0x2e01dc0 <line:54:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e01de0 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2e01e00 <col:24, col:40> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2e01e20 <line:55:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2a76c40 <line:58:5, col:28> col:28 roll_input_testport_coeff 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2a76ca0 <line:59:5, col:28> col:28 pitch_input_testport_coeff 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2a76d00 <line:61:5, col:39> col:39 roll_scheduledRL_coeff 'SCHEDULEDRATELIMITER_COEFF_STRUCT':'SCHEDULEDRATELIMITER_COEFF_STRUCT'
|-FieldDecl 0x2a76d60 <line:62:5, col:39> col:39 pitch_scheduledRL_coeff 'SCHEDULEDRATELIMITER_COEFF_STRUCT':'SCHEDULEDRATELIMITER_COEFF_STRUCT'
|-FieldDecl 0x2a76dc0 <line:64:5, col:28> col:28 roll_unlimited_testport_coeff 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2a76e20 <line:65:5, col:28> col:28 pitch_unlimited_testport_coeff 'TEST_PORT_COEFF_STRUCT':'TEST_PORT_COEFF_STRUCT'
|-FieldDecl 0x2a76e80 <line:67:5, col:9> col:9 roll_rigging_gain 'F32':'float'
|-FieldDecl 0x2a76ee0 <line:68:5, col:9> col:9 pitch_rigging_gain 'F32':'float'
|-FieldDecl 0x2a76f40 <line:69:5, col:9> col:9 inv_roll_rigging_gain 'F32':'float'
|-FieldDecl 0x2a76fa0 <line:70:5, col:9> col:9 inv_pitch_rigging_gain 'F32':'float'
|-FieldDecl 0x2a77000 <line:73:5, col:9> col:9 sin_wave_frequency 'F32':'float'
|-FieldDecl 0x2a780b0 <line:74:5, col:9> col:9 sin_wave_amplitude 'F32':'float'
|-FieldDecl 0x2a78110 <line:78:5, col:29> col:29 roll_servo_loop_coeff 'SERVO_LOOP_COEFF_STRUCT':'SERVO_LOOP_COEFF_STRUCT'
`-FieldDecl 0x2a78170 <line:79:5, col:29> col:29 pitch_servo_loop_coeff 'SERVO_LOOP_COEFF_STRUCT':'SERVO_LOOP_COEFF_STRUCT'

Layout: <CGRecordLayout
  LLVMType:%struct.CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT = type { %struct.TEST_PORT_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, %struct.SCHEDULEDRATELIMITER_COEFF_STRUCT, %struct.SCHEDULEDRATELIMITER_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, %struct.TEST_PORT_COEFF_STRUCT, float, float, float, float, float, float, %struct.SERVO_LOOP_COEFF_STRUCT, %struct.SERVO_LOOP_COEFF_STRUCT }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bd1870 <..\..\..\Model\Inner_Loop\Header\MCP.h:82:9, line:93:1> line:82:9 struct definition
|-FullComment 0x2e021a8 <line:76:4, line:81:76>
| |-ParagraphComment 0x2e01f58 <line:76:4, line:77:4>
| | |-TextComment 0x2e01f08 <line:76:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e01f28 <line:77:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e01f78 <col:5, col:30> Text=" MCP_COEFF_STRUCT"
| |-ParagraphComment 0x2e01fe0 <line:78:1, col:4>
| | `-TextComment 0x2e01fb8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e02000 <col:5, line:81:76> Name="brief"
|   `-ParagraphComment 0x2e02168 <line:78:11, line:81:76>
|     |-TextComment 0x2e02028 <line:78:11, col:50> Text=" Coefficient structure for an MCP block."
|     |-TextComment 0x2e02048 <line:79:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e02068 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2e02088 <col:24, col:40> Text="{HAP1-SDD-IL,802}"
|     |-TextComment 0x2e020a8 <line:80:1, col:4> Text="    "
|     |-InlineCommandComment 0x2e020c8 <col:5, col:23> Name="ModelInnerLoopReqt" RenderNormal
|     |-TextComment 0x2e020e8 <col:24, col:40> Text="{HAP1-SDD-IL,xxx}"
|     `-TextComment 0x2e02108 <line:81:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2bd1950 <line:84:5, col:43> col:43 ism 'MCP_ISM_COEFF_STRUCT':'MCP_ISM_COEFF_STRUCT'
|-FieldDecl 0x2bd19b0 <line:85:5, col:43> col:43 control_coeff 'MCP_CONTROL_PRODUCER_COEFF_STRUCT':'MCP_CONTROL_PRODUCER_COEFF_STRUCT'
|-FieldDecl 0x2bd1a10 <line:86:5, col:43> col:43 monitors_coeff 'INNER_LOOP_MONITORS_COEFF_STRUCT':'INNER_LOOP_MONITORS_COEFF_STRUCT'
|-FieldDecl 0x2bd1a70 <line:87:5, col:43> col:43 cyclic_servo_controller_coeff 'CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT':'CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT'
|-FieldDecl 0x2bd1ad0 <line:88:5, col:43> col:43 gain 'F32':'float'
|-FieldDecl 0x2bd1b30 <line:89:5, col:43> col:43 gain1 'F32':'float'
|-FieldDecl 0x2bd1b90 <line:90:5, col:43> col:43 sin_wave_frequency 'F32':'float'
`-FieldDecl 0x2bd1bf0 <line:91:5, col:43> col:43 sin_wave_amplitude 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.MCP_COEFF_STRUCT = type { %struct.MCP_ISM_COEFF_STRUCT, %struct.MCP_CONTROL_PRODUCER_COEFF_STRUCT, %struct.INNER_LOOP_MONITORS_COEFF_STRUCT, %struct.CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT, float, float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct CONFIG_MGMT_MCP_MFG_SEGMENT
         0 |   U32 major
         4 |   U32 minor
         8 |   SENSOR_MGMT_MFG_CALIBRATION_STRUCT [3] calibrations
       296 |   U8 [11] serial_number
       307 |   U8 [15] time_stamp
           | [sizeof=324, align=4]

*** Dumping AST Record Layout
         0 | struct CONFIG_MGMT_MCP_INST_SEGMENT
         0 |   SENSOR_MGMT_INST_CALIBRATION_STRUCT calibration
         0 |     THREE_AXIS_SENSOR_CALIBRATION_STRUCT [3] mag_calibration
       144 |     THREE_AXIS_SENSOR_CALIBRATION_STRUCT remote_accel_calibration_orient
       144 |       MATRIX3X3 sensor_counts_to_body_axes
       144 |         VECTOR3 row1
       144 |           F32 X
       148 |           F32 Y
       152 |           F32 Z
       156 |         VECTOR3 row2
       156 |           F32 X
       160 |           F32 Y
       164 |           F32 Z
       168 |         VECTOR3 row3
       168 |           F32 X
       172 |           F32 Y
       176 |           F32 Z
       180 |       VECTOR3 bias
       180 |         F32 X
       184 |         F32 Y
       188 |         F32 Z
       192 |     THREE_AXIS_SENSOR_CALIBRATION_STRUCT remote_accel_calibration_correct
       192 |       MATRIX3X3 sensor_counts_to_body_axes
       192 |         VECTOR3 row1
       192 |           F32 X
       196 |           F32 Y
       200 |           F32 Z
       204 |         VECTOR3 row2
       204 |           F32 X
       208 |           F32 Y
       212 |           F32 Z
       216 |         VECTOR3 row3
       216 |           F32 X
       220 |           F32 Y
       224 |           F32 Z
       228 |       VECTOR3 bias
       228 |         F32 X
       232 |         F32 Y
       236 |         F32 Z
       240 |     SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT [2] differential_pressure_calibration
       256 |     SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT [2] static_pressure_calibration
       272 |   U32 board_serial_number0
       276 |   U32 board_serial_number1
       280 |   U32 adp_board_serial_number0
       284 |   U32 adp_board_serial_number1
           | [sizeof=288, align=4]

*** Dumping AST Record Layout
         0 | ACTUATOR_MGMT_COEFF_STRUCT
         0 |   U32 override_braking_period
         4 |   ACTUATOR_COEFF_STRUCT [2] actuators
           | [sizeof=244, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_SAMPLE_RATE_STRUCT
         0 |   U8 min
         1 |   U8 max
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | struct ADAHRS_COEFF_STRUCT
         0 |   F32 gain_down_proportional
         4 |   F32 gain_North_proportional
         8 |   F32 gain_down_integral
        12 |   F32 gain_North_integral
        16 |   F32 adaptive_gain_break_pt1
        20 |   F32 adaptive_gain_break_pt2
        24 |   F32 adaptive_gain_max
        28 |   F32 adaptive_gain_min
        32 |   F32 fast_mag_min_dot_product
        36 |   F32 slow_mag_min_dot_product
        40 |   F32 accel_min_dot_product
        44 |   F32 initialization_accel_magnitude_max
        48 |   F32 initialization_accel_magnitude_min
        52 |   F32 accel_init_low_pass_filter_alpha
        56 |   F32 mag_init_low_pass_filter_alpha
        60 |   F32 delta_airspeed_low_pass_filter_alpha
        64 |   U32 initialization_stationary_check_start
        68 |   U32 initialization_start_rates
        72 |   U32 initialization_start_mags_accels
        76 |   U32 initialization_end_sensor_init
        80 |   U32 initialization_system_is_op
           | [sizeof=84, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_MGMT_COEFF_STRUCT
         0 |   THREE_AXIS_FILTERS_COEFF_STRUCT gyro_filter_coeffs
         0 |     SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
        12 |   THREE_AXIS_FILTERS_COEFF_STRUCT accel_filter_coeffs
        12 |     SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
        24 |   THREE_AXIS_FILTERS_COEFF_STRUCT mag_filter_coeffs
        24 |     SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
        36 |   SINGLE_AXIS_FILTERS_COEFF_STRUCT OAT_filter_coeffs
        36 |     SCALAR_KALMAN_FILTER_COEFF_STRUCT kalman_filter_coeffs
        36 |       F32 kalman_gain
        40 |   SINGLE_AXIS_FILTERS_COEFF_STRUCT [2] differential_pressure_filter_coeffs
        48 |   SINGLE_AXIS_FILTERS_COEFF_STRUCT [2] static_pressure_filter_coeffs
        56 |   SENSOR_SAMPLE_RATE_STRUCT gyro_sample_rate
        56 |     U8 min
        57 |     U8 max
        58 |   SENSOR_SAMPLE_RATE_STRUCT accel_sample_rate
        58 |     U8 min
        59 |     U8 max
        60 |   SENSOR_SAMPLE_RATE_STRUCT mag_sample_rate
        60 |     U8 min
        61 |     U8 max
        62 |   SENSOR_SAMPLE_RATE_STRUCT OAT_sample_rate
        62 |     U8 min
        63 |     U8 max
        64 |   COMP_FILTER_SEGMENT_COEFF_STRUCT [2] airspeed_comp_filter_coeffs
        88 |   COMP_FILTER_SEGMENT_COEFF_STRUCT [3] altitude_comp_filter_coeffs
       124 |   struct ADAHRS_COEFF_STRUCT adahrs_coeffs
       124 |     F32 gain_down_proportional
       128 |     F32 gain_North_proportional
       132 |     F32 gain_down_integral
       136 |     F32 gain_North_integral
       140 |     F32 adaptive_gain_break_pt1
       144 |     F32 adaptive_gain_break_pt2
       148 |     F32 adaptive_gain_max
       152 |     F32 adaptive_gain_min
       156 |     F32 fast_mag_min_dot_product
       160 |     F32 slow_mag_min_dot_product
       164 |     F32 accel_min_dot_product
       168 |     F32 initialization_accel_magnitude_max
       172 |     F32 initialization_accel_magnitude_min
       176 |     F32 accel_init_low_pass_filter_alpha
       180 |     F32 mag_init_low_pass_filter_alpha
       184 |     F32 delta_airspeed_low_pass_filter_alpha
       188 |     U32 initialization_stationary_check_start
       192 |     U32 initialization_start_rates
       196 |     U32 initialization_start_mags_accels
       200 |     U32 initialization_end_sensor_init
       204 |     U32 initialization_system_is_op
       208 |   F32 max_static_pressure_discrepancy
       212 |   F32 max_magnetometer_discrepancy
       216 |   F32 max_differential_pressure_discrepancy
       220 |   F32 standard_pressure
       224 |   F32 sea_level_air_density
       228 |   F32 altitude_scale
       232 |   F32 altitude_exponent
       236 |   F32 mach_number_exponent
       240 |   F32 TAS_scale
       244 |   F32 TAS_Min
           | [sizeof=248, align=4]

*** Dumping AST Record Layout
         0 | ANNUNCIATORS_MCP_COEFF_STRUCT
         0 |   ANNUNCIATORS_PATTERN_COEFF_STRUCT [9] annunc_patterns
       144 |   F32 low_g_annunc_duration
           | [sizeof=148, align=4]

*** Dumping AST Record Layout
         0 | IBIT_COEFF_STRUCT
         0 |   MOMENTARY_SWITCH_COEFF_STRUCT ibit_engage_coeffs
         0 |     U32 debounce_threshold
         4 |     U32 sustain_threshold
         8 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
         8 |       U32 P
        12 |       BOOLEAN ic
        13 |       BOOLEAN rising_edge
        14 |       BOOLEAN falling_edge
        16 |   MOMENTARY_SWITCH_COEFF_STRUCT ibit_success_coeffs
        16 |     U32 debounce_threshold
        20 |     U32 sustain_threshold
        24 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        24 |       U32 P
        28 |       BOOLEAN ic
        29 |       BOOLEAN rising_edge
        30 |       BOOLEAN falling_edge
           | [sizeof=32, align=4]

*** Dumping AST Record Layout
         0 | USER_INPUT_COEFF_STRUCT
         0 |   MOMENTARY_SWITCH_COEFF_STRUCT momentary_switch
         0 |     U32 debounce_threshold
         4 |     U32 sustain_threshold
         8 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
         8 |       U32 P
        12 |       BOOLEAN ic
        13 |       BOOLEAN rising_edge
        14 |       BOOLEAN falling_edge
        16 |   MOMENTARY_SWITCH_COEFF_STRUCT momentary_switch_eng_dis
        16 |     U32 debounce_threshold
        20 |     U32 sustain_threshold
        24 |     PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        24 |       U32 P
        28 |       BOOLEAN ic
        29 |       BOOLEAN rising_edge
        30 |       BOOLEAN falling_edge
           | [sizeof=32, align=4]

*** Dumping AST Record Layout
         0 | OVERRIDE_DETECT_COEFF
         0 |   F32 override_open
         4 |   F32 override_short
         8 |   F32 override_min
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct CONFIG_MGMT_MCP_COEFF_SEGMENT
         0 |   MCP_COEFF_STRUCT mcp_cntl_coeff
         0 |     MCP_ISM_COEFF_STRUCT ism
         0 |       ACTUATOR_FW_COEFF_STRUCT Roll_Actuator_FW
         0 |         F32 MotorRevPerHallCount
         4 |         F32 GearboxReductionRatio
         8 |         F32 ArmCircumference
        12 |       ACTUATOR_FW_COEFF_STRUCT Pitch_Actuator_FW
        12 |         F32 MotorRevPerHallCount
        16 |         F32 GearboxReductionRatio
        20 |         F32 ArmCircumference
        24 |       STICKSWITCHSTATESENSING_COEFF_STRUCT StickSwitchStateSensing
        24 |         MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch1
        24 |           U32 debounce_threshold
        28 |           U32 sustain_threshold
        32 |           PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        32 |             U32 P
        36 |             BOOLEAN ic
        37 |             BOOLEAN rising_edge
        38 |             BOOLEAN falling_edge
        40 |         MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch2
        40 |           U32 debounce_threshold
        44 |           U32 sustain_threshold
        48 |           PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        48 |             U32 P
        52 |             BOOLEAN ic
        53 |             BOOLEAN rising_edge
        54 |             BOOLEAN falling_edge
        56 |         MOMENTARY_SWITCH_COEFF_STRUCT ChangeModeSwitch
        56 |           U32 debounce_threshold
        60 |           U32 sustain_threshold
        64 |           PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        64 |             U32 P
        68 |             BOOLEAN ic
        69 |             BOOLEAN rising_edge
        70 |             BOOLEAN falling_edge
        72 |         MOMENTARY_SWITCH_COEFF_STRUCT pciSwR_Switch
        72 |           U32 debounce_threshold
        76 |           U32 sustain_threshold
        80 |           PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        80 |             U32 P
        84 |             BOOLEAN ic
        85 |             BOOLEAN rising_edge
        86 |             BOOLEAN falling_edge
        88 |         MOMENTARY_SWITCH_COEFF_STRUCT pciSwL_Switch
        88 |           U32 debounce_threshold
        92 |           U32 sustain_threshold
        96 |           PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
        96 |             U32 P
       100 |             BOOLEAN ic
       101 |             BOOLEAN rising_edge
       102 |             BOOLEAN falling_edge
       104 |         MOMENTARY_SWITCH_COEFF_STRUCT pciSwF_Switch
       104 |           U32 debounce_threshold
       108 |           U32 sustain_threshold
       112 |           PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       112 |             U32 P
       116 |             BOOLEAN ic
       117 |             BOOLEAN rising_edge
       118 |             BOOLEAN falling_edge
       120 |         MOMENTARY_SWITCH_COEFF_STRUCT pciSwA_Switch
       120 |           U32 debounce_threshold
       124 |           U32 sustain_threshold
       128 |           PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       128 |             U32 P
       132 |             BOOLEAN ic
       133 |             BOOLEAN rising_edge
       134 |             BOOLEAN falling_edge
       136 |       ENGAGE_LOGIC_COEFF_STRUCT EngageLogic
       136 |         PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoEngage
       136 |           U32 P
       140 |           BOOLEAN ic
       141 |           BOOLEAN rising_edge
       142 |           BOOLEAN falling_edge
       144 |         PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoDisengage
       144 |           U32 P
       148 |           BOOLEAN ic
       149 |           BOOLEAN rising_edge
       150 |           BOOLEAN falling_edge
       152 |     MCP_CONTROL_PRODUCER_COEFF_STRUCT control_coeff
       152 |       CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
       152 |         F32 rate_limiter_lower_limit
       156 |         F32 rate_limiter_upper_limit
       160 |         G_LIMITER_COEFF_STRUCT g_limiter
       160 |           RATELIMITERDYNVF_COEFF_STRUCT ratelimiterdynvf
       160 |             F32 ts
       164 |           F32 g_limit
       168 |           F32 max_rate_limit
       172 |         ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
       172 |           LINTERP_STRUCT k_attitude_to_ang_accel
       172 |             U8 n_regions
       176 |             LINTERP_REGION_STRUCT [20] regions
       416 |           LINTERP_STRUCT k_rate_to_ang_accel
       416 |             U8 n_regions
       420 |             LINTERP_REGION_STRUCT [20] regions
       660 |           F32 k_attitude_to_ang_accel_integral
       664 |           F32 k_rate_to_ang_accel_cross
       668 |           REINTICHS_COEFF_STRUCT reintichs
       668 |             REINTICH_COEFF_STRUCT integrator_coeff
       668 |               F32 K_Ts
       672 |             SATURATIONVF_COEFF_STRUCT sat_coeff
       672 |               F32 epsilon
       676 |               F32 upper_sat_limit
       680 |               F32 lower_sat_limit
       684 |             F32 K_Ts
       688 |             F32 response_bias
       692 |         ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       692 |           LINTERP_STRUCT k_attitude_to_ang_accel
       692 |             U8 n_regions
       696 |             LINTERP_REGION_STRUCT [20] regions
       936 |           LINTERP_STRUCT k_rate_to_ang_accel
       936 |             U8 n_regions
       940 |             LINTERP_REGION_STRUCT [20] regions
      1180 |           F32 k_attitude_to_ang_accel_integral
      1184 |           F32 k_rate_to_ang_accel_cross
      1188 |           REINTICHS_COEFF_STRUCT reintichs
      1188 |             REINTICH_COEFF_STRUCT integrator_coeff
      1188 |               F32 K_Ts
      1192 |             SATURATIONVF_COEFF_STRUCT sat_coeff
      1192 |               F32 epsilon
      1196 |               F32 upper_sat_limit
      1200 |               F32 lower_sat_limit
      1204 |             F32 K_Ts
      1208 |             F32 response_bias
      1212 |         TEST_PORT_COEFF_STRUCT roll_testport
      1212 |           F32 gain
      1216 |           F32 bias
      1220 |         TEST_PORT_COEFF_STRUCT pitch_testport
      1220 |           F32 gain
      1224 |           F32 bias
      1228 |       UARMODELOGIC_COEFF_STRUCT uar_mode_logic
      1228 |         F32 phi_upper_limit
      1232 |         F32 phi_lower_limit
      1236 |         F32 theta_upper_limit
      1240 |         F32 theta_lower_limit
      1244 |         F32 p_filt_upper_limit
      1248 |         F32 p_filt_lower_limit
      1252 |         F32 q_filt_upper_limit
      1256 |         F32 q_filt_lower_limit
      1260 |         PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
      1260 |           U32 P
      1264 |           BOOLEAN ic
      1265 |           BOOLEAN rising_edge
      1266 |           BOOLEAN falling_edge
      1268 |     INNER_LOOP_MONITORS_COEFF_STRUCT monitors_coeff
      1268 |       MONITOR_COEFF_STRUCT roll_coeff
      1268 |         F32 rate_l_limit
      1272 |         F32 rate_u_limit
      1276 |         F32 attitude_l_limit
      1280 |         F32 attitude_u_limit
      1284 |         MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
      1284 |           PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1284 |             U32 P
      1288 |             BOOLEAN ic
      1289 |             BOOLEAN rising_edge
      1290 |             BOOLEAN falling_edge
      1292 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1292 |             U32 sample_interval
      1296 |           FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1296 |             F32 a1
      1300 |             F32 b0
      1304 |             F32 b1
      1308 |             F32 k1
      1312 |             F32 k2
      1316 |           F32 wof_l_limit
      1320 |           F32 wof_u_limit
      1324 |         MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
      1324 |           PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1324 |             U32 P
      1328 |             BOOLEAN ic
      1329 |             BOOLEAN rising_edge
      1330 |             BOOLEAN falling_edge
      1332 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1332 |             U32 sample_interval
      1336 |           FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1336 |             F32 a1
      1340 |             F32 b0
      1344 |             F32 b1
      1348 |             F32 k1
      1352 |             F32 k2
      1356 |           F32 wof_l_limit
      1360 |           F32 wof_u_limit
      1364 |       MONITOR_COEFF_STRUCT pitch_coeff
      1364 |         F32 rate_l_limit
      1368 |         F32 rate_u_limit
      1372 |         F32 attitude_l_limit
      1376 |         F32 attitude_u_limit
      1380 |         MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
      1380 |           PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1380 |             U32 P
      1384 |             BOOLEAN ic
      1385 |             BOOLEAN rising_edge
      1386 |             BOOLEAN falling_edge
      1388 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1388 |             U32 sample_interval
      1392 |           FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1392 |             F32 a1
      1396 |             F32 b0
      1400 |             F32 b1
      1404 |             F32 k1
      1408 |             F32 k2
      1412 |           F32 wof_l_limit
      1416 |           F32 wof_u_limit
      1420 |         MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
      1420 |           PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1420 |             U32 P
      1424 |             BOOLEAN ic
      1425 |             BOOLEAN rising_edge
      1426 |             BOOLEAN falling_edge
      1428 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1428 |             U32 sample_interval
      1432 |           FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1432 |             F32 a1
      1436 |             F32 b0
      1440 |             F32 b1
      1444 |             F32 k1
      1448 |             F32 k2
      1452 |           F32 wof_l_limit
      1456 |           F32 wof_u_limit
      1460 |       F32 lf_l_limit
      1464 |       PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
      1464 |         U32 P
      1468 |         BOOLEAN ic
      1469 |         BOOLEAN rising_edge
      1470 |         BOOLEAN falling_edge
      1472 |     CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT cyclic_servo_controller_coeff
      1472 |       TEST_PORT_COEFF_STRUCT roll_input_testport_coeff
      1472 |         F32 gain
      1476 |         F32 bias
      1480 |       TEST_PORT_COEFF_STRUCT pitch_input_testport_coeff
      1480 |         F32 gain
      1484 |         F32 bias
      1488 |       SCHEDULEDRATELIMITER_COEFF_STRUCT roll_scheduledRL_coeff
      1488 |         LINTERP_STRUCT upper_linterp
      1488 |           U8 n_regions
      1492 |           LINTERP_REGION_STRUCT [20] regions
      1732 |         LINTERP_STRUCT lower_linterp
      1732 |           U8 n_regions
      1736 |           LINTERP_REGION_STRUCT [20] regions
      1976 |         F32 ts
      1980 |       SCHEDULEDRATELIMITER_COEFF_STRUCT pitch_scheduledRL_coeff
      1980 |         LINTERP_STRUCT upper_linterp
      1980 |           U8 n_regions
      1984 |           LINTERP_REGION_STRUCT [20] regions
      2224 |         LINTERP_STRUCT lower_linterp
      2224 |           U8 n_regions
      2228 |           LINTERP_REGION_STRUCT [20] regions
      2468 |         F32 ts
      2472 |       TEST_PORT_COEFF_STRUCT roll_unlimited_testport_coeff
      2472 |         F32 gain
      2476 |         F32 bias
      2480 |       TEST_PORT_COEFF_STRUCT pitch_unlimited_testport_coeff
      2480 |         F32 gain
      2484 |         F32 bias
      2488 |       F32 roll_rigging_gain
      2492 |       F32 pitch_rigging_gain
      2496 |       F32 inv_roll_rigging_gain
      2500 |       F32 inv_pitch_rigging_gain
      2504 |       F32 sin_wave_frequency
      2508 |       F32 sin_wave_amplitude
      2512 |       SERVO_LOOP_COEFF_STRUCT roll_servo_loop_coeff
      2512 |         TEST_PORT_COEFF_STRUCT testport_case1
      2512 |           F32 gain
      2516 |           F32 bias
      2520 |         SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      2520 |           F32 epsilon
      2524 |         REINTICHS_COEFF_STRUCT ReInt_ICHS
      2524 |           REINTICH_COEFF_STRUCT integrator_coeff
      2524 |             F32 K_Ts
      2528 |           SATURATIONVF_COEFF_STRUCT sat_coeff
      2528 |             F32 epsilon
      2532 |             F32 upper_sat_limit
      2536 |             F32 lower_sat_limit
      2540 |           F32 K_Ts
      2544 |           F32 response_bias
      2548 |         F32 k_ts
      2552 |         F32 k
      2556 |         F32 k2
      2560 |         F32 k3
      2564 |         F32 k4
      2568 |         F32 max_current
      2572 |         F32 rate_limiter_upper_limit
      2576 |         F32 rate_limiter_lower_limit
      2580 |       SERVO_LOOP_COEFF_STRUCT pitch_servo_loop_coeff
      2580 |         TEST_PORT_COEFF_STRUCT testport_case1
      2580 |           F32 gain
      2584 |           F32 bias
      2588 |         SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      2588 |           F32 epsilon
      2592 |         REINTICHS_COEFF_STRUCT ReInt_ICHS
      2592 |           REINTICH_COEFF_STRUCT integrator_coeff
      2592 |             F32 K_Ts
      2596 |           SATURATIONVF_COEFF_STRUCT sat_coeff
      2596 |             F32 epsilon
      2600 |             F32 upper_sat_limit
      2604 |             F32 lower_sat_limit
      2608 |           F32 K_Ts
      2612 |           F32 response_bias
      2616 |         F32 k_ts
      2620 |         F32 k
      2624 |         F32 k2
      2628 |         F32 k3
      2632 |         F32 k4
      2636 |         F32 max_current
      2640 |         F32 rate_limiter_upper_limit
      2644 |         F32 rate_limiter_lower_limit
      2648 |     F32 gain
      2652 |     F32 gain1
      2656 |     F32 sin_wave_frequency
      2660 |     F32 sin_wave_amplitude
      2664 |   ACTUATOR_MGMT_COEFF_STRUCT actuator_mgmt
      2664 |     U32 override_braking_period
      2668 |     ACTUATOR_COEFF_STRUCT [2] actuators
      2908 |   SENSOR_MGMT_COEFF_STRUCT sensor_coeffs
      2908 |     THREE_AXIS_FILTERS_COEFF_STRUCT gyro_filter_coeffs
      2908 |       SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
      2920 |     THREE_AXIS_FILTERS_COEFF_STRUCT accel_filter_coeffs
      2920 |       SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
      2932 |     THREE_AXIS_FILTERS_COEFF_STRUCT mag_filter_coeffs
      2932 |       SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
      2944 |     SINGLE_AXIS_FILTERS_COEFF_STRUCT OAT_filter_coeffs
      2944 |       SCALAR_KALMAN_FILTER_COEFF_STRUCT kalman_filter_coeffs
      2944 |         F32 kalman_gain
      2948 |     SINGLE_AXIS_FILTERS_COEFF_STRUCT [2] differential_pressure_filter_coeffs
      2956 |     SINGLE_AXIS_FILTERS_COEFF_STRUCT [2] static_pressure_filter_coeffs
      2964 |     SENSOR_SAMPLE_RATE_STRUCT gyro_sample_rate
      2964 |       U8 min
      2965 |       U8 max
      2966 |     SENSOR_SAMPLE_RATE_STRUCT accel_sample_rate
      2966 |       U8 min
      2967 |       U8 max
      2968 |     SENSOR_SAMPLE_RATE_STRUCT mag_sample_rate
      2968 |       U8 min
      2969 |       U8 max
      2970 |     SENSOR_SAMPLE_RATE_STRUCT OAT_sample_rate
      2970 |       U8 min
      2971 |       U8 max
      2972 |     COMP_FILTER_SEGMENT_COEFF_STRUCT [2] airspeed_comp_filter_coeffs
      2996 |     COMP_FILTER_SEGMENT_COEFF_STRUCT [3] altitude_comp_filter_coeffs
      3032 |     struct ADAHRS_COEFF_STRUCT adahrs_coeffs
      3032 |       F32 gain_down_proportional
      3036 |       F32 gain_North_proportional
      3040 |       F32 gain_down_integral
      3044 |       F32 gain_North_integral
      3048 |       F32 adaptive_gain_break_pt1
      3052 |       F32 adaptive_gain_break_pt2
      3056 |       F32 adaptive_gain_max
      3060 |       F32 adaptive_gain_min
      3064 |       F32 fast_mag_min_dot_product
      3068 |       F32 slow_mag_min_dot_product
      3072 |       F32 accel_min_dot_product
      3076 |       F32 initialization_accel_magnitude_max
      3080 |       F32 initialization_accel_magnitude_min
      3084 |       F32 accel_init_low_pass_filter_alpha
      3088 |       F32 mag_init_low_pass_filter_alpha
      3092 |       F32 delta_airspeed_low_pass_filter_alpha
      3096 |       U32 initialization_stationary_check_start
      3100 |       U32 initialization_start_rates
      3104 |       U32 initialization_start_mags_accels
      3108 |       U32 initialization_end_sensor_init
      3112 |       U32 initialization_system_is_op
      3116 |     F32 max_static_pressure_discrepancy
      3120 |     F32 max_magnetometer_discrepancy
      3124 |     F32 max_differential_pressure_discrepancy
      3128 |     F32 standard_pressure
      3132 |     F32 sea_level_air_density
      3136 |     F32 altitude_scale
      3140 |     F32 altitude_exponent
      3144 |     F32 mach_number_exponent
      3148 |     F32 TAS_scale
      3152 |     F32 TAS_Min
      3156 |   ANNUNCIATORS_MCP_COEFF_STRUCT annunciators_coeff
      3156 |     ANNUNCIATORS_PATTERN_COEFF_STRUCT [9] annunc_patterns
      3300 |     F32 low_g_annunc_duration
      3304 |   IBIT_COEFF_STRUCT ibit_coeff
      3304 |     MOMENTARY_SWITCH_COEFF_STRUCT ibit_engage_coeffs
      3304 |       U32 debounce_threshold
      3308 |       U32 sustain_threshold
      3312 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3312 |         U32 P
      3316 |         BOOLEAN ic
      3317 |         BOOLEAN rising_edge
      3318 |         BOOLEAN falling_edge
      3320 |     MOMENTARY_SWITCH_COEFF_STRUCT ibit_success_coeffs
      3320 |       U32 debounce_threshold
      3324 |       U32 sustain_threshold
      3328 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3328 |         U32 P
      3332 |         BOOLEAN ic
      3333 |         BOOLEAN rising_edge
      3334 |         BOOLEAN falling_edge
      3336 |   USER_INPUT_COEFF_STRUCT user_input_coeff
      3336 |     MOMENTARY_SWITCH_COEFF_STRUCT momentary_switch
      3336 |       U32 debounce_threshold
      3340 |       U32 sustain_threshold
      3344 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3344 |         U32 P
      3348 |         BOOLEAN ic
      3349 |         BOOLEAN rising_edge
      3350 |         BOOLEAN falling_edge
      3352 |     MOMENTARY_SWITCH_COEFF_STRUCT momentary_switch_eng_dis
      3352 |       U32 debounce_threshold
      3356 |       U32 sustain_threshold
      3360 |       PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3360 |         U32 P
      3364 |         BOOLEAN ic
      3365 |         BOOLEAN rising_edge
      3366 |         BOOLEAN falling_edge
      3368 |   OVERRIDE_DETECT_COEFF override_coeff
      3368 |     F32 override_open
      3372 |     F32 override_short
      3376 |     F32 override_min
      3380 |   U32 Region
      3384 |   F32 Break
      3388 |   F32 Value
           | [sizeof=3392, align=4]

*** Dumping AST Record Layout
         0 | CONFIG_MCP_STRUCT
         0 |   struct CONFIG_MGMT_MCP_BINARY_SEGMENT binary
         0 |     U32 software_verson_num
         4 |     U32 flash_crc
         8 |   struct CONFIG_MGMT_MCP_MFG_SEGMENT mfg
         8 |     U32 major
        12 |     U32 minor
        16 |     SENSOR_MGMT_MFG_CALIBRATION_STRUCT [3] calibrations
       304 |     U8 [11] serial_number
       315 |     U8 [15] time_stamp
       332 |   struct CONFIG_MGMT_MCP_INST_SEGMENT inst
       332 |     SENSOR_MGMT_INST_CALIBRATION_STRUCT calibration
       332 |       THREE_AXIS_SENSOR_CALIBRATION_STRUCT [3] mag_calibration
       476 |       THREE_AXIS_SENSOR_CALIBRATION_STRUCT remote_accel_calibration_orient
       476 |         MATRIX3X3 sensor_counts_to_body_axes
       476 |           VECTOR3 row1
       476 |             F32 X
       480 |             F32 Y
       484 |             F32 Z
       488 |           VECTOR3 row2
       488 |             F32 X
       492 |             F32 Y
       496 |             F32 Z
       500 |           VECTOR3 row3
       500 |             F32 X
       504 |             F32 Y
       508 |             F32 Z
       512 |         VECTOR3 bias
       512 |           F32 X
       516 |           F32 Y
       520 |           F32 Z
       524 |       THREE_AXIS_SENSOR_CALIBRATION_STRUCT remote_accel_calibration_correct
       524 |         MATRIX3X3 sensor_counts_to_body_axes
       524 |           VECTOR3 row1
       524 |             F32 X
       528 |             F32 Y
       532 |             F32 Z
       536 |           VECTOR3 row2
       536 |             F32 X
       540 |             F32 Y
       544 |             F32 Z
       548 |           VECTOR3 row3
       548 |             F32 X
       552 |             F32 Y
       556 |             F32 Z
       560 |         VECTOR3 bias
       560 |           F32 X
       564 |           F32 Y
       568 |           F32 Z
       572 |       SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT [2] differential_pressure_calibration
       588 |       SINGLE_AXIS_SENSOR_CALIBRATION_STRUCT [2] static_pressure_calibration
       604 |     U32 board_serial_number0
       608 |     U32 board_serial_number1
       612 |     U32 adp_board_serial_number0
       616 |     U32 adp_board_serial_number1
       620 |   struct CONFIG_MGMT_MCP_COEFF_SEGMENT coeff
       620 |     MCP_COEFF_STRUCT mcp_cntl_coeff
       620 |       MCP_ISM_COEFF_STRUCT ism
       620 |         ACTUATOR_FW_COEFF_STRUCT Roll_Actuator_FW
       620 |           F32 MotorRevPerHallCount
       624 |           F32 GearboxReductionRatio
       628 |           F32 ArmCircumference
       632 |         ACTUATOR_FW_COEFF_STRUCT Pitch_Actuator_FW
       632 |           F32 MotorRevPerHallCount
       636 |           F32 GearboxReductionRatio
       640 |           F32 ArmCircumference
       644 |         STICKSWITCHSTATESENSING_COEFF_STRUCT StickSwitchStateSensing
       644 |           MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch1
       644 |             U32 debounce_threshold
       648 |             U32 sustain_threshold
       652 |             PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       652 |               U32 P
       656 |               BOOLEAN ic
       657 |               BOOLEAN rising_edge
       658 |               BOOLEAN falling_edge
       660 |           MOMENTARY_SWITCH_COEFF_STRUCT EngageSwitch2
       660 |             U32 debounce_threshold
       664 |             U32 sustain_threshold
       668 |             PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       668 |               U32 P
       672 |               BOOLEAN ic
       673 |               BOOLEAN rising_edge
       674 |               BOOLEAN falling_edge
       676 |           MOMENTARY_SWITCH_COEFF_STRUCT ChangeModeSwitch
       676 |             U32 debounce_threshold
       680 |             U32 sustain_threshold
       684 |             PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       684 |               U32 P
       688 |               BOOLEAN ic
       689 |               BOOLEAN rising_edge
       690 |               BOOLEAN falling_edge
       692 |           MOMENTARY_SWITCH_COEFF_STRUCT pciSwR_Switch
       692 |             U32 debounce_threshold
       696 |             U32 sustain_threshold
       700 |             PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       700 |               U32 P
       704 |               BOOLEAN ic
       705 |               BOOLEAN rising_edge
       706 |               BOOLEAN falling_edge
       708 |           MOMENTARY_SWITCH_COEFF_STRUCT pciSwL_Switch
       708 |             U32 debounce_threshold
       712 |             U32 sustain_threshold
       716 |             PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       716 |               U32 P
       720 |               BOOLEAN ic
       721 |               BOOLEAN rising_edge
       722 |               BOOLEAN falling_edge
       724 |           MOMENTARY_SWITCH_COEFF_STRUCT pciSwF_Switch
       724 |             U32 debounce_threshold
       728 |             U32 sustain_threshold
       732 |             PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       732 |               U32 P
       736 |               BOOLEAN ic
       737 |               BOOLEAN rising_edge
       738 |               BOOLEAN falling_edge
       740 |           MOMENTARY_SWITCH_COEFF_STRUCT pciSwA_Switch
       740 |             U32 debounce_threshold
       744 |             U32 sustain_threshold
       748 |             PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
       748 |               U32 P
       752 |               BOOLEAN ic
       753 |               BOOLEAN rising_edge
       754 |               BOOLEAN falling_edge
       756 |         ENGAGE_LOGIC_COEFF_STRUCT EngageLogic
       756 |           PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoEngage
       756 |             U32 P
       760 |             BOOLEAN ic
       761 |             BOOLEAN rising_edge
       762 |             BOOLEAN falling_edge
       764 |           PERSISTENT1SHOT_COEFF_STRUCT cmdHAPtoDisengage
       764 |             U32 P
       768 |             BOOLEAN ic
       769 |             BOOLEAN rising_edge
       770 |             BOOLEAN falling_edge
       772 |       MCP_CONTROL_PRODUCER_COEFF_STRUCT control_coeff
       772 |         CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
       772 |           F32 rate_limiter_lower_limit
       776 |           F32 rate_limiter_upper_limit
       780 |           G_LIMITER_COEFF_STRUCT g_limiter
       780 |             RATELIMITERDYNVF_COEFF_STRUCT ratelimiterdynvf
       780 |               F32 ts
       784 |             F32 g_limit
       788 |             F32 max_rate_limit
       792 |           ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
       792 |             LINTERP_STRUCT k_attitude_to_ang_accel
       792 |               U8 n_regions
       796 |               LINTERP_REGION_STRUCT [20] regions
      1036 |             LINTERP_STRUCT k_rate_to_ang_accel
      1036 |               U8 n_regions
      1040 |               LINTERP_REGION_STRUCT [20] regions
      1280 |             F32 k_attitude_to_ang_accel_integral
      1284 |             F32 k_rate_to_ang_accel_cross
      1288 |             REINTICHS_COEFF_STRUCT reintichs
      1288 |               REINTICH_COEFF_STRUCT integrator_coeff
      1288 |                 F32 K_Ts
      1292 |               SATURATIONVF_COEFF_STRUCT sat_coeff
      1292 |                 F32 epsilon
      1296 |                 F32 upper_sat_limit
      1300 |                 F32 lower_sat_limit
      1304 |               F32 K_Ts
      1308 |               F32 response_bias
      1312 |           ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
      1312 |             LINTERP_STRUCT k_attitude_to_ang_accel
      1312 |               U8 n_regions
      1316 |               LINTERP_REGION_STRUCT [20] regions
      1556 |             LINTERP_STRUCT k_rate_to_ang_accel
      1556 |               U8 n_regions
      1560 |               LINTERP_REGION_STRUCT [20] regions
      1800 |             F32 k_attitude_to_ang_accel_integral
      1804 |             F32 k_rate_to_ang_accel_cross
      1808 |             REINTICHS_COEFF_STRUCT reintichs
      1808 |               REINTICH_COEFF_STRUCT integrator_coeff
      1808 |                 F32 K_Ts
      1812 |               SATURATIONVF_COEFF_STRUCT sat_coeff
      1812 |                 F32 epsilon
      1816 |                 F32 upper_sat_limit
      1820 |                 F32 lower_sat_limit
      1824 |               F32 K_Ts
      1828 |               F32 response_bias
      1832 |           TEST_PORT_COEFF_STRUCT roll_testport
      1832 |             F32 gain
      1836 |             F32 bias
      1840 |           TEST_PORT_COEFF_STRUCT pitch_testport
      1840 |             F32 gain
      1844 |             F32 bias
      1848 |         UARMODELOGIC_COEFF_STRUCT uar_mode_logic
      1848 |           F32 phi_upper_limit
      1852 |           F32 phi_lower_limit
      1856 |           F32 theta_upper_limit
      1860 |           F32 theta_lower_limit
      1864 |           F32 p_filt_upper_limit
      1868 |           F32 p_filt_lower_limit
      1872 |           F32 q_filt_upper_limit
      1876 |           F32 q_filt_lower_limit
      1880 |           PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
      1880 |             U32 P
      1884 |             BOOLEAN ic
      1885 |             BOOLEAN rising_edge
      1886 |             BOOLEAN falling_edge
      1888 |       INNER_LOOP_MONITORS_COEFF_STRUCT monitors_coeff
      1888 |         MONITOR_COEFF_STRUCT roll_coeff
      1888 |           F32 rate_l_limit
      1892 |           F32 rate_u_limit
      1896 |           F32 attitude_l_limit
      1900 |           F32 attitude_u_limit
      1904 |           MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
      1904 |             PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1904 |               U32 P
      1908 |               BOOLEAN ic
      1909 |               BOOLEAN rising_edge
      1910 |               BOOLEAN falling_edge
      1912 |             TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1912 |               U32 sample_interval
      1916 |             FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1916 |               F32 a1
      1920 |               F32 b0
      1924 |               F32 b1
      1928 |               F32 k1
      1932 |               F32 k2
      1936 |             F32 wof_l_limit
      1940 |             F32 wof_u_limit
      1944 |           MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
      1944 |             PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      1944 |               U32 P
      1948 |               BOOLEAN ic
      1949 |               BOOLEAN rising_edge
      1950 |               BOOLEAN falling_edge
      1952 |             TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      1952 |               U32 sample_interval
      1956 |             FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      1956 |               F32 a1
      1960 |               F32 b0
      1964 |               F32 b1
      1968 |               F32 k1
      1972 |               F32 k2
      1976 |             F32 wof_l_limit
      1980 |             F32 wof_u_limit
      1984 |         MONITOR_COEFF_STRUCT pitch_coeff
      1984 |           F32 rate_l_limit
      1988 |           F32 rate_u_limit
      1992 |           F32 attitude_l_limit
      1996 |           F32 attitude_u_limit
      2000 |           MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
      2000 |             PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      2000 |               U32 P
      2004 |               BOOLEAN ic
      2005 |               BOOLEAN rising_edge
      2006 |               BOOLEAN falling_edge
      2008 |             TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      2008 |               U32 sample_interval
      2012 |             FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      2012 |               F32 a1
      2016 |               F32 b0
      2020 |               F32 b1
      2024 |               F32 k1
      2028 |               F32 k2
      2032 |             F32 wof_l_limit
      2036 |             F32 wof_u_limit
      2040 |           MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
      2040 |             PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
      2040 |               U32 P
      2044 |               BOOLEAN ic
      2045 |               BOOLEAN rising_edge
      2046 |               BOOLEAN falling_edge
      2048 |             TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
      2048 |               U32 sample_interval
      2052 |             FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
      2052 |               F32 a1
      2056 |               F32 b0
      2060 |               F32 b1
      2064 |               F32 k1
      2068 |               F32 k2
      2072 |             F32 wof_l_limit
      2076 |             F32 wof_u_limit
      2080 |         F32 lf_l_limit
      2084 |         PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
      2084 |           U32 P
      2088 |           BOOLEAN ic
      2089 |           BOOLEAN rising_edge
      2090 |           BOOLEAN falling_edge
      2092 |       CYCLIC_SERVO_CONTROLLER_COEFF_STRUCT cyclic_servo_controller_coeff
      2092 |         TEST_PORT_COEFF_STRUCT roll_input_testport_coeff
      2092 |           F32 gain
      2096 |           F32 bias
      2100 |         TEST_PORT_COEFF_STRUCT pitch_input_testport_coeff
      2100 |           F32 gain
      2104 |           F32 bias
      2108 |         SCHEDULEDRATELIMITER_COEFF_STRUCT roll_scheduledRL_coeff
      2108 |           LINTERP_STRUCT upper_linterp
      2108 |             U8 n_regions
      2112 |             LINTERP_REGION_STRUCT [20] regions
      2352 |           LINTERP_STRUCT lower_linterp
      2352 |             U8 n_regions
      2356 |             LINTERP_REGION_STRUCT [20] regions
      2596 |           F32 ts
      2600 |         SCHEDULEDRATELIMITER_COEFF_STRUCT pitch_scheduledRL_coeff
      2600 |           LINTERP_STRUCT upper_linterp
      2600 |             U8 n_regions
      2604 |             LINTERP_REGION_STRUCT [20] regions
      2844 |           LINTERP_STRUCT lower_linterp
      2844 |             U8 n_regions
      2848 |             LINTERP_REGION_STRUCT [20] regions
      3088 |           F32 ts
      3092 |         TEST_PORT_COEFF_STRUCT roll_unlimited_testport_coeff
      3092 |           F32 gain
      3096 |           F32 bias
      3100 |         TEST_PORT_COEFF_STRUCT pitch_unlimited_testport_coeff
      3100 |           F32 gain
      3104 |           F32 bias
      3108 |         F32 roll_rigging_gain
      3112 |         F32 pitch_rigging_gain
      3116 |         F32 inv_roll_rigging_gain
      3120 |         F32 inv_pitch_rigging_gain
      3124 |         F32 sin_wave_frequency
      3128 |         F32 sin_wave_amplitude
      3132 |         SERVO_LOOP_COEFF_STRUCT roll_servo_loop_coeff
      3132 |           TEST_PORT_COEFF_STRUCT testport_case1
      3132 |             F32 gain
      3136 |             F32 bias
      3140 |           SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      3140 |             F32 epsilon
      3144 |           REINTICHS_COEFF_STRUCT ReInt_ICHS
      3144 |             REINTICH_COEFF_STRUCT integrator_coeff
      3144 |               F32 K_Ts
      3148 |             SATURATIONVF_COEFF_STRUCT sat_coeff
      3148 |               F32 epsilon
      3152 |               F32 upper_sat_limit
      3156 |               F32 lower_sat_limit
      3160 |             F32 K_Ts
      3164 |             F32 response_bias
      3168 |           F32 k_ts
      3172 |           F32 k
      3176 |           F32 k2
      3180 |           F32 k3
      3184 |           F32 k4
      3188 |           F32 max_current
      3192 |           F32 rate_limiter_upper_limit
      3196 |           F32 rate_limiter_lower_limit
      3200 |         SERVO_LOOP_COEFF_STRUCT pitch_servo_loop_coeff
      3200 |           TEST_PORT_COEFF_STRUCT testport_case1
      3200 |             F32 gain
      3204 |             F32 bias
      3208 |           SATURATIONDYNVF_COEFF_STRUCT SaturationDynVF
      3208 |             F32 epsilon
      3212 |           REINTICHS_COEFF_STRUCT ReInt_ICHS
      3212 |             REINTICH_COEFF_STRUCT integrator_coeff
      3212 |               F32 K_Ts
      3216 |             SATURATIONVF_COEFF_STRUCT sat_coeff
      3216 |               F32 epsilon
      3220 |               F32 upper_sat_limit
      3224 |               F32 lower_sat_limit
      3228 |             F32 K_Ts
      3232 |             F32 response_bias
      3236 |           F32 k_ts
      3240 |           F32 k
      3244 |           F32 k2
      3248 |           F32 k3
      3252 |           F32 k4
      3256 |           F32 max_current
      3260 |           F32 rate_limiter_upper_limit
      3264 |           F32 rate_limiter_lower_limit
      3268 |       F32 gain
      3272 |       F32 gain1
      3276 |       F32 sin_wave_frequency
      3280 |       F32 sin_wave_amplitude
      3284 |     ACTUATOR_MGMT_COEFF_STRUCT actuator_mgmt
      3284 |       U32 override_braking_period
      3288 |       ACTUATOR_COEFF_STRUCT [2] actuators
      3528 |     SENSOR_MGMT_COEFF_STRUCT sensor_coeffs
      3528 |       THREE_AXIS_FILTERS_COEFF_STRUCT gyro_filter_coeffs
      3528 |         SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
      3540 |       THREE_AXIS_FILTERS_COEFF_STRUCT accel_filter_coeffs
      3540 |         SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
      3552 |       THREE_AXIS_FILTERS_COEFF_STRUCT mag_filter_coeffs
      3552 |         SINGLE_AXIS_FILTERS_COEFF_STRUCT [3] filter_coeffs
      3564 |       SINGLE_AXIS_FILTERS_COEFF_STRUCT OAT_filter_coeffs
      3564 |         SCALAR_KALMAN_FILTER_COEFF_STRUCT kalman_filter_coeffs
      3564 |           F32 kalman_gain
      3568 |       SINGLE_AXIS_FILTERS_COEFF_STRUCT [2] differential_pressure_filter_coeffs
      3576 |       SINGLE_AXIS_FILTERS_COEFF_STRUCT [2] static_pressure_filter_coeffs
      3584 |       SENSOR_SAMPLE_RATE_STRUCT gyro_sample_rate
      3584 |         U8 min
      3585 |         U8 max
      3586 |       SENSOR_SAMPLE_RATE_STRUCT accel_sample_rate
      3586 |         U8 min
      3587 |         U8 max
      3588 |       SENSOR_SAMPLE_RATE_STRUCT mag_sample_rate
      3588 |         U8 min
      3589 |         U8 max
      3590 |       SENSOR_SAMPLE_RATE_STRUCT OAT_sample_rate
      3590 |         U8 min
      3591 |         U8 max
      3592 |       COMP_FILTER_SEGMENT_COEFF_STRUCT [2] airspeed_comp_filter_coeffs
      3616 |       COMP_FILTER_SEGMENT_COEFF_STRUCT [3] altitude_comp_filter_coeffs
      3652 |       struct ADAHRS_COEFF_STRUCT adahrs_coeffs
      3652 |         F32 gain_down_proportional
      3656 |         F32 gain_North_proportional
      3660 |         F32 gain_down_integral
      3664 |         F32 gain_North_integral
      3668 |         F32 adaptive_gain_break_pt1
      3672 |         F32 adaptive_gain_break_pt2
      3676 |         F32 adaptive_gain_max
      3680 |         F32 adaptive_gain_min
      3684 |         F32 fast_mag_min_dot_product
      3688 |         F32 slow_mag_min_dot_product
      3692 |         F32 accel_min_dot_product
      3696 |         F32 initialization_accel_magnitude_max
      3700 |         F32 initialization_accel_magnitude_min
      3704 |         F32 accel_init_low_pass_filter_alpha
      3708 |         F32 mag_init_low_pass_filter_alpha
      3712 |         F32 delta_airspeed_low_pass_filter_alpha
      3716 |         U32 initialization_stationary_check_start
      3720 |         U32 initialization_start_rates
      3724 |         U32 initialization_start_mags_accels
      3728 |         U32 initialization_end_sensor_init
      3732 |         U32 initialization_system_is_op
      3736 |       F32 max_static_pressure_discrepancy
      3740 |       F32 max_magnetometer_discrepancy
      3744 |       F32 max_differential_pressure_discrepancy
      3748 |       F32 standard_pressure
      3752 |       F32 sea_level_air_density
      3756 |       F32 altitude_scale
      3760 |       F32 altitude_exponent
      3764 |       F32 mach_number_exponent
      3768 |       F32 TAS_scale
      3772 |       F32 TAS_Min
      3776 |     ANNUNCIATORS_MCP_COEFF_STRUCT annunciators_coeff
      3776 |       ANNUNCIATORS_PATTERN_COEFF_STRUCT [9] annunc_patterns
      3920 |       F32 low_g_annunc_duration
      3924 |     IBIT_COEFF_STRUCT ibit_coeff
      3924 |       MOMENTARY_SWITCH_COEFF_STRUCT ibit_engage_coeffs
      3924 |         U32 debounce_threshold
      3928 |         U32 sustain_threshold
      3932 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3932 |           U32 P
      3936 |           BOOLEAN ic
      3937 |           BOOLEAN rising_edge
      3938 |           BOOLEAN falling_edge
      3940 |       MOMENTARY_SWITCH_COEFF_STRUCT ibit_success_coeffs
      3940 |         U32 debounce_threshold
      3944 |         U32 sustain_threshold
      3948 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3948 |           U32 P
      3952 |           BOOLEAN ic
      3953 |           BOOLEAN rising_edge
      3954 |           BOOLEAN falling_edge
      3956 |     USER_INPUT_COEFF_STRUCT user_input_coeff
      3956 |       MOMENTARY_SWITCH_COEFF_STRUCT momentary_switch
      3956 |         U32 debounce_threshold
      3960 |         U32 sustain_threshold
      3964 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3964 |           U32 P
      3968 |           BOOLEAN ic
      3969 |           BOOLEAN rising_edge
      3970 |           BOOLEAN falling_edge
      3972 |       MOMENTARY_SWITCH_COEFF_STRUCT momentary_switch_eng_dis
      3972 |         U32 debounce_threshold
      3976 |         U32 sustain_threshold
      3980 |         PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
      3980 |           U32 P
      3984 |           BOOLEAN ic
      3985 |           BOOLEAN rising_edge
      3986 |           BOOLEAN falling_edge
      3988 |     OVERRIDE_DETECT_COEFF override_coeff
      3988 |       F32 override_open
      3992 |       F32 override_short
      3996 |       F32 override_min
      4000 |     U32 Region
      4004 |     F32 Break
      4008 |     F32 Value
           | [sizeof=4012, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2df5848 <..\..\..\MCP\Header\Configuration_Mgmt_MCP.h:196:9, line:201:1> line:196:16 struct CONFIG_MGMT_MCP_BINARY_SEGMENT definition
|-FullComment 0x2e02a60 <line:191:4, line:195:77>
| |-ParagraphComment 0x2e02888 <line:191:4, line:192:4>
| | |-TextComment 0x2e02838 <line:191:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2e02858 <line:192:1, col:4> Text="    "
| |-VerbatimLineComment 0x2e028a8 <col:5, col:44> Text=" CONFIG_MGMT_MCP_BINARY_SEGMENT"
| |-ParagraphComment 0x2e02910 <line:193:1, col:4>
| | `-TextComment 0x2e028e8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2e02930 <col:5, line:195:77> Name="brief"
|   `-ParagraphComment 0x2e02a20 <line:193:11, line:195:77>
|     |-TextComment 0x2e02958 <line:193:11, col:67> Text=" Segment which stores information about the binary image."
