
*** Dumping AST Record Layout
         0 | VECTOR3
         0 |   F32 X
         4 |   F32 Y
         8 |   F32 Z
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_ADC_SAMPLE_STRUCT
         0 |   S16 X
         2 |   S16 Y
         4 |   S16 Z
           | [sizeof=6, align=2]

*** Dumping AST Record Layout
         0 | PIN_PERIPH_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   U32 pin_config
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PIN_ADC_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_COEFF_STRUCT
         0 |   U32 P
         4 |   BOOLEAN ic
         5 |   BOOLEAN rising_edge
         6 |   BOOLEAN falling_edge
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | MOMENTARY_SWITCH_COEFF_STRUCT
         0 |   U32 debounce_threshold
         4 |   U32 sustain_threshold
         8 |   PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
         8 |     U32 P
        12 |     BOOLEAN ic
        13 |     BOOLEAN rising_edge
        14 |     BOOLEAN falling_edge
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | PIN_GPIO_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:112:5)
         0 |   PIN_GPIO_HW_STRUCT pwr_path_test
         0 |     U32 port
         4 |     U8 pin
         8 |   PIN_GPIO_HW_STRUCT brake_pwr_test
         8 |     U32 port
        12 |     U8 pin
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:157:5)
         0 |   int diag_1
         4 |   int diag_2
         8 |   int diag_3
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:166:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:175:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:184:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_brakes
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | TARGET_VOLTAGE_MONITORS_HW_UNION
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:157:5) schematic
         0 |     int diag_1
         4 |     int diag_2
         8 |     int diag_3
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:166:5) MCPA
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:175:5) MCPB
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:184:5) MCPC
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_brakes
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | PACKET_TYPE_STRUCT
         0 |   ADP2MCP_PACKET_TYPE packet_type
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | EULER_ANGLES
         0 |   F32 phi
         4 |   F32 theta
         8 |   F32 psi
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_STATE_STRUCT
         0 |   BOOLEAN init
         4 |   U32 iteration
         8 |   BOOLEAN prev_input
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_INPUT_STRUCT
         0 |   BOOLEAN input
         1 |   BOOLEAN reset
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_OUTPUT_STRUCT
         0 |   BOOLEAN output
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |   PERSISTENT1SHOT_STATE_STRUCT state
         8 |     BOOLEAN init
        12 |     U32 iteration
        16 |     BOOLEAN prev_input
        20 |   PERSISTENT1SHOT_INPUT_STRUCT input
        20 |     BOOLEAN input
        21 |     BOOLEAN reset
        22 |   PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |     BOOLEAN output
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_COEFF_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
         0 |     U32 P
         4 |     BOOLEAN ic
         5 |     BOOLEAN rising_edge
         6 |     BOOLEAN falling_edge
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_STATE_STRUCT
         0 |   PERSISTENT1SHOT_STRUCT transition_one_shot
         0 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |     PERSISTENT1SHOT_STATE_STRUCT state
         8 |       BOOLEAN init
        12 |       U32 iteration
        16 |       BOOLEAN prev_input
        20 |     PERSISTENT1SHOT_INPUT_STRUCT input
        20 |       BOOLEAN input
        21 |       BOOLEAN reset
        22 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   F32 output_previous
        28 |   F32 transition_deviation_latched
        32 |   F32 selected_input
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_COMMON_STRUCT
         0 |   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
         8 |   SWITCH_COMMON_STATE_STRUCT state
         8 |     PERSISTENT1SHOT_STRUCT transition_one_shot
         8 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        16 |       PERSISTENT1SHOT_STATE_STRUCT state
        16 |         BOOLEAN init
        20 |         U32 iteration
        24 |         BOOLEAN prev_input
        28 |       PERSISTENT1SHOT_INPUT_STRUCT input
        28 |         BOOLEAN input
        29 |         BOOLEAN reset
        30 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        30 |         BOOLEAN output
        32 |     F32 output_previous
        36 |     F32 transition_deviation_latched
        40 |     F32 selected_input
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | LINTERP_REGION_STRUCT
         0 |   F32 breakpoint
         4 |   F32 value
         8 |   F32 slope
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_STATE_STRUCT
         0 |   F32 delay
         4 |   BOOLEAN reset_on_init
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN run
         9 |   BOOLEAN hold
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_STRUCT
         0 |   REINTICH_COEFF_STRUCT * coeff
         8 |   REINTICH_STATE_STRUCT state
         8 |     F32 delay
        12 |     BOOLEAN reset_on_init
        16 |   REINTICH_INPUT_STRUCT input
        16 |     F32 IC
        20 |     F32 input
        24 |     BOOLEAN run
        25 |     BOOLEAN hold
        28 |   REINTICH_OUTPUT_STRUCT output
        28 |     F32 output
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_STATE_STRUCT
         0 |   SWITCH_COMMON_STRUCT common
         0 |     SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
         8 |     SWITCH_COMMON_STATE_STRUCT state
         8 |       PERSISTENT1SHOT_STRUCT transition_one_shot
         8 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        16 |         PERSISTENT1SHOT_STATE_STRUCT state
        16 |           BOOLEAN init
        20 |           U32 iteration
        24 |           BOOLEAN prev_input
        28 |         PERSISTENT1SHOT_INPUT_STRUCT input
        28 |           BOOLEAN input
        29 |           BOOLEAN reset
        30 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
        30 |           BOOLEAN output
        32 |       F32 output_previous
        36 |       F32 transition_deviation_latched
        40 |       F32 selected_input
        48 |   REINTICH_STRUCT first_integrator
        48 |     REINTICH_COEFF_STRUCT * coeff
        56 |     REINTICH_STATE_STRUCT state
        56 |       F32 delay
        60 |       BOOLEAN reset_on_init
        64 |     REINTICH_INPUT_STRUCT input
        64 |       F32 IC
        68 |       F32 input
        72 |       BOOLEAN run
        73 |       BOOLEAN hold
        76 |     REINTICH_OUTPUT_STRUCT output
        76 |       F32 output
        80 |   REINTICH_STRUCT second_integrator
        80 |     REINTICH_COEFF_STRUCT * coeff
        88 |     REINTICH_STATE_STRUCT state
        88 |       F32 delay
        92 |       BOOLEAN reset_on_init
        96 |     REINTICH_INPUT_STRUCT input
        96 |       F32 IC
       100 |       F32 input
       104 |       BOOLEAN run
       105 |       BOOLEAN hold
       108 |     REINTICH_OUTPUT_STRUCT output
       108 |       F32 output
       112 |   F32 first_feedback_delay
       116 |   F32 second_feedback_delay
           | [sizeof=120, align=8]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_INPUT_STRUCT
         0 |   F32 input_one
         4 |   F32 input_two
         8 |   BOOLEAN switch_flag
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_STRUCT
         0 |   SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
         8 |   SWITCH_SECOND_ORDER_STATE_STRUCT state
         8 |     SWITCH_COMMON_STRUCT common
         8 |       SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        16 |       SWITCH_COMMON_STATE_STRUCT state
        16 |         PERSISTENT1SHOT_STRUCT transition_one_shot
        16 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |           PERSISTENT1SHOT_STATE_STRUCT state
        24 |             BOOLEAN init
        28 |             U32 iteration
        32 |             BOOLEAN prev_input
        36 |           PERSISTENT1SHOT_INPUT_STRUCT input
        36 |             BOOLEAN input
        37 |             BOOLEAN reset
        38 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |             BOOLEAN output
        40 |         F32 output_previous
        44 |         F32 transition_deviation_latched
        48 |         F32 selected_input
        56 |     REINTICH_STRUCT first_integrator
        56 |       REINTICH_COEFF_STRUCT * coeff
        64 |       REINTICH_STATE_STRUCT state
        64 |         F32 delay
        68 |         BOOLEAN reset_on_init
        72 |       REINTICH_INPUT_STRUCT input
        72 |         F32 IC
        76 |         F32 input
        80 |         BOOLEAN run
        81 |         BOOLEAN hold
        84 |       REINTICH_OUTPUT_STRUCT output
        84 |         F32 output
        88 |     REINTICH_STRUCT second_integrator
        88 |       REINTICH_COEFF_STRUCT * coeff
        96 |       REINTICH_STATE_STRUCT state
        96 |         F32 delay
       100 |         BOOLEAN reset_on_init
       104 |       REINTICH_INPUT_STRUCT input
       104 |         F32 IC
       108 |         F32 input
       112 |         BOOLEAN run
       113 |         BOOLEAN hold
       116 |       REINTICH_OUTPUT_STRUCT output
       116 |         F32 output
       120 |     F32 first_feedback_delay
       124 |     F32 second_feedback_delay
       128 |   SWITCH_SECOND_ORDER_INPUT_STRUCT input
       128 |     F32 input_one
       132 |     F32 input_two
       136 |     BOOLEAN switch_flag
       140 |   SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       140 |     F32 output
           | [sizeof=144, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_INPUT_STRUCT
         0 |   F32 rate_cross_axis
         4 |   F32 rate_near_axis
         8 |   F32 attitude_near_axis
        12 |   F32 adp_roll_cmd
        16 |   F32 adp_pitch_cmd
        20 |   BOOLEAN run_mode
        21 |   BOOLEAN uar_mode
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_STATE_STRUCT
         0 |   F32 delay
         4 |   BOOLEAN reset_on_init
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN inv
         5 |   BOOLEAN satLo
         6 |   BOOLEAN satHi
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_STRUCT
         0 |   SATURATIONVF_COEFF_STRUCT * coeff
         8 |   SATURATIONVF_STATE_STRUCT state
         8 |     F32 delay
        12 |     BOOLEAN reset_on_init
        16 |   SATURATIONVF_INPUT_STRUCT input
        16 |     F32 IC
        20 |     F32 input
        24 |     BOOLEAN reset
        28 |   SATURATIONVF_OUTPUT_STRUCT output
        28 |     F32 output
        32 |     BOOLEAN inv
        33 |     BOOLEAN satLo
        34 |     BOOLEAN satHi
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | REINTICHS_STATE_STRUCT
         0 |   F32 IC_delay
         4 |   F32 rail_bounce
         8 |   BOOLEAN prev_sat_UL
         9 |   BOOLEAN prev_sat_LL
        10 |   BOOLEAN prev_sat_inv
        11 |   BOOLEAN prev_reset_int
        12 |   BOOLEAN prev_reset_sat
        16 |   REINTICH_STRUCT integrator
        16 |     REINTICH_COEFF_STRUCT * coeff
        24 |     REINTICH_STATE_STRUCT state
        24 |       F32 delay
        28 |       BOOLEAN reset_on_init
        32 |     REINTICH_INPUT_STRUCT input
        32 |       F32 IC
        36 |       F32 input
        40 |       BOOLEAN run
        41 |       BOOLEAN hold
        44 |     REINTICH_OUTPUT_STRUCT output
        44 |       F32 output
        48 |   SATURATIONVF_STRUCT sat
        48 |     SATURATIONVF_COEFF_STRUCT * coeff
        56 |     SATURATIONVF_STATE_STRUCT state
        56 |       F32 delay
        60 |       BOOLEAN reset_on_init
        64 |     SATURATIONVF_INPUT_STRUCT input
        64 |       F32 IC
        68 |       F32 input
        72 |       BOOLEAN reset
        76 |     SATURATIONVF_OUTPUT_STRUCT output
        76 |       F32 output
        80 |       BOOLEAN inv
        81 |       BOOLEAN satLo
        82 |       BOOLEAN satHi
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | REINTICHS_INPUT_STRUCT
         0 |   F32 IC
         4 |   F32 input
         8 |   BOOLEAN run
         9 |   BOOLEAN hold
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_OUTPUT_STRUCT
         0 |   F32 output
         4 |   BOOLEAN sat_UL
         5 |   BOOLEAN sat_LL
         6 |   BOOLEAN inv
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_STRUCT
         0 |   REINTICHS_COEFF_STRUCT * coeff
         8 |   REINTICHS_STATE_STRUCT state
         8 |     F32 IC_delay
        12 |     F32 rail_bounce
        16 |     BOOLEAN prev_sat_UL
        17 |     BOOLEAN prev_sat_LL
        18 |     BOOLEAN prev_sat_inv
        19 |     BOOLEAN prev_reset_int
        20 |     BOOLEAN prev_reset_sat
        24 |     REINTICH_STRUCT integrator
        24 |       REINTICH_COEFF_STRUCT * coeff
        32 |       REINTICH_STATE_STRUCT state
        32 |         F32 delay
        36 |         BOOLEAN reset_on_init
        40 |       REINTICH_INPUT_STRUCT input
        40 |         F32 IC
        44 |         F32 input
        48 |         BOOLEAN run
        49 |         BOOLEAN hold
        52 |       REINTICH_OUTPUT_STRUCT output
        52 |         F32 output
        56 |     SATURATIONVF_STRUCT sat
        56 |       SATURATIONVF_COEFF_STRUCT * coeff
        64 |       SATURATIONVF_STATE_STRUCT state
        64 |         F32 delay
        68 |         BOOLEAN reset_on_init
        72 |       SATURATIONVF_INPUT_STRUCT input
        72 |         F32 IC
        76 |         F32 input
        80 |         BOOLEAN reset
        84 |       SATURATIONVF_OUTPUT_STRUCT output
        84 |         F32 output
        88 |         BOOLEAN inv
        89 |         BOOLEAN satLo
        90 |         BOOLEAN satHi
        96 |   REINTICHS_INPUT_STRUCT input
        96 |     F32 IC
       100 |     F32 input
       104 |     BOOLEAN run
       105 |     BOOLEAN hold
       108 |   REINTICHS_OUTPUT_STRUCT output
       108 |     F32 output
       112 |     BOOLEAN sat_UL
       113 |     BOOLEAN sat_LL
       114 |     BOOLEAN inv
           | [sizeof=120, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_STATE_STRUCT
         0 |   SWITCH_SECOND_ORDER_STRUCT rate_switch
         0 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
         8 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
         8 |       SWITCH_COMMON_STRUCT common
         8 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        16 |         SWITCH_COMMON_STATE_STRUCT state
        16 |           PERSISTENT1SHOT_STRUCT transition_one_shot
        16 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |             PERSISTENT1SHOT_STATE_STRUCT state
        24 |               BOOLEAN init
        28 |               U32 iteration
        32 |               BOOLEAN prev_input
        36 |             PERSISTENT1SHOT_INPUT_STRUCT input
        36 |               BOOLEAN input
        37 |               BOOLEAN reset
        38 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |               BOOLEAN output
        40 |           F32 output_previous
        44 |           F32 transition_deviation_latched
        48 |           F32 selected_input
        56 |       REINTICH_STRUCT first_integrator
        56 |         REINTICH_COEFF_STRUCT * coeff
        64 |         REINTICH_STATE_STRUCT state
        64 |           F32 delay
        68 |           BOOLEAN reset_on_init
        72 |         REINTICH_INPUT_STRUCT input
        72 |           F32 IC
        76 |           F32 input
        80 |           BOOLEAN run
        81 |           BOOLEAN hold
        84 |         REINTICH_OUTPUT_STRUCT output
        84 |           F32 output
        88 |       REINTICH_STRUCT second_integrator
        88 |         REINTICH_COEFF_STRUCT * coeff
        96 |         REINTICH_STATE_STRUCT state
        96 |           F32 delay
       100 |           BOOLEAN reset_on_init
       104 |         REINTICH_INPUT_STRUCT input
       104 |           F32 IC
       108 |           F32 input
       112 |           BOOLEAN run
       113 |           BOOLEAN hold
       116 |         REINTICH_OUTPUT_STRUCT output
       116 |           F32 output
       120 |       F32 first_feedback_delay
       124 |       F32 second_feedback_delay
       128 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
       128 |       F32 input_one
       132 |       F32 input_two
       136 |       BOOLEAN switch_flag
       140 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       140 |       F32 output
       144 |   SWITCH_SECOND_ORDER_STRUCT attitude_switch
       144 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       152 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
       152 |       SWITCH_COMMON_STRUCT common
       152 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       160 |         SWITCH_COMMON_STATE_STRUCT state
       160 |           PERSISTENT1SHOT_STRUCT transition_one_shot
       160 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       168 |             PERSISTENT1SHOT_STATE_STRUCT state
       168 |               BOOLEAN init
       172 |               U32 iteration
       176 |               BOOLEAN prev_input
       180 |             PERSISTENT1SHOT_INPUT_STRUCT input
       180 |               BOOLEAN input
       181 |               BOOLEAN reset
       182 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
       182 |               BOOLEAN output
       184 |           F32 output_previous
       188 |           F32 transition_deviation_latched
       192 |           F32 selected_input
       200 |       REINTICH_STRUCT first_integrator
       200 |         REINTICH_COEFF_STRUCT * coeff
       208 |         REINTICH_STATE_STRUCT state
       208 |           F32 delay
       212 |           BOOLEAN reset_on_init
       216 |         REINTICH_INPUT_STRUCT input
       216 |           F32 IC
       220 |           F32 input
       224 |           BOOLEAN run
       225 |           BOOLEAN hold
       228 |         REINTICH_OUTPUT_STRUCT output
       228 |           F32 output
       232 |       REINTICH_STRUCT second_integrator
       232 |         REINTICH_COEFF_STRUCT * coeff
       240 |         REINTICH_STATE_STRUCT state
       240 |           F32 delay
       244 |           BOOLEAN reset_on_init
       248 |         REINTICH_INPUT_STRUCT input
       248 |           F32 IC
       252 |           F32 input
       256 |           BOOLEAN run
       257 |           BOOLEAN hold
       260 |         REINTICH_OUTPUT_STRUCT output
       260 |           F32 output
       264 |       F32 first_feedback_delay
       268 |       F32 second_feedback_delay
       272 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
       272 |       F32 input_one
       276 |       F32 input_two
       280 |       BOOLEAN switch_flag
       284 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       284 |       F32 output
       288 |   REINTICH_STRUCT reintich
       288 |     REINTICH_COEFF_STRUCT * coeff
       296 |     REINTICH_STATE_STRUCT state
       296 |       F32 delay
       300 |       BOOLEAN reset_on_init
       304 |     REINTICH_INPUT_STRUCT input
       304 |       F32 IC
       308 |       F32 input
       312 |       BOOLEAN run
       313 |       BOOLEAN hold
       316 |     REINTICH_OUTPUT_STRUCT output
       316 |       F32 output
       320 |   REINTICHS_STRUCT reintichs
       320 |     REINTICHS_COEFF_STRUCT * coeff
       328 |     REINTICHS_STATE_STRUCT state
       328 |       F32 IC_delay
       332 |       F32 rail_bounce
       336 |       BOOLEAN prev_sat_UL
       337 |       BOOLEAN prev_sat_LL
       338 |       BOOLEAN prev_sat_inv
       339 |       BOOLEAN prev_reset_int
       340 |       BOOLEAN prev_reset_sat
       344 |       REINTICH_STRUCT integrator
       344 |         REINTICH_COEFF_STRUCT * coeff
       352 |         REINTICH_STATE_STRUCT state
       352 |           F32 delay
       356 |           BOOLEAN reset_on_init
       360 |         REINTICH_INPUT_STRUCT input
       360 |           F32 IC
       364 |           F32 input
       368 |           BOOLEAN run
       369 |           BOOLEAN hold
       372 |         REINTICH_OUTPUT_STRUCT output
       372 |           F32 output
       376 |       SATURATIONVF_STRUCT sat
       376 |         SATURATIONVF_COEFF_STRUCT * coeff
       384 |         SATURATIONVF_STATE_STRUCT state
       384 |           F32 delay
       388 |           BOOLEAN reset_on_init
       392 |         SATURATIONVF_INPUT_STRUCT input
       392 |           F32 IC
       396 |           F32 input
       400 |           BOOLEAN reset
       404 |         SATURATIONVF_OUTPUT_STRUCT output
       404 |           F32 output
       408 |           BOOLEAN inv
       409 |           BOOLEAN satLo
       410 |           BOOLEAN satHi
       416 |     REINTICHS_INPUT_STRUCT input
       416 |       F32 IC
       420 |       F32 input
       424 |       BOOLEAN run
       425 |       BOOLEAN hold
       428 |     REINTICHS_OUTPUT_STRUCT output
       428 |       F32 output
       432 |       BOOLEAN sat_UL
       433 |       BOOLEAN sat_LL
       434 |       BOOLEAN inv
       440 |   BOOLEAN prev_run
           | [sizeof=448, align=8]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_STRUCT
         0 |   ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
         8 |   ATTITUDE_CONTROLLER_INPUT_STRUCT input
         8 |     F32 rate_cross_axis
        12 |     F32 rate_near_axis
        16 |     F32 attitude_near_axis
        20 |     F32 adp_roll_cmd
        24 |     F32 adp_pitch_cmd
        28 |     BOOLEAN run_mode
        29 |     BOOLEAN uar_mode
        32 |   ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        32 |     F32 output
        40 |   ATTITUDE_CONTROLLER_STATE_STRUCT state
        40 |     SWITCH_SECOND_ORDER_STRUCT rate_switch
        40 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        48 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
        48 |         SWITCH_COMMON_STRUCT common
        48 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        56 |           SWITCH_COMMON_STATE_STRUCT state
        56 |             PERSISTENT1SHOT_STRUCT transition_one_shot
        56 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        64 |               PERSISTENT1SHOT_STATE_STRUCT state
        64 |                 BOOLEAN init
        68 |                 U32 iteration
        72 |                 BOOLEAN prev_input
        76 |               PERSISTENT1SHOT_INPUT_STRUCT input
        76 |                 BOOLEAN input
        77 |                 BOOLEAN reset
        78 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
        78 |                 BOOLEAN output
        80 |             F32 output_previous
        84 |             F32 transition_deviation_latched
        88 |             F32 selected_input
        96 |         REINTICH_STRUCT first_integrator
        96 |           REINTICH_COEFF_STRUCT * coeff
       104 |           REINTICH_STATE_STRUCT state
       104 |             F32 delay
       108 |             BOOLEAN reset_on_init
       112 |           REINTICH_INPUT_STRUCT input
       112 |             F32 IC
       116 |             F32 input
       120 |             BOOLEAN run
       121 |             BOOLEAN hold
       124 |           REINTICH_OUTPUT_STRUCT output
       124 |             F32 output
       128 |         REINTICH_STRUCT second_integrator
       128 |           REINTICH_COEFF_STRUCT * coeff
       136 |           REINTICH_STATE_STRUCT state
       136 |             F32 delay
       140 |             BOOLEAN reset_on_init
       144 |           REINTICH_INPUT_STRUCT input
       144 |             F32 IC
       148 |             F32 input
       152 |             BOOLEAN run
       153 |             BOOLEAN hold
       156 |           REINTICH_OUTPUT_STRUCT output
       156 |             F32 output
       160 |         F32 first_feedback_delay
       164 |         F32 second_feedback_delay
       168 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
       168 |         F32 input_one
       172 |         F32 input_two
       176 |         BOOLEAN switch_flag
       180 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       180 |         F32 output
       184 |     SWITCH_SECOND_ORDER_STRUCT attitude_switch
       184 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       192 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
       192 |         SWITCH_COMMON_STRUCT common
       192 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       200 |           SWITCH_COMMON_STATE_STRUCT state
       200 |             PERSISTENT1SHOT_STRUCT transition_one_shot
       200 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       208 |               PERSISTENT1SHOT_STATE_STRUCT state
       208 |                 BOOLEAN init
       212 |                 U32 iteration
       216 |                 BOOLEAN prev_input
       220 |               PERSISTENT1SHOT_INPUT_STRUCT input
       220 |                 BOOLEAN input
       221 |                 BOOLEAN reset
       222 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
       222 |                 BOOLEAN output
       224 |             F32 output_previous
       228 |             F32 transition_deviation_latched
       232 |             F32 selected_input
       240 |         REINTICH_STRUCT first_integrator
       240 |           REINTICH_COEFF_STRUCT * coeff
       248 |           REINTICH_STATE_STRUCT state
       248 |             F32 delay
       252 |             BOOLEAN reset_on_init
       256 |           REINTICH_INPUT_STRUCT input
       256 |             F32 IC
       260 |             F32 input
       264 |             BOOLEAN run
       265 |             BOOLEAN hold
       268 |           REINTICH_OUTPUT_STRUCT output
       268 |             F32 output
       272 |         REINTICH_STRUCT second_integrator
       272 |           REINTICH_COEFF_STRUCT * coeff
       280 |           REINTICH_STATE_STRUCT state
       280 |             F32 delay
       284 |             BOOLEAN reset_on_init
       288 |           REINTICH_INPUT_STRUCT input
       288 |             F32 IC
       292 |             F32 input
       296 |             BOOLEAN run
       297 |             BOOLEAN hold
       300 |           REINTICH_OUTPUT_STRUCT output
       300 |             F32 output
       304 |         F32 first_feedback_delay
       308 |         F32 second_feedback_delay
       312 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
       312 |         F32 input_one
       316 |         F32 input_two
       320 |         BOOLEAN switch_flag
       324 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       324 |         F32 output
       328 |     REINTICH_STRUCT reintich
       328 |       REINTICH_COEFF_STRUCT * coeff
       336 |       REINTICH_STATE_STRUCT state
       336 |         F32 delay
       340 |         BOOLEAN reset_on_init
       344 |       REINTICH_INPUT_STRUCT input
       344 |         F32 IC
       348 |         F32 input
       352 |         BOOLEAN run
       353 |         BOOLEAN hold
       356 |       REINTICH_OUTPUT_STRUCT output
       356 |         F32 output
       360 |     REINTICHS_STRUCT reintichs
       360 |       REINTICHS_COEFF_STRUCT * coeff
       368 |       REINTICHS_STATE_STRUCT state
       368 |         F32 IC_delay
       372 |         F32 rail_bounce
       376 |         BOOLEAN prev_sat_UL
       377 |         BOOLEAN prev_sat_LL
       378 |         BOOLEAN prev_sat_inv
       379 |         BOOLEAN prev_reset_int
       380 |         BOOLEAN prev_reset_sat
       384 |         REINTICH_STRUCT integrator
       384 |           REINTICH_COEFF_STRUCT * coeff
       392 |           REINTICH_STATE_STRUCT state
       392 |             F32 delay
       396 |             BOOLEAN reset_on_init
       400 |           REINTICH_INPUT_STRUCT input
       400 |             F32 IC
       404 |             F32 input
       408 |             BOOLEAN run
       409 |             BOOLEAN hold
       412 |           REINTICH_OUTPUT_STRUCT output
       412 |             F32 output
       416 |         SATURATIONVF_STRUCT sat
       416 |           SATURATIONVF_COEFF_STRUCT * coeff
       424 |           SATURATIONVF_STATE_STRUCT state
       424 |             F32 delay
       428 |             BOOLEAN reset_on_init
       432 |           SATURATIONVF_INPUT_STRUCT input
       432 |             F32 IC
       436 |             F32 input
       440 |             BOOLEAN reset
       444 |           SATURATIONVF_OUTPUT_STRUCT output
       444 |             F32 output
       448 |             BOOLEAN inv
       449 |             BOOLEAN satLo
       450 |             BOOLEAN satHi
       456 |       REINTICHS_INPUT_STRUCT input
       456 |         F32 IC
       460 |         F32 input
       464 |         BOOLEAN run
       465 |         BOOLEAN hold
       468 |       REINTICHS_OUTPUT_STRUCT output
       468 |         F32 output
       472 |         BOOLEAN sat_UL
       473 |         BOOLEAN sat_LL
       474 |         BOOLEAN inv
       480 |     BOOLEAN prev_run
           | [sizeof=488, align=8]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_STATE_STRUCT
         0 |   F32 s1
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_INPUT_STRUCT
         0 |   BOOLEAN set
         1 |   BOOLEAN reset
           | [sizeof=2, align=1]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_OUTPUT_STRUCT
         0 |   BOOLEAN output
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | ROS_FLIPFLOP_STRUCT
         0 |   ROS_FLIPFLOP_STATE_STRUCT state
         0 |     F32 s1
         4 |   ROS_FLIPFLOP_INPUT_STRUCT input
         4 |     BOOLEAN set
         5 |     BOOLEAN reset
         6 |   ROS_FLIPFLOP_OUTPUT_STRUCT output
         6 |     BOOLEAN output
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | RATE_LIMITER_RIC_COEFF_STRUCT
         0 |   F32 rate_limiter_lower_limit
         4 |   F32 rate_limiter_upper_limit
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | REINTICH_COEFF_STRUCT
         0 |   F32 K_Ts
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | SWITCH_SECOND_ORDER_COEFF_STRUCT
         0 |   SWITCH_COMMON_COEFF_STRUCT common_coeff
         0 |     PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
         0 |       U32 P
         4 |       BOOLEAN ic
         5 |       BOOLEAN rising_edge
         6 |       BOOLEAN falling_edge
         8 |   REINTICH_COEFF_STRUCT first_integrator_coeff
         8 |     F32 K_Ts
        12 |   REINTICH_COEFF_STRUCT second_integrator_coeff
        12 |     F32 K_Ts
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | SATURATIONVF_COEFF_STRUCT
         0 |   F32 epsilon
         4 |   F32 upper_sat_limit
         8 |   F32 lower_sat_limit
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | REINTICHS_COEFF_STRUCT
         0 |   F32 K_Ts
         4 |   F32 UL
         8 |   F32 LL
        12 |   F32 rail_bounce_divisor
        16 |   REINTICH_COEFF_STRUCT integrator_coeff
        16 |     F32 K_Ts
        20 |   SATURATIONVF_COEFF_STRUCT sat_coeff
        20 |     F32 epsilon
        24 |     F32 upper_sat_limit
        28 |     F32 lower_sat_limit
           | [sizeof=32, align=4]

*** Dumping AST Record Layout
         0 | ATTITUDE_CONTROLLER_COEFF_STRUCT
         0 |   F32 c_reintichs_IC
         4 |   F32 c_gamma
         8 |   F32 null_attitude
        12 |   F32 upper_sat_limit
        16 |   F32 lower_sat_limit
        20 |   F32 k_rate_to_ang_accel_cross
        24 |   F32 k_rate_to_ang_accel_uar
        28 |   F32 k_rate_to_ang_accel_normal
        32 |   F32 k_attitude_to_ang_accel_uar
        36 |   F32 k_attitude_to_ang_accel_normal
        40 |   F32 k_attitude_to_ang_accel_integral_normal
        44 |   F32 k_compensation
        48 |   F32 k_ang_accel_to_cyclic
        52 |   F32 k_integrator_curve_magnitude
        56 |   SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        56 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
        56 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        56 |         U32 P
        60 |         BOOLEAN ic
        61 |         BOOLEAN rising_edge
        62 |         BOOLEAN falling_edge
        64 |     REINTICH_COEFF_STRUCT first_integrator_coeff
        64 |       F32 K_Ts
        68 |     REINTICH_COEFF_STRUCT second_integrator_coeff
        68 |       F32 K_Ts
        72 |   SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        72 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
        72 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        72 |         U32 P
        76 |         BOOLEAN ic
        77 |         BOOLEAN rising_edge
        78 |         BOOLEAN falling_edge
        80 |     REINTICH_COEFF_STRUCT first_integrator_coeff
        80 |       F32 K_Ts
        84 |     REINTICH_COEFF_STRUCT second_integrator_coeff
        84 |       F32 K_Ts
        88 |   REINTICH_COEFF_STRUCT reintich
        88 |     F32 K_Ts
        92 |   REINTICHS_COEFF_STRUCT reintichs
        92 |     F32 K_Ts
        96 |     F32 UL
       100 |     F32 LL
       104 |     F32 rail_bounce_divisor
       108 |     REINTICH_COEFF_STRUCT integrator_coeff
       108 |       F32 K_Ts
       112 |     SATURATIONVF_COEFF_STRUCT sat_coeff
       112 |       F32 epsilon
       116 |       F32 upper_sat_limit
       120 |       F32 lower_sat_limit
       124 |   SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       124 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       124 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       124 |         U32 P
       128 |         BOOLEAN ic
       129 |         BOOLEAN rising_edge
       130 |         BOOLEAN falling_edge
       132 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       132 |       F32 K_Ts
       136 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       136 |       F32 K_Ts
           | [sizeof=140, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_COEFF_STRUCT
         0 |   F32 gain
         4 |   F32 bias
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | LINTERP_STRUCT
         0 |   U8 n_regions
         4 |   LINTERP_REGION_STRUCT [10] regions
           | [sizeof=124, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_COEFF_STRUCT
         0 |   F32 pitch_bias
         4 |   RATE_LIMITER_RIC_COEFF_STRUCT roll_rate_limiter
         4 |     F32 rate_limiter_lower_limit
         8 |     F32 rate_limiter_upper_limit
        12 |   RATE_LIMITER_RIC_COEFF_STRUCT pitch_rate_limiter
        12 |     F32 rate_limiter_lower_limit
        16 |     F32 rate_limiter_upper_limit
        20 |   ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |     F32 c_reintichs_IC
        24 |     F32 c_gamma
        28 |     F32 null_attitude
        32 |     F32 upper_sat_limit
        36 |     F32 lower_sat_limit
        40 |     F32 k_rate_to_ang_accel_cross
        44 |     F32 k_rate_to_ang_accel_uar
        48 |     F32 k_rate_to_ang_accel_normal
        52 |     F32 k_attitude_to_ang_accel_uar
        56 |     F32 k_attitude_to_ang_accel_normal
        60 |     F32 k_attitude_to_ang_accel_integral_normal
        64 |     F32 k_compensation
        68 |     F32 k_ang_accel_to_cyclic
        72 |     F32 k_integrator_curve_magnitude
        76 |     SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        76 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
        76 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        76 |           U32 P
        80 |           BOOLEAN ic
        81 |           BOOLEAN rising_edge
        82 |           BOOLEAN falling_edge
        84 |       REINTICH_COEFF_STRUCT first_integrator_coeff
        84 |         F32 K_Ts
        88 |       REINTICH_COEFF_STRUCT second_integrator_coeff
        88 |         F32 K_Ts
        92 |     SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        92 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
        92 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        92 |           U32 P
        96 |           BOOLEAN ic
        97 |           BOOLEAN rising_edge
        98 |           BOOLEAN falling_edge
       100 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       100 |         F32 K_Ts
       104 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       104 |         F32 K_Ts
       108 |     REINTICH_COEFF_STRUCT reintich
       108 |       F32 K_Ts
       112 |     REINTICHS_COEFF_STRUCT reintichs
       112 |       F32 K_Ts
       116 |       F32 UL
       120 |       F32 LL
       124 |       F32 rail_bounce_divisor
       128 |       REINTICH_COEFF_STRUCT integrator_coeff
       128 |         F32 K_Ts
       132 |       SATURATIONVF_COEFF_STRUCT sat_coeff
       132 |         F32 epsilon
       136 |         F32 upper_sat_limit
       140 |         F32 lower_sat_limit
       144 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       144 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       144 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       144 |           U32 P
       148 |           BOOLEAN ic
       149 |           BOOLEAN rising_edge
       150 |           BOOLEAN falling_edge
       152 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       152 |         F32 K_Ts
       156 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       156 |         F32 K_Ts
       160 |   ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       160 |     F32 c_reintichs_IC
       164 |     F32 c_gamma
       168 |     F32 null_attitude
       172 |     F32 upper_sat_limit
       176 |     F32 lower_sat_limit
       180 |     F32 k_rate_to_ang_accel_cross
       184 |     F32 k_rate_to_ang_accel_uar
       188 |     F32 k_rate_to_ang_accel_normal
       192 |     F32 k_attitude_to_ang_accel_uar
       196 |     F32 k_attitude_to_ang_accel_normal
       200 |     F32 k_attitude_to_ang_accel_integral_normal
       204 |     F32 k_compensation
       208 |     F32 k_ang_accel_to_cyclic
       212 |     F32 k_integrator_curve_magnitude
       216 |     SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
       216 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       216 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       216 |           U32 P
       220 |           BOOLEAN ic
       221 |           BOOLEAN rising_edge
       222 |           BOOLEAN falling_edge
       224 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       224 |         F32 K_Ts
       228 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       228 |         F32 K_Ts
       232 |     SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
       232 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       232 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       232 |           U32 P
       236 |           BOOLEAN ic
       237 |           BOOLEAN rising_edge
       238 |           BOOLEAN falling_edge
       240 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       240 |         F32 K_Ts
       244 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       244 |         F32 K_Ts
       248 |     REINTICH_COEFF_STRUCT reintich
       248 |       F32 K_Ts
       252 |     REINTICHS_COEFF_STRUCT reintichs
       252 |       F32 K_Ts
       256 |       F32 UL
       260 |       F32 LL
       264 |       F32 rail_bounce_divisor
       268 |       REINTICH_COEFF_STRUCT integrator_coeff
       268 |         F32 K_Ts
       272 |       SATURATIONVF_COEFF_STRUCT sat_coeff
       272 |         F32 epsilon
       276 |         F32 upper_sat_limit
       280 |         F32 lower_sat_limit
       284 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       284 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       284 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       284 |           U32 P
       288 |           BOOLEAN ic
       289 |           BOOLEAN rising_edge
       290 |           BOOLEAN falling_edge
       292 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       292 |         F32 K_Ts
       296 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       296 |         F32 K_Ts
       300 |   SWITCH_SECOND_ORDER_COEFF_STRUCT adp_roll_cmd_switch
       300 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       300 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       300 |         U32 P
       304 |         BOOLEAN ic
       305 |         BOOLEAN rising_edge
       306 |         BOOLEAN falling_edge
       308 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       308 |       F32 K_Ts
       312 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       312 |       F32 K_Ts
       316 |   SWITCH_SECOND_ORDER_COEFF_STRUCT adp_pitch_cmd_switch
       316 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       316 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       316 |         U32 P
       320 |         BOOLEAN ic
       321 |         BOOLEAN rising_edge
       322 |         BOOLEAN falling_edge
       324 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       324 |       F32 K_Ts
       328 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       328 |       F32 K_Ts
       332 |   TEST_PORT_COEFF_STRUCT roll_testport
       332 |     F32 gain
       336 |     F32 bias
       340 |   TEST_PORT_COEFF_STRUCT pitch_testport
       340 |     F32 gain
       344 |     F32 bias
       348 |   F32 K_heading_rate_to_ang_accel_uar
       352 |   SWITCH_SECOND_ORDER_COEFF_STRUCT heading_rate_switch
       352 |     SWITCH_COMMON_COEFF_STRUCT common_coeff
       352 |       PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       352 |         U32 P
       356 |         BOOLEAN ic
       357 |         BOOLEAN rising_edge
       358 |         BOOLEAN falling_edge
       360 |     REINTICH_COEFF_STRUCT first_integrator_coeff
       360 |       F32 K_Ts
       364 |     REINTICH_COEFF_STRUCT second_integrator_coeff
       364 |       F32 K_Ts
       368 |   LINTERP_STRUCT pitch_bias_linterp
       368 |     U8 n_regions
       372 |     LINTERP_REGION_STRUCT [10] regions
           | [sizeof=492, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_STRUCT
         0 |   F32 roll
         4 |   F32 pitch
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_INPUT_STRUCT
         0 |   F32 input
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TEST_PORT_STRUCT
         0 |   TEST_PORT_COEFF_STRUCT * coeff
         8 |   TEST_PORT_INPUT_STRUCT input
         8 |     F32 input
        12 |   TEST_PORT_OUTPUT_STRUCT output
        12 |     F32 output
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_STATE_STRUCT
         0 |   ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         0 |     ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
         8 |     ATTITUDE_CONTROLLER_INPUT_STRUCT input
         8 |       F32 rate_cross_axis
        12 |       F32 rate_near_axis
        16 |       F32 attitude_near_axis
        20 |       F32 adp_roll_cmd
        24 |       F32 adp_pitch_cmd
        28 |       BOOLEAN run_mode
        29 |       BOOLEAN uar_mode
        32 |     ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        32 |       F32 output
        40 |     ATTITUDE_CONTROLLER_STATE_STRUCT state
        40 |       SWITCH_SECOND_ORDER_STRUCT rate_switch
        40 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        48 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
        48 |           SWITCH_COMMON_STRUCT common
        48 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        56 |             SWITCH_COMMON_STATE_STRUCT state
        56 |               PERSISTENT1SHOT_STRUCT transition_one_shot
        56 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        64 |                 PERSISTENT1SHOT_STATE_STRUCT state
        64 |                   BOOLEAN init
        68 |                   U32 iteration
        72 |                   BOOLEAN prev_input
        76 |                 PERSISTENT1SHOT_INPUT_STRUCT input
        76 |                   BOOLEAN input
        77 |                   BOOLEAN reset
        78 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
        78 |                   BOOLEAN output
        80 |               F32 output_previous
        84 |               F32 transition_deviation_latched
        88 |               F32 selected_input
        96 |           REINTICH_STRUCT first_integrator
        96 |             REINTICH_COEFF_STRUCT * coeff
       104 |             REINTICH_STATE_STRUCT state
       104 |               F32 delay
       108 |               BOOLEAN reset_on_init
       112 |             REINTICH_INPUT_STRUCT input
       112 |               F32 IC
       116 |               F32 input
       120 |               BOOLEAN run
       121 |               BOOLEAN hold
       124 |             REINTICH_OUTPUT_STRUCT output
       124 |               F32 output
       128 |           REINTICH_STRUCT second_integrator
       128 |             REINTICH_COEFF_STRUCT * coeff
       136 |             REINTICH_STATE_STRUCT state
       136 |               F32 delay
       140 |               BOOLEAN reset_on_init
       144 |             REINTICH_INPUT_STRUCT input
       144 |               F32 IC
       148 |               F32 input
       152 |               BOOLEAN run
       153 |               BOOLEAN hold
       156 |             REINTICH_OUTPUT_STRUCT output
       156 |               F32 output
       160 |           F32 first_feedback_delay
       164 |           F32 second_feedback_delay
       168 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       168 |           F32 input_one
       172 |           F32 input_two
       176 |           BOOLEAN switch_flag
       180 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       180 |           F32 output
       184 |       SWITCH_SECOND_ORDER_STRUCT attitude_switch
       184 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       192 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
       192 |           SWITCH_COMMON_STRUCT common
       192 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       200 |             SWITCH_COMMON_STATE_STRUCT state
       200 |               PERSISTENT1SHOT_STRUCT transition_one_shot
       200 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       208 |                 PERSISTENT1SHOT_STATE_STRUCT state
       208 |                   BOOLEAN init
       212 |                   U32 iteration
       216 |                   BOOLEAN prev_input
       220 |                 PERSISTENT1SHOT_INPUT_STRUCT input
       220 |                   BOOLEAN input
       221 |                   BOOLEAN reset
       222 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
       222 |                   BOOLEAN output
       224 |               F32 output_previous
       228 |               F32 transition_deviation_latched
       232 |               F32 selected_input
       240 |           REINTICH_STRUCT first_integrator
       240 |             REINTICH_COEFF_STRUCT * coeff
       248 |             REINTICH_STATE_STRUCT state
       248 |               F32 delay
       252 |               BOOLEAN reset_on_init
       256 |             REINTICH_INPUT_STRUCT input
       256 |               F32 IC
       260 |               F32 input
       264 |               BOOLEAN run
       265 |               BOOLEAN hold
       268 |             REINTICH_OUTPUT_STRUCT output
       268 |               F32 output
       272 |           REINTICH_STRUCT second_integrator
       272 |             REINTICH_COEFF_STRUCT * coeff
       280 |             REINTICH_STATE_STRUCT state
       280 |               F32 delay
       284 |               BOOLEAN reset_on_init
       288 |             REINTICH_INPUT_STRUCT input
       288 |               F32 IC
       292 |               F32 input
       296 |               BOOLEAN run
       297 |               BOOLEAN hold
       300 |             REINTICH_OUTPUT_STRUCT output
       300 |               F32 output
       304 |           F32 first_feedback_delay
       308 |           F32 second_feedback_delay
       312 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       312 |           F32 input_one
       316 |           F32 input_two
       320 |           BOOLEAN switch_flag
       324 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       324 |           F32 output
       328 |       REINTICH_STRUCT reintich
       328 |         REINTICH_COEFF_STRUCT * coeff
       336 |         REINTICH_STATE_STRUCT state
       336 |           F32 delay
       340 |           BOOLEAN reset_on_init
       344 |         REINTICH_INPUT_STRUCT input
       344 |           F32 IC
       348 |           F32 input
       352 |           BOOLEAN run
       353 |           BOOLEAN hold
       356 |         REINTICH_OUTPUT_STRUCT output
       356 |           F32 output
       360 |       REINTICHS_STRUCT reintichs
       360 |         REINTICHS_COEFF_STRUCT * coeff
       368 |         REINTICHS_STATE_STRUCT state
       368 |           F32 IC_delay
       372 |           F32 rail_bounce
       376 |           BOOLEAN prev_sat_UL
       377 |           BOOLEAN prev_sat_LL
       378 |           BOOLEAN prev_sat_inv
       379 |           BOOLEAN prev_reset_int
       380 |           BOOLEAN prev_reset_sat
       384 |           REINTICH_STRUCT integrator
       384 |             REINTICH_COEFF_STRUCT * coeff
       392 |             REINTICH_STATE_STRUCT state
       392 |               F32 delay
       396 |               BOOLEAN reset_on_init
       400 |             REINTICH_INPUT_STRUCT input
       400 |               F32 IC
       404 |               F32 input
       408 |               BOOLEAN run
       409 |               BOOLEAN hold
       412 |             REINTICH_OUTPUT_STRUCT output
       412 |               F32 output
       416 |           SATURATIONVF_STRUCT sat
       416 |             SATURATIONVF_COEFF_STRUCT * coeff
       424 |             SATURATIONVF_STATE_STRUCT state
       424 |               F32 delay
       428 |               BOOLEAN reset_on_init
       432 |             SATURATIONVF_INPUT_STRUCT input
       432 |               F32 IC
       436 |               F32 input
       440 |               BOOLEAN reset
       444 |             SATURATIONVF_OUTPUT_STRUCT output
       444 |               F32 output
       448 |               BOOLEAN inv
       449 |               BOOLEAN satLo
       450 |               BOOLEAN satHi
       456 |         REINTICHS_INPUT_STRUCT input
       456 |           F32 IC
       460 |           F32 input
       464 |           BOOLEAN run
       465 |           BOOLEAN hold
       468 |         REINTICHS_OUTPUT_STRUCT output
       468 |           F32 output
       472 |           BOOLEAN sat_UL
       473 |           BOOLEAN sat_LL
       474 |           BOOLEAN inv
       480 |       BOOLEAN prev_run
       488 |   ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       488 |     ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       496 |     ATTITUDE_CONTROLLER_INPUT_STRUCT input
       496 |       F32 rate_cross_axis
       500 |       F32 rate_near_axis
       504 |       F32 attitude_near_axis
       508 |       F32 adp_roll_cmd
       512 |       F32 adp_pitch_cmd
       516 |       BOOLEAN run_mode
       517 |       BOOLEAN uar_mode
       520 |     ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       520 |       F32 output
       528 |     ATTITUDE_CONTROLLER_STATE_STRUCT state
       528 |       SWITCH_SECOND_ORDER_STRUCT rate_switch
       528 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       536 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
       536 |           SWITCH_COMMON_STRUCT common
       536 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       544 |             SWITCH_COMMON_STATE_STRUCT state
       544 |               PERSISTENT1SHOT_STRUCT transition_one_shot
       544 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       552 |                 PERSISTENT1SHOT_STATE_STRUCT state
       552 |                   BOOLEAN init
       556 |                   U32 iteration
       560 |                   BOOLEAN prev_input
       564 |                 PERSISTENT1SHOT_INPUT_STRUCT input
       564 |                   BOOLEAN input
       565 |                   BOOLEAN reset
       566 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
       566 |                   BOOLEAN output
       568 |               F32 output_previous
       572 |               F32 transition_deviation_latched
       576 |               F32 selected_input
       584 |           REINTICH_STRUCT first_integrator
       584 |             REINTICH_COEFF_STRUCT * coeff
       592 |             REINTICH_STATE_STRUCT state
       592 |               F32 delay
       596 |               BOOLEAN reset_on_init
       600 |             REINTICH_INPUT_STRUCT input
       600 |               F32 IC
       604 |               F32 input
       608 |               BOOLEAN run
       609 |               BOOLEAN hold
       612 |             REINTICH_OUTPUT_STRUCT output
       612 |               F32 output
       616 |           REINTICH_STRUCT second_integrator
       616 |             REINTICH_COEFF_STRUCT * coeff
       624 |             REINTICH_STATE_STRUCT state
       624 |               F32 delay
       628 |               BOOLEAN reset_on_init
       632 |             REINTICH_INPUT_STRUCT input
       632 |               F32 IC
       636 |               F32 input
       640 |               BOOLEAN run
       641 |               BOOLEAN hold
       644 |             REINTICH_OUTPUT_STRUCT output
       644 |               F32 output
       648 |           F32 first_feedback_delay
       652 |           F32 second_feedback_delay
       656 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       656 |           F32 input_one
       660 |           F32 input_two
       664 |           BOOLEAN switch_flag
       668 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       668 |           F32 output
       672 |       SWITCH_SECOND_ORDER_STRUCT attitude_switch
       672 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       680 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
       680 |           SWITCH_COMMON_STRUCT common
       680 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       688 |             SWITCH_COMMON_STATE_STRUCT state
       688 |               PERSISTENT1SHOT_STRUCT transition_one_shot
       688 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       696 |                 PERSISTENT1SHOT_STATE_STRUCT state
       696 |                   BOOLEAN init
       700 |                   U32 iteration
       704 |                   BOOLEAN prev_input
       708 |                 PERSISTENT1SHOT_INPUT_STRUCT input
       708 |                   BOOLEAN input
       709 |                   BOOLEAN reset
       710 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
       710 |                   BOOLEAN output
       712 |               F32 output_previous
       716 |               F32 transition_deviation_latched
       720 |               F32 selected_input
       728 |           REINTICH_STRUCT first_integrator
       728 |             REINTICH_COEFF_STRUCT * coeff
       736 |             REINTICH_STATE_STRUCT state
       736 |               F32 delay
       740 |               BOOLEAN reset_on_init
       744 |             REINTICH_INPUT_STRUCT input
       744 |               F32 IC
       748 |               F32 input
       752 |               BOOLEAN run
       753 |               BOOLEAN hold
       756 |             REINTICH_OUTPUT_STRUCT output
       756 |               F32 output
       760 |           REINTICH_STRUCT second_integrator
       760 |             REINTICH_COEFF_STRUCT * coeff
       768 |             REINTICH_STATE_STRUCT state
       768 |               F32 delay
       772 |               BOOLEAN reset_on_init
       776 |             REINTICH_INPUT_STRUCT input
       776 |               F32 IC
       780 |               F32 input
       784 |               BOOLEAN run
       785 |               BOOLEAN hold
       788 |             REINTICH_OUTPUT_STRUCT output
       788 |               F32 output
       792 |           F32 first_feedback_delay
       796 |           F32 second_feedback_delay
       800 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
       800 |           F32 input_one
       804 |           F32 input_two
       808 |           BOOLEAN switch_flag
       812 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       812 |           F32 output
       816 |       REINTICH_STRUCT reintich
       816 |         REINTICH_COEFF_STRUCT * coeff
       824 |         REINTICH_STATE_STRUCT state
       824 |           F32 delay
       828 |           BOOLEAN reset_on_init
       832 |         REINTICH_INPUT_STRUCT input
       832 |           F32 IC
       836 |           F32 input
       840 |           BOOLEAN run
       841 |           BOOLEAN hold
       844 |         REINTICH_OUTPUT_STRUCT output
       844 |           F32 output
       848 |       REINTICHS_STRUCT reintichs
       848 |         REINTICHS_COEFF_STRUCT * coeff
       856 |         REINTICHS_STATE_STRUCT state
       856 |           F32 IC_delay
       860 |           F32 rail_bounce
       864 |           BOOLEAN prev_sat_UL
       865 |           BOOLEAN prev_sat_LL
       866 |           BOOLEAN prev_sat_inv
       867 |           BOOLEAN prev_reset_int
       868 |           BOOLEAN prev_reset_sat
       872 |           REINTICH_STRUCT integrator
       872 |             REINTICH_COEFF_STRUCT * coeff
       880 |             REINTICH_STATE_STRUCT state
       880 |               F32 delay
       884 |               BOOLEAN reset_on_init
       888 |             REINTICH_INPUT_STRUCT input
       888 |               F32 IC
       892 |               F32 input
       896 |               BOOLEAN run
       897 |               BOOLEAN hold
       900 |             REINTICH_OUTPUT_STRUCT output
       900 |               F32 output
       904 |           SATURATIONVF_STRUCT sat
       904 |             SATURATIONVF_COEFF_STRUCT * coeff
       912 |             SATURATIONVF_STATE_STRUCT state
       912 |               F32 delay
       916 |               BOOLEAN reset_on_init
       920 |             SATURATIONVF_INPUT_STRUCT input
       920 |               F32 IC
       924 |               F32 input
       928 |               BOOLEAN reset
       932 |             SATURATIONVF_OUTPUT_STRUCT output
       932 |               F32 output
       936 |               BOOLEAN inv
       937 |               BOOLEAN satLo
       938 |               BOOLEAN satHi
       944 |         REINTICHS_INPUT_STRUCT input
       944 |           F32 IC
       948 |           F32 input
       952 |           BOOLEAN run
       953 |           BOOLEAN hold
       956 |         REINTICHS_OUTPUT_STRUCT output
       956 |           F32 output
       960 |           BOOLEAN sat_UL
       961 |           BOOLEAN sat_LL
       962 |           BOOLEAN inv
       968 |       BOOLEAN prev_run
       976 |   F32 roll_rate_limiter_previous_state
       980 |   F32 pitch_rate_limiter_previous_state
       984 |   SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
       984 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       992 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
       992 |       SWITCH_COMMON_STRUCT common
       992 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1000 |         SWITCH_COMMON_STATE_STRUCT state
      1000 |           PERSISTENT1SHOT_STRUCT transition_one_shot
      1000 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1008 |             PERSISTENT1SHOT_STATE_STRUCT state
      1008 |               BOOLEAN init
      1012 |               U32 iteration
      1016 |               BOOLEAN prev_input
      1020 |             PERSISTENT1SHOT_INPUT_STRUCT input
      1020 |               BOOLEAN input
      1021 |               BOOLEAN reset
      1022 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
      1022 |               BOOLEAN output
      1024 |           F32 output_previous
      1028 |           F32 transition_deviation_latched
      1032 |           F32 selected_input
      1040 |       REINTICH_STRUCT first_integrator
      1040 |         REINTICH_COEFF_STRUCT * coeff
      1048 |         REINTICH_STATE_STRUCT state
      1048 |           F32 delay
      1052 |           BOOLEAN reset_on_init
      1056 |         REINTICH_INPUT_STRUCT input
      1056 |           F32 IC
      1060 |           F32 input
      1064 |           BOOLEAN run
      1065 |           BOOLEAN hold
      1068 |         REINTICH_OUTPUT_STRUCT output
      1068 |           F32 output
      1072 |       REINTICH_STRUCT second_integrator
      1072 |         REINTICH_COEFF_STRUCT * coeff
      1080 |         REINTICH_STATE_STRUCT state
      1080 |           F32 delay
      1084 |           BOOLEAN reset_on_init
      1088 |         REINTICH_INPUT_STRUCT input
      1088 |           F32 IC
      1092 |           F32 input
      1096 |           BOOLEAN run
      1097 |           BOOLEAN hold
      1100 |         REINTICH_OUTPUT_STRUCT output
      1100 |           F32 output
      1104 |       F32 first_feedback_delay
      1108 |       F32 second_feedback_delay
      1112 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1112 |       F32 input_one
      1116 |       F32 input_two
      1120 |       BOOLEAN switch_flag
      1124 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1124 |       F32 output
      1128 |   SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1128 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1136 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
      1136 |       SWITCH_COMMON_STRUCT common
      1136 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1144 |         SWITCH_COMMON_STATE_STRUCT state
      1144 |           PERSISTENT1SHOT_STRUCT transition_one_shot
      1144 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1152 |             PERSISTENT1SHOT_STATE_STRUCT state
      1152 |               BOOLEAN init
      1156 |               U32 iteration
      1160 |               BOOLEAN prev_input
      1164 |             PERSISTENT1SHOT_INPUT_STRUCT input
      1164 |               BOOLEAN input
      1165 |               BOOLEAN reset
      1166 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
      1166 |               BOOLEAN output
      1168 |           F32 output_previous
      1172 |           F32 transition_deviation_latched
      1176 |           F32 selected_input
      1184 |       REINTICH_STRUCT first_integrator
      1184 |         REINTICH_COEFF_STRUCT * coeff
      1192 |         REINTICH_STATE_STRUCT state
      1192 |           F32 delay
      1196 |           BOOLEAN reset_on_init
      1200 |         REINTICH_INPUT_STRUCT input
      1200 |           F32 IC
      1204 |           F32 input
      1208 |           BOOLEAN run
      1209 |           BOOLEAN hold
      1212 |         REINTICH_OUTPUT_STRUCT output
      1212 |           F32 output
      1216 |       REINTICH_STRUCT second_integrator
      1216 |         REINTICH_COEFF_STRUCT * coeff
      1224 |         REINTICH_STATE_STRUCT state
      1224 |           F32 delay
      1228 |           BOOLEAN reset_on_init
      1232 |         REINTICH_INPUT_STRUCT input
      1232 |           F32 IC
      1236 |           F32 input
      1240 |           BOOLEAN run
      1241 |           BOOLEAN hold
      1244 |         REINTICH_OUTPUT_STRUCT output
      1244 |           F32 output
      1248 |       F32 first_feedback_delay
      1252 |       F32 second_feedback_delay
      1256 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1256 |       F32 input_one
      1260 |       F32 input_two
      1264 |       BOOLEAN switch_flag
      1268 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1268 |       F32 output
      1272 |   TEST_PORT_STRUCT roll_testport
      1272 |     TEST_PORT_COEFF_STRUCT * coeff
      1280 |     TEST_PORT_INPUT_STRUCT input
      1280 |       F32 input
      1284 |     TEST_PORT_OUTPUT_STRUCT output
      1284 |       F32 output
      1288 |   TEST_PORT_STRUCT pitch_testport
      1288 |     TEST_PORT_COEFF_STRUCT * coeff
      1296 |     TEST_PORT_INPUT_STRUCT input
      1296 |       F32 input
      1300 |     TEST_PORT_OUTPUT_STRUCT output
      1300 |       F32 output
      1304 |   BOOLEAN first_frame
      1312 |   SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1312 |     SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1320 |     SWITCH_SECOND_ORDER_STATE_STRUCT state
      1320 |       SWITCH_COMMON_STRUCT common
      1320 |         SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1328 |         SWITCH_COMMON_STATE_STRUCT state
      1328 |           PERSISTENT1SHOT_STRUCT transition_one_shot
      1328 |             PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1336 |             PERSISTENT1SHOT_STATE_STRUCT state
      1336 |               BOOLEAN init
      1340 |               U32 iteration
      1344 |               BOOLEAN prev_input
      1348 |             PERSISTENT1SHOT_INPUT_STRUCT input
      1348 |               BOOLEAN input
      1349 |               BOOLEAN reset
      1350 |             PERSISTENT1SHOT_OUTPUT_STRUCT output
      1350 |               BOOLEAN output
      1352 |           F32 output_previous
      1356 |           F32 transition_deviation_latched
      1360 |           F32 selected_input
      1368 |       REINTICH_STRUCT first_integrator
      1368 |         REINTICH_COEFF_STRUCT * coeff
      1376 |         REINTICH_STATE_STRUCT state
      1376 |           F32 delay
      1380 |           BOOLEAN reset_on_init
      1384 |         REINTICH_INPUT_STRUCT input
      1384 |           F32 IC
      1388 |           F32 input
      1392 |           BOOLEAN run
      1393 |           BOOLEAN hold
      1396 |         REINTICH_OUTPUT_STRUCT output
      1396 |           F32 output
      1400 |       REINTICH_STRUCT second_integrator
      1400 |         REINTICH_COEFF_STRUCT * coeff
      1408 |         REINTICH_STATE_STRUCT state
      1408 |           F32 delay
      1412 |           BOOLEAN reset_on_init
      1416 |         REINTICH_INPUT_STRUCT input
      1416 |           F32 IC
      1420 |           F32 input
      1424 |           BOOLEAN run
      1425 |           BOOLEAN hold
      1428 |         REINTICH_OUTPUT_STRUCT output
      1428 |           F32 output
      1432 |       F32 first_feedback_delay
      1436 |       F32 second_feedback_delay
      1440 |     SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1440 |       F32 input_one
      1444 |       F32 input_two
      1448 |       BOOLEAN switch_flag
      1452 |     SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1452 |       F32 output
      1456 |   F32 switched_heading_rate
      1460 |   F32 roll_test_input
      1464 |   F32 pitch_test_input
           | [sizeof=1472, align=8]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_INPUT_STRUCT
         0 |   F32 adp_phi_cmd
         4 |   F32 adp_theta_cmd
         8 |   F32 phi
        12 |   F32 phi_dot
        16 |   F32 psi_dot
        20 |   F32 theta
        24 |   F32 theta_dot
        28 |   F32 p
        32 |   F32 q
        36 |   BOOLEAN reset
        37 |   BOOLEAN UAR_mode
        38 |   BOOLEAN triplex_fault
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_FEEDBACK_STRUCT
         0 |   CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
         8 |   CYCLIC_FEEDBACK_STATE_STRUCT state
         8 |     ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         8 |       ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        16 |       ATTITUDE_CONTROLLER_INPUT_STRUCT input
        16 |         F32 rate_cross_axis
        20 |         F32 rate_near_axis
        24 |         F32 attitude_near_axis
        28 |         F32 adp_roll_cmd
        32 |         F32 adp_pitch_cmd
        36 |         BOOLEAN run_mode
        37 |         BOOLEAN uar_mode
        40 |       ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        40 |         F32 output
        48 |       ATTITUDE_CONTROLLER_STATE_STRUCT state
        48 |         SWITCH_SECOND_ORDER_STRUCT rate_switch
        48 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        56 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
        56 |             SWITCH_COMMON_STRUCT common
        56 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        64 |               SWITCH_COMMON_STATE_STRUCT state
        64 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
        64 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        72 |                   PERSISTENT1SHOT_STATE_STRUCT state
        72 |                     BOOLEAN init
        76 |                     U32 iteration
        80 |                     BOOLEAN prev_input
        84 |                   PERSISTENT1SHOT_INPUT_STRUCT input
        84 |                     BOOLEAN input
        85 |                     BOOLEAN reset
        86 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
        86 |                     BOOLEAN output
        88 |                 F32 output_previous
        92 |                 F32 transition_deviation_latched
        96 |                 F32 selected_input
       104 |             REINTICH_STRUCT first_integrator
       104 |               REINTICH_COEFF_STRUCT * coeff
       112 |               REINTICH_STATE_STRUCT state
       112 |                 F32 delay
       116 |                 BOOLEAN reset_on_init
       120 |               REINTICH_INPUT_STRUCT input
       120 |                 F32 IC
       124 |                 F32 input
       128 |                 BOOLEAN run
       129 |                 BOOLEAN hold
       132 |               REINTICH_OUTPUT_STRUCT output
       132 |                 F32 output
       136 |             REINTICH_STRUCT second_integrator
       136 |               REINTICH_COEFF_STRUCT * coeff
       144 |               REINTICH_STATE_STRUCT state
       144 |                 F32 delay
       148 |                 BOOLEAN reset_on_init
       152 |               REINTICH_INPUT_STRUCT input
       152 |                 F32 IC
       156 |                 F32 input
       160 |                 BOOLEAN run
       161 |                 BOOLEAN hold
       164 |               REINTICH_OUTPUT_STRUCT output
       164 |                 F32 output
       168 |             F32 first_feedback_delay
       172 |             F32 second_feedback_delay
       176 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       176 |             F32 input_one
       180 |             F32 input_two
       184 |             BOOLEAN switch_flag
       188 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       188 |             F32 output
       192 |         SWITCH_SECOND_ORDER_STRUCT attitude_switch
       192 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       200 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
       200 |             SWITCH_COMMON_STRUCT common
       200 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       208 |               SWITCH_COMMON_STATE_STRUCT state
       208 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
       208 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       216 |                   PERSISTENT1SHOT_STATE_STRUCT state
       216 |                     BOOLEAN init
       220 |                     U32 iteration
       224 |                     BOOLEAN prev_input
       228 |                   PERSISTENT1SHOT_INPUT_STRUCT input
       228 |                     BOOLEAN input
       229 |                     BOOLEAN reset
       230 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
       230 |                     BOOLEAN output
       232 |                 F32 output_previous
       236 |                 F32 transition_deviation_latched
       240 |                 F32 selected_input
       248 |             REINTICH_STRUCT first_integrator
       248 |               REINTICH_COEFF_STRUCT * coeff
       256 |               REINTICH_STATE_STRUCT state
       256 |                 F32 delay
       260 |                 BOOLEAN reset_on_init
       264 |               REINTICH_INPUT_STRUCT input
       264 |                 F32 IC
       268 |                 F32 input
       272 |                 BOOLEAN run
       273 |                 BOOLEAN hold
       276 |               REINTICH_OUTPUT_STRUCT output
       276 |                 F32 output
       280 |             REINTICH_STRUCT second_integrator
       280 |               REINTICH_COEFF_STRUCT * coeff
       288 |               REINTICH_STATE_STRUCT state
       288 |                 F32 delay
       292 |                 BOOLEAN reset_on_init
       296 |               REINTICH_INPUT_STRUCT input
       296 |                 F32 IC
       300 |                 F32 input
       304 |                 BOOLEAN run
       305 |                 BOOLEAN hold
       308 |               REINTICH_OUTPUT_STRUCT output
       308 |                 F32 output
       312 |             F32 first_feedback_delay
       316 |             F32 second_feedback_delay
       320 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       320 |             F32 input_one
       324 |             F32 input_two
       328 |             BOOLEAN switch_flag
       332 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       332 |             F32 output
       336 |         REINTICH_STRUCT reintich
       336 |           REINTICH_COEFF_STRUCT * coeff
       344 |           REINTICH_STATE_STRUCT state
       344 |             F32 delay
       348 |             BOOLEAN reset_on_init
       352 |           REINTICH_INPUT_STRUCT input
       352 |             F32 IC
       356 |             F32 input
       360 |             BOOLEAN run
       361 |             BOOLEAN hold
       364 |           REINTICH_OUTPUT_STRUCT output
       364 |             F32 output
       368 |         REINTICHS_STRUCT reintichs
       368 |           REINTICHS_COEFF_STRUCT * coeff
       376 |           REINTICHS_STATE_STRUCT state
       376 |             F32 IC_delay
       380 |             F32 rail_bounce
       384 |             BOOLEAN prev_sat_UL
       385 |             BOOLEAN prev_sat_LL
       386 |             BOOLEAN prev_sat_inv
       387 |             BOOLEAN prev_reset_int
       388 |             BOOLEAN prev_reset_sat
       392 |             REINTICH_STRUCT integrator
       392 |               REINTICH_COEFF_STRUCT * coeff
       400 |               REINTICH_STATE_STRUCT state
       400 |                 F32 delay
       404 |                 BOOLEAN reset_on_init
       408 |               REINTICH_INPUT_STRUCT input
       408 |                 F32 IC
       412 |                 F32 input
       416 |                 BOOLEAN run
       417 |                 BOOLEAN hold
       420 |               REINTICH_OUTPUT_STRUCT output
       420 |                 F32 output
       424 |             SATURATIONVF_STRUCT sat
       424 |               SATURATIONVF_COEFF_STRUCT * coeff
       432 |               SATURATIONVF_STATE_STRUCT state
       432 |                 F32 delay
       436 |                 BOOLEAN reset_on_init
       440 |               SATURATIONVF_INPUT_STRUCT input
       440 |                 F32 IC
       444 |                 F32 input
       448 |                 BOOLEAN reset
       452 |               SATURATIONVF_OUTPUT_STRUCT output
       452 |                 F32 output
       456 |                 BOOLEAN inv
       457 |                 BOOLEAN satLo
       458 |                 BOOLEAN satHi
       464 |           REINTICHS_INPUT_STRUCT input
       464 |             F32 IC
       468 |             F32 input
       472 |             BOOLEAN run
       473 |             BOOLEAN hold
       476 |           REINTICHS_OUTPUT_STRUCT output
       476 |             F32 output
       480 |             BOOLEAN sat_UL
       481 |             BOOLEAN sat_LL
       482 |             BOOLEAN inv
       488 |         BOOLEAN prev_run
       496 |     ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       496 |       ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       504 |       ATTITUDE_CONTROLLER_INPUT_STRUCT input
       504 |         F32 rate_cross_axis
       508 |         F32 rate_near_axis
       512 |         F32 attitude_near_axis
       516 |         F32 adp_roll_cmd
       520 |         F32 adp_pitch_cmd
       524 |         BOOLEAN run_mode
       525 |         BOOLEAN uar_mode
       528 |       ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       528 |         F32 output
       536 |       ATTITUDE_CONTROLLER_STATE_STRUCT state
       536 |         SWITCH_SECOND_ORDER_STRUCT rate_switch
       536 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       544 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
       544 |             SWITCH_COMMON_STRUCT common
       544 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       552 |               SWITCH_COMMON_STATE_STRUCT state
       552 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
       552 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       560 |                   PERSISTENT1SHOT_STATE_STRUCT state
       560 |                     BOOLEAN init
       564 |                     U32 iteration
       568 |                     BOOLEAN prev_input
       572 |                   PERSISTENT1SHOT_INPUT_STRUCT input
       572 |                     BOOLEAN input
       573 |                     BOOLEAN reset
       574 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
       574 |                     BOOLEAN output
       576 |                 F32 output_previous
       580 |                 F32 transition_deviation_latched
       584 |                 F32 selected_input
       592 |             REINTICH_STRUCT first_integrator
       592 |               REINTICH_COEFF_STRUCT * coeff
       600 |               REINTICH_STATE_STRUCT state
       600 |                 F32 delay
       604 |                 BOOLEAN reset_on_init
       608 |               REINTICH_INPUT_STRUCT input
       608 |                 F32 IC
       612 |                 F32 input
       616 |                 BOOLEAN run
       617 |                 BOOLEAN hold
       620 |               REINTICH_OUTPUT_STRUCT output
       620 |                 F32 output
       624 |             REINTICH_STRUCT second_integrator
       624 |               REINTICH_COEFF_STRUCT * coeff
       632 |               REINTICH_STATE_STRUCT state
       632 |                 F32 delay
       636 |                 BOOLEAN reset_on_init
       640 |               REINTICH_INPUT_STRUCT input
       640 |                 F32 IC
       644 |                 F32 input
       648 |                 BOOLEAN run
       649 |                 BOOLEAN hold
       652 |               REINTICH_OUTPUT_STRUCT output
       652 |                 F32 output
       656 |             F32 first_feedback_delay
       660 |             F32 second_feedback_delay
       664 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       664 |             F32 input_one
       668 |             F32 input_two
       672 |             BOOLEAN switch_flag
       676 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       676 |             F32 output
       680 |         SWITCH_SECOND_ORDER_STRUCT attitude_switch
       680 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       688 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
       688 |             SWITCH_COMMON_STRUCT common
       688 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       696 |               SWITCH_COMMON_STATE_STRUCT state
       696 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
       696 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       704 |                   PERSISTENT1SHOT_STATE_STRUCT state
       704 |                     BOOLEAN init
       708 |                     U32 iteration
       712 |                     BOOLEAN prev_input
       716 |                   PERSISTENT1SHOT_INPUT_STRUCT input
       716 |                     BOOLEAN input
       717 |                     BOOLEAN reset
       718 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
       718 |                     BOOLEAN output
       720 |                 F32 output_previous
       724 |                 F32 transition_deviation_latched
       728 |                 F32 selected_input
       736 |             REINTICH_STRUCT first_integrator
       736 |               REINTICH_COEFF_STRUCT * coeff
       744 |               REINTICH_STATE_STRUCT state
       744 |                 F32 delay
       748 |                 BOOLEAN reset_on_init
       752 |               REINTICH_INPUT_STRUCT input
       752 |                 F32 IC
       756 |                 F32 input
       760 |                 BOOLEAN run
       761 |                 BOOLEAN hold
       764 |               REINTICH_OUTPUT_STRUCT output
       764 |                 F32 output
       768 |             REINTICH_STRUCT second_integrator
       768 |               REINTICH_COEFF_STRUCT * coeff
       776 |               REINTICH_STATE_STRUCT state
       776 |                 F32 delay
       780 |                 BOOLEAN reset_on_init
       784 |               REINTICH_INPUT_STRUCT input
       784 |                 F32 IC
       788 |                 F32 input
       792 |                 BOOLEAN run
       793 |                 BOOLEAN hold
       796 |               REINTICH_OUTPUT_STRUCT output
       796 |                 F32 output
       800 |             F32 first_feedback_delay
       804 |             F32 second_feedback_delay
       808 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
       808 |             F32 input_one
       812 |             F32 input_two
       816 |             BOOLEAN switch_flag
       820 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       820 |             F32 output
       824 |         REINTICH_STRUCT reintich
       824 |           REINTICH_COEFF_STRUCT * coeff
       832 |           REINTICH_STATE_STRUCT state
       832 |             F32 delay
       836 |             BOOLEAN reset_on_init
       840 |           REINTICH_INPUT_STRUCT input
       840 |             F32 IC
       844 |             F32 input
       848 |             BOOLEAN run
       849 |             BOOLEAN hold
       852 |           REINTICH_OUTPUT_STRUCT output
       852 |             F32 output
       856 |         REINTICHS_STRUCT reintichs
       856 |           REINTICHS_COEFF_STRUCT * coeff
       864 |           REINTICHS_STATE_STRUCT state
       864 |             F32 IC_delay
       868 |             F32 rail_bounce
       872 |             BOOLEAN prev_sat_UL
       873 |             BOOLEAN prev_sat_LL
       874 |             BOOLEAN prev_sat_inv
       875 |             BOOLEAN prev_reset_int
       876 |             BOOLEAN prev_reset_sat
       880 |             REINTICH_STRUCT integrator
       880 |               REINTICH_COEFF_STRUCT * coeff
       888 |               REINTICH_STATE_STRUCT state
       888 |                 F32 delay
       892 |                 BOOLEAN reset_on_init
       896 |               REINTICH_INPUT_STRUCT input
       896 |                 F32 IC
       900 |                 F32 input
       904 |                 BOOLEAN run
       905 |                 BOOLEAN hold
       908 |               REINTICH_OUTPUT_STRUCT output
       908 |                 F32 output
       912 |             SATURATIONVF_STRUCT sat
       912 |               SATURATIONVF_COEFF_STRUCT * coeff
       920 |               SATURATIONVF_STATE_STRUCT state
       920 |                 F32 delay
       924 |                 BOOLEAN reset_on_init
       928 |               SATURATIONVF_INPUT_STRUCT input
       928 |                 F32 IC
       932 |                 F32 input
       936 |                 BOOLEAN reset
       940 |               SATURATIONVF_OUTPUT_STRUCT output
       940 |                 F32 output
       944 |                 BOOLEAN inv
       945 |                 BOOLEAN satLo
       946 |                 BOOLEAN satHi
       952 |           REINTICHS_INPUT_STRUCT input
       952 |             F32 IC
       956 |             F32 input
       960 |             BOOLEAN run
       961 |             BOOLEAN hold
       964 |           REINTICHS_OUTPUT_STRUCT output
       964 |             F32 output
       968 |             BOOLEAN sat_UL
       969 |             BOOLEAN sat_LL
       970 |             BOOLEAN inv
       976 |         BOOLEAN prev_run
       984 |     F32 roll_rate_limiter_previous_state
       988 |     F32 pitch_rate_limiter_previous_state
       992 |     SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
       992 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1000 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
      1000 |         SWITCH_COMMON_STRUCT common
      1000 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1008 |           SWITCH_COMMON_STATE_STRUCT state
      1008 |             PERSISTENT1SHOT_STRUCT transition_one_shot
      1008 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1016 |               PERSISTENT1SHOT_STATE_STRUCT state
      1016 |                 BOOLEAN init
      1020 |                 U32 iteration
      1024 |                 BOOLEAN prev_input
      1028 |               PERSISTENT1SHOT_INPUT_STRUCT input
      1028 |                 BOOLEAN input
      1029 |                 BOOLEAN reset
      1030 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
      1030 |                 BOOLEAN output
      1032 |             F32 output_previous
      1036 |             F32 transition_deviation_latched
      1040 |             F32 selected_input
      1048 |         REINTICH_STRUCT first_integrator
      1048 |           REINTICH_COEFF_STRUCT * coeff
      1056 |           REINTICH_STATE_STRUCT state
      1056 |             F32 delay
      1060 |             BOOLEAN reset_on_init
      1064 |           REINTICH_INPUT_STRUCT input
      1064 |             F32 IC
      1068 |             F32 input
      1072 |             BOOLEAN run
      1073 |             BOOLEAN hold
      1076 |           REINTICH_OUTPUT_STRUCT output
      1076 |             F32 output
      1080 |         REINTICH_STRUCT second_integrator
      1080 |           REINTICH_COEFF_STRUCT * coeff
      1088 |           REINTICH_STATE_STRUCT state
      1088 |             F32 delay
      1092 |             BOOLEAN reset_on_init
      1096 |           REINTICH_INPUT_STRUCT input
      1096 |             F32 IC
      1100 |             F32 input
      1104 |             BOOLEAN run
      1105 |             BOOLEAN hold
      1108 |           REINTICH_OUTPUT_STRUCT output
      1108 |             F32 output
      1112 |         F32 first_feedback_delay
      1116 |         F32 second_feedback_delay
      1120 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1120 |         F32 input_one
      1124 |         F32 input_two
      1128 |         BOOLEAN switch_flag
      1132 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1132 |         F32 output
      1136 |     SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1136 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1144 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
      1144 |         SWITCH_COMMON_STRUCT common
      1144 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1152 |           SWITCH_COMMON_STATE_STRUCT state
      1152 |             PERSISTENT1SHOT_STRUCT transition_one_shot
      1152 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1160 |               PERSISTENT1SHOT_STATE_STRUCT state
      1160 |                 BOOLEAN init
      1164 |                 U32 iteration
      1168 |                 BOOLEAN prev_input
      1172 |               PERSISTENT1SHOT_INPUT_STRUCT input
      1172 |                 BOOLEAN input
      1173 |                 BOOLEAN reset
      1174 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
      1174 |                 BOOLEAN output
      1176 |             F32 output_previous
      1180 |             F32 transition_deviation_latched
      1184 |             F32 selected_input
      1192 |         REINTICH_STRUCT first_integrator
      1192 |           REINTICH_COEFF_STRUCT * coeff
      1200 |           REINTICH_STATE_STRUCT state
      1200 |             F32 delay
      1204 |             BOOLEAN reset_on_init
      1208 |           REINTICH_INPUT_STRUCT input
      1208 |             F32 IC
      1212 |             F32 input
      1216 |             BOOLEAN run
      1217 |             BOOLEAN hold
      1220 |           REINTICH_OUTPUT_STRUCT output
      1220 |             F32 output
      1224 |         REINTICH_STRUCT second_integrator
      1224 |           REINTICH_COEFF_STRUCT * coeff
      1232 |           REINTICH_STATE_STRUCT state
      1232 |             F32 delay
      1236 |             BOOLEAN reset_on_init
      1240 |           REINTICH_INPUT_STRUCT input
      1240 |             F32 IC
      1244 |             F32 input
      1248 |             BOOLEAN run
      1249 |             BOOLEAN hold
      1252 |           REINTICH_OUTPUT_STRUCT output
      1252 |             F32 output
      1256 |         F32 first_feedback_delay
      1260 |         F32 second_feedback_delay
      1264 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1264 |         F32 input_one
      1268 |         F32 input_two
      1272 |         BOOLEAN switch_flag
      1276 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1276 |         F32 output
      1280 |     TEST_PORT_STRUCT roll_testport
      1280 |       TEST_PORT_COEFF_STRUCT * coeff
      1288 |       TEST_PORT_INPUT_STRUCT input
      1288 |         F32 input
      1292 |       TEST_PORT_OUTPUT_STRUCT output
      1292 |         F32 output
      1296 |     TEST_PORT_STRUCT pitch_testport
      1296 |       TEST_PORT_COEFF_STRUCT * coeff
      1304 |       TEST_PORT_INPUT_STRUCT input
      1304 |         F32 input
      1308 |       TEST_PORT_OUTPUT_STRUCT output
      1308 |         F32 output
      1312 |     BOOLEAN first_frame
      1320 |     SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1320 |       SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1328 |       SWITCH_SECOND_ORDER_STATE_STRUCT state
      1328 |         SWITCH_COMMON_STRUCT common
      1328 |           SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1336 |           SWITCH_COMMON_STATE_STRUCT state
      1336 |             PERSISTENT1SHOT_STRUCT transition_one_shot
      1336 |               PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1344 |               PERSISTENT1SHOT_STATE_STRUCT state
      1344 |                 BOOLEAN init
      1348 |                 U32 iteration
      1352 |                 BOOLEAN prev_input
      1356 |               PERSISTENT1SHOT_INPUT_STRUCT input
      1356 |                 BOOLEAN input
      1357 |                 BOOLEAN reset
      1358 |               PERSISTENT1SHOT_OUTPUT_STRUCT output
      1358 |                 BOOLEAN output
      1360 |             F32 output_previous
      1364 |             F32 transition_deviation_latched
      1368 |             F32 selected_input
      1376 |         REINTICH_STRUCT first_integrator
      1376 |           REINTICH_COEFF_STRUCT * coeff
      1384 |           REINTICH_STATE_STRUCT state
      1384 |             F32 delay
      1388 |             BOOLEAN reset_on_init
      1392 |           REINTICH_INPUT_STRUCT input
      1392 |             F32 IC
      1396 |             F32 input
      1400 |             BOOLEAN run
      1401 |             BOOLEAN hold
      1404 |           REINTICH_OUTPUT_STRUCT output
      1404 |             F32 output
      1408 |         REINTICH_STRUCT second_integrator
      1408 |           REINTICH_COEFF_STRUCT * coeff
      1416 |           REINTICH_STATE_STRUCT state
      1416 |             F32 delay
      1420 |             BOOLEAN reset_on_init
      1424 |           REINTICH_INPUT_STRUCT input
      1424 |             F32 IC
      1428 |             F32 input
      1432 |             BOOLEAN run
      1433 |             BOOLEAN hold
      1436 |           REINTICH_OUTPUT_STRUCT output
      1436 |             F32 output
      1440 |         F32 first_feedback_delay
      1444 |         F32 second_feedback_delay
      1448 |       SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1448 |         F32 input_one
      1452 |         F32 input_two
      1456 |         BOOLEAN switch_flag
      1460 |       SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1460 |         F32 output
      1464 |     F32 switched_heading_rate
      1468 |     F32 roll_test_input
      1472 |     F32 pitch_test_input
      1480 |   CYCLIC_FEEDBACK_INPUT_STRUCT input
      1480 |     F32 adp_phi_cmd
      1484 |     F32 adp_theta_cmd
      1488 |     F32 phi
      1492 |     F32 phi_dot
      1496 |     F32 psi_dot
      1500 |     F32 theta
      1504 |     F32 theta_dot
      1508 |     F32 p
      1512 |     F32 q
      1516 |     BOOLEAN reset
      1517 |     BOOLEAN UAR_mode
      1518 |     BOOLEAN triplex_fault
           | [sizeof=1520, align=8]

*** Dumping AST Record Layout
         0 | struct localerefcount
         0 |   char * locale
         8 |   wchar_t * wlocale
        16 |   int * refcount
        24 |   int * wrefcount
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_INPUT_STRUCT
         0 |   BOOLEAN run
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_OUTPUT_STRUCT
         0 |   BOOLEAN command_fail
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_STATE_STRUCT
         0 |   F32 [10] regfile
        40 |   U32 regfile_index
        44 |   F32 sum
        48 |   F32 average
        52 |   U16 sample_interval
        54 |   BOOLEAN do_first_frame
           | [sizeof=56, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_INPUT_STRUCT
         0 |   F32 input
         4 |   F32 input_IC
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_STRUCT
         0 |   TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
         8 |   TENTH_ORDER_AVERAGE_STATE_STRUCT state
         8 |     F32 [10] regfile
        48 |     U32 regfile_index
        52 |     F32 sum
        56 |     F32 average
        60 |     U16 sample_interval
        62 |     BOOLEAN do_first_frame
        64 |   TENTH_ORDER_AVERAGE_INPUT_STRUCT input
        64 |     F32 input
        68 |     F32 input_IC
        72 |     BOOLEAN reset
        76 |   TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
        76 |     F32 output
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_STATE_STRUCT
         0 |   F32 s1
         4 |   F32 s2
         8 |   BOOLEAN do_first_frame
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_INPUT_STRUCT
         0 |   F32 input
         4 |   F32 input_IC
         8 |   BOOLEAN reset
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_OUTPUT_STRUCT
         0 |   F32 output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_STRUCT
         0 |   FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
         8 |   FIRSTORDERFILTER_STATE_STRUCT state
         8 |     F32 s1
        12 |     F32 s2
        16 |     BOOLEAN do_first_frame
        20 |   FIRSTORDERFILTER_INPUT_STRUCT input
        20 |     F32 input
        24 |     F32 input_IC
        28 |     BOOLEAN reset
        32 |   FIRSTORDERFILTER_OUTPUT_STRUCT output
        32 |     F32 output
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_STATE_STRUCT
         0 |   PERSISTENT1SHOT_STRUCT p1shot
         0 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
         8 |     PERSISTENT1SHOT_STATE_STRUCT state
         8 |       BOOLEAN init
        12 |       U32 iteration
        16 |       BOOLEAN prev_input
        20 |     PERSISTENT1SHOT_INPUT_STRUCT input
        20 |       BOOLEAN input
        21 |       BOOLEAN reset
        22 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   TENTH_ORDER_AVERAGE_STRUCT toa
        24 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        32 |     TENTH_ORDER_AVERAGE_STATE_STRUCT state
        32 |       F32 [10] regfile
        72 |       U32 regfile_index
        76 |       F32 sum
        80 |       F32 average
        84 |       U16 sample_interval
        86 |       BOOLEAN do_first_frame
        88 |     TENTH_ORDER_AVERAGE_INPUT_STRUCT input
        88 |       F32 input
        92 |       F32 input_IC
        96 |       BOOLEAN reset
       100 |     TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       100 |       F32 output
       104 |   FIRSTORDERFILTER_STRUCT wash_out
       104 |     FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       112 |     FIRSTORDERFILTER_STATE_STRUCT state
       112 |       F32 s1
       116 |       F32 s2
       120 |       BOOLEAN do_first_frame
       124 |     FIRSTORDERFILTER_INPUT_STRUCT input
       124 |       F32 input
       128 |       F32 input_IC
       132 |       BOOLEAN reset
       136 |     FIRSTORDERFILTER_OUTPUT_STRUCT output
       136 |       F32 output
       144 |   ROS_FLIPFLOP_STRUCT ros_ff
       144 |     ROS_FLIPFLOP_STATE_STRUCT state
       144 |       F32 s1
       148 |     ROS_FLIPFLOP_INPUT_STRUCT input
       148 |       BOOLEAN set
       149 |       BOOLEAN reset
       150 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
       150 |       BOOLEAN output
           | [sizeof=152, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_STRUCT
         0 |   MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
         8 |   MONITOR_COMMAND_INPUT_STRUCT input
         8 |     BOOLEAN run
         9 |   MONITOR_COMMAND_OUTPUT_STRUCT output
         9 |     BOOLEAN command_fail
        16 |   MONITOR_COMMAND_STATE_STRUCT state
        16 |     PERSISTENT1SHOT_STRUCT p1shot
        16 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |       PERSISTENT1SHOT_STATE_STRUCT state
        24 |         BOOLEAN init
        28 |         U32 iteration
        32 |         BOOLEAN prev_input
        36 |       PERSISTENT1SHOT_INPUT_STRUCT input
        36 |         BOOLEAN input
        37 |         BOOLEAN reset
        38 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |         BOOLEAN output
        40 |     TENTH_ORDER_AVERAGE_STRUCT toa
        40 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        48 |       TENTH_ORDER_AVERAGE_STATE_STRUCT state
        48 |         F32 [10] regfile
        88 |         U32 regfile_index
        92 |         F32 sum
        96 |         F32 average
       100 |         U16 sample_interval
       102 |         BOOLEAN do_first_frame
       104 |       TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       104 |         F32 input
       108 |         F32 input_IC
       112 |         BOOLEAN reset
       116 |       TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       116 |         F32 output
       120 |     FIRSTORDERFILTER_STRUCT wash_out
       120 |       FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       128 |       FIRSTORDERFILTER_STATE_STRUCT state
       128 |         F32 s1
       132 |         F32 s2
       136 |         BOOLEAN do_first_frame
       140 |       FIRSTORDERFILTER_INPUT_STRUCT input
       140 |         F32 input
       144 |         F32 input_IC
       148 |         BOOLEAN reset
       152 |       FIRSTORDERFILTER_OUTPUT_STRUCT output
       152 |         F32 output
       160 |     ROS_FLIPFLOP_STRUCT ros_ff
       160 |       ROS_FLIPFLOP_STATE_STRUCT state
       160 |         F32 s1
       164 |       ROS_FLIPFLOP_INPUT_STRUCT input
       164 |         BOOLEAN set
       165 |         BOOLEAN reset
       166 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
       166 |         BOOLEAN output
           | [sizeof=168, align=8]

*** Dumping AST Record Layout
         0 | TENTH_ORDER_AVERAGE_COEFF_STRUCT
         0 |   U32 sample_interval
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | FIRSTORDERFILTER_COEFF_STRUCT
         0 |   F32 a1
         4 |   F32 b0
         8 |   F32 b1
        12 |   F32 k1
        16 |   F32 k2
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_COMMAND_COEFF_STRUCT
         0 |   PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
         0 |     U32 P
         4 |     BOOLEAN ic
         5 |     BOOLEAN rising_edge
         6 |     BOOLEAN falling_edge
         8 |   TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
         8 |     U32 sample_interval
        12 |   FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        12 |     F32 a1
        16 |     F32 b0
        20 |     F32 b1
        24 |     F32 k1
        28 |     F32 k2
        32 |   F32 wof_l_limit
        36 |   F32 wof_u_limit
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_COEFF_STRUCT
         0 |   F32 rate_l_limit
         4 |   F32 rate_u_limit
         8 |   F32 attitude_l_limit
        12 |   F32 attitude_u_limit
        16 |   MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
        16 |     PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        16 |       U32 P
        20 |       BOOLEAN ic
        21 |       BOOLEAN rising_edge
        22 |       BOOLEAN falling_edge
        24 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        24 |       U32 sample_interval
        28 |     FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        28 |       F32 a1
        32 |       F32 b0
        36 |       F32 b1
        40 |       F32 k1
        44 |       F32 k2
        48 |     F32 wof_l_limit
        52 |     F32 wof_u_limit
        56 |   MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
        56 |     PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        56 |       U32 P
        60 |       BOOLEAN ic
        61 |       BOOLEAN rising_edge
        62 |       BOOLEAN falling_edge
        64 |     TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        64 |       U32 sample_interval
        68 |     FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        68 |       F32 a1
        72 |       F32 b0
        76 |       F32 b1
        80 |       F32 k1
        84 |       F32 k2
        88 |     F32 wof_l_limit
        92 |     F32 wof_u_limit
           | [sizeof=96, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_INPUT_STRUCT
         0 |   F32 rate
         4 |   F32 attitude
         8 |   BOOLEAN uar_mode
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | MONITOR_OUTPUT_STRUCT
         0 |   BOOLEAN rate_fail
         1 |   BOOLEAN attitude_fail
         2 |   BOOLEAN adp_command_fail
         3 |   BOOLEAN actuator_position_fail
           | [sizeof=4, align=1]

*** Dumping AST Record Layout
         0 | MONITOR_STATE_STRUCT
         0 |   MONITOR_COMMAND_STRUCT adp_cmd
         0 |     MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
         8 |     MONITOR_COMMAND_INPUT_STRUCT input
         8 |       BOOLEAN run
         9 |     MONITOR_COMMAND_OUTPUT_STRUCT output
         9 |       BOOLEAN command_fail
        16 |     MONITOR_COMMAND_STATE_STRUCT state
        16 |       PERSISTENT1SHOT_STRUCT p1shot
        16 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        24 |         PERSISTENT1SHOT_STATE_STRUCT state
        24 |           BOOLEAN init
        28 |           U32 iteration
        32 |           BOOLEAN prev_input
        36 |         PERSISTENT1SHOT_INPUT_STRUCT input
        36 |           BOOLEAN input
        37 |           BOOLEAN reset
        38 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
        38 |           BOOLEAN output
        40 |       TENTH_ORDER_AVERAGE_STRUCT toa
        40 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        48 |         TENTH_ORDER_AVERAGE_STATE_STRUCT state
        48 |           F32 [10] regfile
        88 |           U32 regfile_index
        92 |           F32 sum
        96 |           F32 average
       100 |           U16 sample_interval
       102 |           BOOLEAN do_first_frame
       104 |         TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       104 |           F32 input
       108 |           F32 input_IC
       112 |           BOOLEAN reset
       116 |         TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       116 |           F32 output
       120 |       FIRSTORDERFILTER_STRUCT wash_out
       120 |         FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       128 |         FIRSTORDERFILTER_STATE_STRUCT state
       128 |           F32 s1
       132 |           F32 s2
       136 |           BOOLEAN do_first_frame
       140 |         FIRSTORDERFILTER_INPUT_STRUCT input
       140 |           F32 input
       144 |           F32 input_IC
       148 |           BOOLEAN reset
       152 |         FIRSTORDERFILTER_OUTPUT_STRUCT output
       152 |           F32 output
       160 |       ROS_FLIPFLOP_STRUCT ros_ff
       160 |         ROS_FLIPFLOP_STATE_STRUCT state
       160 |           F32 s1
       164 |         ROS_FLIPFLOP_INPUT_STRUCT input
       164 |           BOOLEAN set
       165 |           BOOLEAN reset
       166 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       166 |           BOOLEAN output
       168 |   MONITOR_COMMAND_STRUCT act_pos
       168 |     MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
       176 |     MONITOR_COMMAND_INPUT_STRUCT input
       176 |       BOOLEAN run
       177 |     MONITOR_COMMAND_OUTPUT_STRUCT output
       177 |       BOOLEAN command_fail
       184 |     MONITOR_COMMAND_STATE_STRUCT state
       184 |       PERSISTENT1SHOT_STRUCT p1shot
       184 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       192 |         PERSISTENT1SHOT_STATE_STRUCT state
       192 |           BOOLEAN init
       196 |           U32 iteration
       200 |           BOOLEAN prev_input
       204 |         PERSISTENT1SHOT_INPUT_STRUCT input
       204 |           BOOLEAN input
       205 |           BOOLEAN reset
       206 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
       206 |           BOOLEAN output
       208 |       TENTH_ORDER_AVERAGE_STRUCT toa
       208 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
       216 |         TENTH_ORDER_AVERAGE_STATE_STRUCT state
       216 |           F32 [10] regfile
       256 |           U32 regfile_index
       260 |           F32 sum
       264 |           F32 average
       268 |           U16 sample_interval
       270 |           BOOLEAN do_first_frame
       272 |         TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       272 |           F32 input
       276 |           F32 input_IC
       280 |           BOOLEAN reset
       284 |         TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       284 |           F32 output
       288 |       FIRSTORDERFILTER_STRUCT wash_out
       288 |         FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       296 |         FIRSTORDERFILTER_STATE_STRUCT state
       296 |           F32 s1
       300 |           F32 s2
       304 |           BOOLEAN do_first_frame
       308 |         FIRSTORDERFILTER_INPUT_STRUCT input
       308 |           F32 input
       312 |           F32 input_IC
       316 |           BOOLEAN reset
       320 |         FIRSTORDERFILTER_OUTPUT_STRUCT output
       320 |           F32 output
       328 |       ROS_FLIPFLOP_STRUCT ros_ff
       328 |         ROS_FLIPFLOP_STATE_STRUCT state
       328 |           F32 s1
       332 |         ROS_FLIPFLOP_INPUT_STRUCT input
       332 |           BOOLEAN set
       333 |           BOOLEAN reset
       334 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
       334 |           BOOLEAN output
           | [sizeof=336, align=8]

*** Dumping AST Record Layout
         0 | MONITOR_STRUCT
         0 |   MONITOR_COEFF_STRUCT * coeff_ptr
         8 |   MONITOR_INPUT_STRUCT input
         8 |     F32 rate
        12 |     F32 attitude
        16 |     BOOLEAN uar_mode
        20 |   MONITOR_OUTPUT_STRUCT output
        20 |     BOOLEAN rate_fail
        21 |     BOOLEAN attitude_fail
        22 |     BOOLEAN adp_command_fail
        23 |     BOOLEAN actuator_position_fail
        24 |   MONITOR_STATE_STRUCT state
        24 |     MONITOR_COMMAND_STRUCT adp_cmd
        24 |       MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
        32 |       MONITOR_COMMAND_INPUT_STRUCT input
        32 |         BOOLEAN run
        33 |       MONITOR_COMMAND_OUTPUT_STRUCT output
        33 |         BOOLEAN command_fail
        40 |       MONITOR_COMMAND_STATE_STRUCT state
        40 |         PERSISTENT1SHOT_STRUCT p1shot
        40 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        48 |           PERSISTENT1SHOT_STATE_STRUCT state
        48 |             BOOLEAN init
        52 |             U32 iteration
        56 |             BOOLEAN prev_input
        60 |           PERSISTENT1SHOT_INPUT_STRUCT input
        60 |             BOOLEAN input
        61 |             BOOLEAN reset
        62 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
        62 |             BOOLEAN output
        64 |         TENTH_ORDER_AVERAGE_STRUCT toa
        64 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
        72 |           TENTH_ORDER_AVERAGE_STATE_STRUCT state
        72 |             F32 [10] regfile
       112 |             U32 regfile_index
       116 |             F32 sum
       120 |             F32 average
       124 |             U16 sample_interval
       126 |             BOOLEAN do_first_frame
       128 |           TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       128 |             F32 input
       132 |             F32 input_IC
       136 |             BOOLEAN reset
       140 |           TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       140 |             F32 output
       144 |         FIRSTORDERFILTER_STRUCT wash_out
       144 |           FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       152 |           FIRSTORDERFILTER_STATE_STRUCT state
       152 |             F32 s1
       156 |             F32 s2
       160 |             BOOLEAN do_first_frame
       164 |           FIRSTORDERFILTER_INPUT_STRUCT input
       164 |             F32 input
       168 |             F32 input_IC
       172 |             BOOLEAN reset
       176 |           FIRSTORDERFILTER_OUTPUT_STRUCT output
       176 |             F32 output
       184 |         ROS_FLIPFLOP_STRUCT ros_ff
       184 |           ROS_FLIPFLOP_STATE_STRUCT state
       184 |             F32 s1
       188 |           ROS_FLIPFLOP_INPUT_STRUCT input
       188 |             BOOLEAN set
       189 |             BOOLEAN reset
       190 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       190 |             BOOLEAN output
       192 |     MONITOR_COMMAND_STRUCT act_pos
       192 |       MONITOR_COMMAND_COEFF_STRUCT * coeff_ptr
       200 |       MONITOR_COMMAND_INPUT_STRUCT input
       200 |         BOOLEAN run
       201 |       MONITOR_COMMAND_OUTPUT_STRUCT output
       201 |         BOOLEAN command_fail
       208 |       MONITOR_COMMAND_STATE_STRUCT state
       208 |         PERSISTENT1SHOT_STRUCT p1shot
       208 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       216 |           PERSISTENT1SHOT_STATE_STRUCT state
       216 |             BOOLEAN init
       220 |             U32 iteration
       224 |             BOOLEAN prev_input
       228 |           PERSISTENT1SHOT_INPUT_STRUCT input
       228 |             BOOLEAN input
       229 |             BOOLEAN reset
       230 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
       230 |             BOOLEAN output
       232 |         TENTH_ORDER_AVERAGE_STRUCT toa
       232 |           TENTH_ORDER_AVERAGE_COEFF_STRUCT * coeff_ptr
       240 |           TENTH_ORDER_AVERAGE_STATE_STRUCT state
       240 |             F32 [10] regfile
       280 |             U32 regfile_index
       284 |             F32 sum
       288 |             F32 average
       292 |             U16 sample_interval
       294 |             BOOLEAN do_first_frame
       296 |           TENTH_ORDER_AVERAGE_INPUT_STRUCT input
       296 |             F32 input
       300 |             F32 input_IC
       304 |             BOOLEAN reset
       308 |           TENTH_ORDER_AVERAGE_OUTPUT_STRUCT output
       308 |             F32 output
       312 |         FIRSTORDERFILTER_STRUCT wash_out
       312 |           FIRSTORDERFILTER_COEFF_STRUCT * coeff_ptr
       320 |           FIRSTORDERFILTER_STATE_STRUCT state
       320 |             F32 s1
       324 |             F32 s2
       328 |             BOOLEAN do_first_frame
       332 |           FIRSTORDERFILTER_INPUT_STRUCT input
       332 |             F32 input
       336 |             F32 input_IC
       340 |             BOOLEAN reset
       344 |           FIRSTORDERFILTER_OUTPUT_STRUCT output
       344 |             F32 output
       352 |         ROS_FLIPFLOP_STRUCT ros_ff
       352 |           ROS_FLIPFLOP_STATE_STRUCT state
       352 |             F32 s1
       356 |           ROS_FLIPFLOP_INPUT_STRUCT input
       356 |             BOOLEAN set
       357 |             BOOLEAN reset
       358 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
       358 |             BOOLEAN output
           | [sizeof=360, align=8]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_COEFF_STRUCT
         0 |   F32 phi_upper_limit
         4 |   F32 phi_lower_limit
         8 |   F32 theta_upper_limit
        12 |   F32 theta_lower_limit
        16 |   F32 p_filt_upper_limit
        20 |   F32 p_filt_lower_limit
        24 |   F32 q_filt_upper_limit
        28 |   F32 q_filt_lower_limit
        32 |   PERSISTENT1SHOT_COEFF_STRUCT run_p1shot
        32 |     U32 P
        36 |     BOOLEAN ic
        37 |     BOOLEAN rising_edge
        38 |     BOOLEAN falling_edge
        40 |   PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
        40 |     U32 P
        44 |     BOOLEAN ic
        45 |     BOOLEAN rising_edge
        46 |     BOOLEAN falling_edge
           | [sizeof=48, align=4]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_COEFF_STRUCT
         0 |   CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
         0 |     F32 pitch_bias
         4 |     RATE_LIMITER_RIC_COEFF_STRUCT roll_rate_limiter
         4 |       F32 rate_limiter_lower_limit
         8 |       F32 rate_limiter_upper_limit
        12 |     RATE_LIMITER_RIC_COEFF_STRUCT pitch_rate_limiter
        12 |       F32 rate_limiter_lower_limit
        16 |       F32 rate_limiter_upper_limit
        20 |     ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |       F32 c_reintichs_IC
        24 |       F32 c_gamma
        28 |       F32 null_attitude
        32 |       F32 upper_sat_limit
        36 |       F32 lower_sat_limit
        40 |       F32 k_rate_to_ang_accel_cross
        44 |       F32 k_rate_to_ang_accel_uar
        48 |       F32 k_rate_to_ang_accel_normal
        52 |       F32 k_attitude_to_ang_accel_uar
        56 |       F32 k_attitude_to_ang_accel_normal
        60 |       F32 k_attitude_to_ang_accel_integral_normal
        64 |       F32 k_compensation
        68 |       F32 k_ang_accel_to_cyclic
        72 |       F32 k_integrator_curve_magnitude
        76 |       SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        76 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
        76 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        76 |             U32 P
        80 |             BOOLEAN ic
        81 |             BOOLEAN rising_edge
        82 |             BOOLEAN falling_edge
        84 |         REINTICH_COEFF_STRUCT first_integrator_coeff
        84 |           F32 K_Ts
        88 |         REINTICH_COEFF_STRUCT second_integrator_coeff
        88 |           F32 K_Ts
        92 |       SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        92 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
        92 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        92 |             U32 P
        96 |             BOOLEAN ic
        97 |             BOOLEAN rising_edge
        98 |             BOOLEAN falling_edge
       100 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       100 |           F32 K_Ts
       104 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       104 |           F32 K_Ts
       108 |       REINTICH_COEFF_STRUCT reintich
       108 |         F32 K_Ts
       112 |       REINTICHS_COEFF_STRUCT reintichs
       112 |         F32 K_Ts
       116 |         F32 UL
       120 |         F32 LL
       124 |         F32 rail_bounce_divisor
       128 |         REINTICH_COEFF_STRUCT integrator_coeff
       128 |           F32 K_Ts
       132 |         SATURATIONVF_COEFF_STRUCT sat_coeff
       132 |           F32 epsilon
       136 |           F32 upper_sat_limit
       140 |           F32 lower_sat_limit
       144 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       144 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       144 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       144 |             U32 P
       148 |             BOOLEAN ic
       149 |             BOOLEAN rising_edge
       150 |             BOOLEAN falling_edge
       152 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       152 |           F32 K_Ts
       156 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       156 |           F32 K_Ts
       160 |     ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       160 |       F32 c_reintichs_IC
       164 |       F32 c_gamma
       168 |       F32 null_attitude
       172 |       F32 upper_sat_limit
       176 |       F32 lower_sat_limit
       180 |       F32 k_rate_to_ang_accel_cross
       184 |       F32 k_rate_to_ang_accel_uar
       188 |       F32 k_rate_to_ang_accel_normal
       192 |       F32 k_attitude_to_ang_accel_uar
       196 |       F32 k_attitude_to_ang_accel_normal
       200 |       F32 k_attitude_to_ang_accel_integral_normal
       204 |       F32 k_compensation
       208 |       F32 k_ang_accel_to_cyclic
       212 |       F32 k_integrator_curve_magnitude
       216 |       SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
       216 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       216 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       216 |             U32 P
       220 |             BOOLEAN ic
       221 |             BOOLEAN rising_edge
       222 |             BOOLEAN falling_edge
       224 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       224 |           F32 K_Ts
       228 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       228 |           F32 K_Ts
       232 |       SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
       232 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       232 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       232 |             U32 P
       236 |             BOOLEAN ic
       237 |             BOOLEAN rising_edge
       238 |             BOOLEAN falling_edge
       240 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       240 |           F32 K_Ts
       244 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       244 |           F32 K_Ts
       248 |       REINTICH_COEFF_STRUCT reintich
       248 |         F32 K_Ts
       252 |       REINTICHS_COEFF_STRUCT reintichs
       252 |         F32 K_Ts
       256 |         F32 UL
       260 |         F32 LL
       264 |         F32 rail_bounce_divisor
       268 |         REINTICH_COEFF_STRUCT integrator_coeff
       268 |           F32 K_Ts
       272 |         SATURATIONVF_COEFF_STRUCT sat_coeff
       272 |           F32 epsilon
       276 |           F32 upper_sat_limit
       280 |           F32 lower_sat_limit
       284 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       284 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       284 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       284 |             U32 P
       288 |             BOOLEAN ic
       289 |             BOOLEAN rising_edge
       290 |             BOOLEAN falling_edge
       292 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       292 |           F32 K_Ts
       296 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       296 |           F32 K_Ts
       300 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_roll_cmd_switch
       300 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       300 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       300 |           U32 P
       304 |           BOOLEAN ic
       305 |           BOOLEAN rising_edge
       306 |           BOOLEAN falling_edge
       308 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       308 |         F32 K_Ts
       312 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       312 |         F32 K_Ts
       316 |     SWITCH_SECOND_ORDER_COEFF_STRUCT adp_pitch_cmd_switch
       316 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       316 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       316 |           U32 P
       320 |           BOOLEAN ic
       321 |           BOOLEAN rising_edge
       322 |           BOOLEAN falling_edge
       324 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       324 |         F32 K_Ts
       328 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       328 |         F32 K_Ts
       332 |     TEST_PORT_COEFF_STRUCT roll_testport
       332 |       F32 gain
       336 |       F32 bias
       340 |     TEST_PORT_COEFF_STRUCT pitch_testport
       340 |       F32 gain
       344 |       F32 bias
       348 |     F32 K_heading_rate_to_ang_accel_uar
       352 |     SWITCH_SECOND_ORDER_COEFF_STRUCT heading_rate_switch
       352 |       SWITCH_COMMON_COEFF_STRUCT common_coeff
       352 |         PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       352 |           U32 P
       356 |           BOOLEAN ic
       357 |           BOOLEAN rising_edge
       358 |           BOOLEAN falling_edge
       360 |       REINTICH_COEFF_STRUCT first_integrator_coeff
       360 |         F32 K_Ts
       364 |       REINTICH_COEFF_STRUCT second_integrator_coeff
       364 |         F32 K_Ts
       368 |     LINTERP_STRUCT pitch_bias_linterp
       368 |       U8 n_regions
       372 |       LINTERP_REGION_STRUCT [10] regions
       492 |   UARMODELOGIC_COEFF_STRUCT uar_mode_logic
       492 |     F32 phi_upper_limit
       496 |     F32 phi_lower_limit
       500 |     F32 theta_upper_limit
       504 |     F32 theta_lower_limit
       508 |     F32 p_filt_upper_limit
       512 |     F32 p_filt_lower_limit
       516 |     F32 q_filt_upper_limit
       520 |     F32 q_filt_lower_limit
       524 |     PERSISTENT1SHOT_COEFF_STRUCT run_p1shot
       524 |       U32 P
       528 |       BOOLEAN ic
       529 |       BOOLEAN rising_edge
       530 |       BOOLEAN falling_edge
       532 |     PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
       532 |       U32 P
       536 |       BOOLEAN ic
       537 |       BOOLEAN rising_edge
       538 |       BOOLEAN falling_edge
           | [sizeof=540, align=4]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_INPUT_STRUCT
         0 |   BOOLEAN run
           | [sizeof=1, align=1]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_OUTPUT_STRUCT
         0 |   CYCLIC_STRUCT feedback
         0 |     F32 roll
         4 |     F32 pitch
         8 |   BOOLEAN uar_mode
         9 |   BOOLEAN run_adp
        10 |   BOOLEAN phi_valid
        11 |   BOOLEAN theta_valid
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_INPUT_STRUCT
         0 |   F32 phi
         4 |   F32 theta
         8 |   F32 p_filt
        12 |   F32 q_filt
        16 |   BOOLEAN run
        17 |   BOOLEAN adp_fail
        18 |   BOOLEAN disable_ADP
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_OUTPUT_STRUCT
         0 |   BOOLEAN phi_range_valid
         1 |   BOOLEAN theta_range_valid
         2 |   BOOLEAN uar_mode
           | [sizeof=3, align=1]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_STATE_STRUCT
         0 |   ROS_FLIPFLOP_STRUCT uar_mode_ff
         0 |     ROS_FLIPFLOP_STATE_STRUCT state
         0 |       F32 s1
         4 |     ROS_FLIPFLOP_INPUT_STRUCT input
         4 |       BOOLEAN set
         5 |       BOOLEAN reset
         6 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
         6 |       BOOLEAN output
         8 |   ROS_FLIPFLOP_STRUCT phi_range_ff
         8 |     ROS_FLIPFLOP_STATE_STRUCT state
         8 |       F32 s1
        12 |     ROS_FLIPFLOP_INPUT_STRUCT input
        12 |       BOOLEAN set
        13 |       BOOLEAN reset
        14 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
        14 |       BOOLEAN output
        16 |   ROS_FLIPFLOP_STRUCT theta_range_ff
        16 |     ROS_FLIPFLOP_STATE_STRUCT state
        16 |       F32 s1
        20 |     ROS_FLIPFLOP_INPUT_STRUCT input
        20 |       BOOLEAN set
        21 |       BOOLEAN reset
        22 |     ROS_FLIPFLOP_OUTPUT_STRUCT output
        22 |       BOOLEAN output
        24 |   PERSISTENT1SHOT_STRUCT run_p1shot
        24 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        32 |     PERSISTENT1SHOT_STATE_STRUCT state
        32 |       BOOLEAN init
        36 |       U32 iteration
        40 |       BOOLEAN prev_input
        44 |     PERSISTENT1SHOT_INPUT_STRUCT input
        44 |       BOOLEAN input
        45 |       BOOLEAN reset
        46 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        46 |       BOOLEAN output
        48 |   PERSISTENT1SHOT_STRUCT uar_hold_p1shot
        48 |     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        56 |     PERSISTENT1SHOT_STATE_STRUCT state
        56 |       BOOLEAN init
        60 |       U32 iteration
        64 |       BOOLEAN prev_input
        68 |     PERSISTENT1SHOT_INPUT_STRUCT input
        68 |       BOOLEAN input
        69 |       BOOLEAN reset
        70 |     PERSISTENT1SHOT_OUTPUT_STRUCT output
        70 |       BOOLEAN output
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | UARMODELOGIC_STRUCT
         0 |   UARMODELOGIC_COEFF_STRUCT * coeff_ptr
         8 |   UARMODELOGIC_INPUT_STRUCT input
         8 |     F32 phi
        12 |     F32 theta
        16 |     F32 p_filt
        20 |     F32 q_filt
        24 |     BOOLEAN run
        25 |     BOOLEAN adp_fail
        26 |     BOOLEAN disable_ADP
        28 |   UARMODELOGIC_OUTPUT_STRUCT output
        28 |     BOOLEAN phi_range_valid
        29 |     BOOLEAN theta_range_valid
        30 |     BOOLEAN uar_mode
        32 |   UARMODELOGIC_STATE_STRUCT state
        32 |     ROS_FLIPFLOP_STRUCT uar_mode_ff
        32 |       ROS_FLIPFLOP_STATE_STRUCT state
        32 |         F32 s1
        36 |       ROS_FLIPFLOP_INPUT_STRUCT input
        36 |         BOOLEAN set
        37 |         BOOLEAN reset
        38 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        38 |         BOOLEAN output
        40 |     ROS_FLIPFLOP_STRUCT phi_range_ff
        40 |       ROS_FLIPFLOP_STATE_STRUCT state
        40 |         F32 s1
        44 |       ROS_FLIPFLOP_INPUT_STRUCT input
        44 |         BOOLEAN set
        45 |         BOOLEAN reset
        46 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        46 |         BOOLEAN output
        48 |     ROS_FLIPFLOP_STRUCT theta_range_ff
        48 |       ROS_FLIPFLOP_STATE_STRUCT state
        48 |         F32 s1
        52 |       ROS_FLIPFLOP_INPUT_STRUCT input
        52 |         BOOLEAN set
        53 |         BOOLEAN reset
        54 |       ROS_FLIPFLOP_OUTPUT_STRUCT output
        54 |         BOOLEAN output
        56 |     PERSISTENT1SHOT_STRUCT run_p1shot
        56 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        64 |       PERSISTENT1SHOT_STATE_STRUCT state
        64 |         BOOLEAN init
        68 |         U32 iteration
        72 |         BOOLEAN prev_input
        76 |       PERSISTENT1SHOT_INPUT_STRUCT input
        76 |         BOOLEAN input
        77 |         BOOLEAN reset
        78 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
        78 |         BOOLEAN output
        80 |     PERSISTENT1SHOT_STRUCT uar_hold_p1shot
        80 |       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        88 |       PERSISTENT1SHOT_STATE_STRUCT state
        88 |         BOOLEAN init
        92 |         U32 iteration
        96 |         BOOLEAN prev_input
       100 |       PERSISTENT1SHOT_INPUT_STRUCT input
       100 |         BOOLEAN input
       101 |         BOOLEAN reset
       102 |       PERSISTENT1SHOT_OUTPUT_STRUCT output
       102 |         BOOLEAN output
           | [sizeof=104, align=8]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_STATE_STRUCT
         0 |   CYCLIC_FEEDBACK_STRUCT cyclic_feedback
         0 |     CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
         8 |     CYCLIC_FEEDBACK_STATE_STRUCT state
         8 |       ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
         8 |         ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        16 |         ATTITUDE_CONTROLLER_INPUT_STRUCT input
        16 |           F32 rate_cross_axis
        20 |           F32 rate_near_axis
        24 |           F32 attitude_near_axis
        28 |           F32 adp_roll_cmd
        32 |           F32 adp_pitch_cmd
        36 |           BOOLEAN run_mode
        37 |           BOOLEAN uar_mode
        40 |         ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        40 |           F32 output
        48 |         ATTITUDE_CONTROLLER_STATE_STRUCT state
        48 |           SWITCH_SECOND_ORDER_STRUCT rate_switch
        48 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        56 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
        56 |               SWITCH_COMMON_STRUCT common
        56 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        64 |                 SWITCH_COMMON_STATE_STRUCT state
        64 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
        64 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        72 |                     PERSISTENT1SHOT_STATE_STRUCT state
        72 |                       BOOLEAN init
        76 |                       U32 iteration
        80 |                       BOOLEAN prev_input
        84 |                     PERSISTENT1SHOT_INPUT_STRUCT input
        84 |                       BOOLEAN input
        85 |                       BOOLEAN reset
        86 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
        86 |                       BOOLEAN output
        88 |                   F32 output_previous
        92 |                   F32 transition_deviation_latched
        96 |                   F32 selected_input
       104 |               REINTICH_STRUCT first_integrator
       104 |                 REINTICH_COEFF_STRUCT * coeff
       112 |                 REINTICH_STATE_STRUCT state
       112 |                   F32 delay
       116 |                   BOOLEAN reset_on_init
       120 |                 REINTICH_INPUT_STRUCT input
       120 |                   F32 IC
       124 |                   F32 input
       128 |                   BOOLEAN run
       129 |                   BOOLEAN hold
       132 |                 REINTICH_OUTPUT_STRUCT output
       132 |                   F32 output
       136 |               REINTICH_STRUCT second_integrator
       136 |                 REINTICH_COEFF_STRUCT * coeff
       144 |                 REINTICH_STATE_STRUCT state
       144 |                   F32 delay
       148 |                   BOOLEAN reset_on_init
       152 |                 REINTICH_INPUT_STRUCT input
       152 |                   F32 IC
       156 |                   F32 input
       160 |                   BOOLEAN run
       161 |                   BOOLEAN hold
       164 |                 REINTICH_OUTPUT_STRUCT output
       164 |                   F32 output
       168 |               F32 first_feedback_delay
       172 |               F32 second_feedback_delay
       176 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       176 |               F32 input_one
       180 |               F32 input_two
       184 |               BOOLEAN switch_flag
       188 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       188 |               F32 output
       192 |           SWITCH_SECOND_ORDER_STRUCT attitude_switch
       192 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       200 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
       200 |               SWITCH_COMMON_STRUCT common
       200 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       208 |                 SWITCH_COMMON_STATE_STRUCT state
       208 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
       208 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       216 |                     PERSISTENT1SHOT_STATE_STRUCT state
       216 |                       BOOLEAN init
       220 |                       U32 iteration
       224 |                       BOOLEAN prev_input
       228 |                     PERSISTENT1SHOT_INPUT_STRUCT input
       228 |                       BOOLEAN input
       229 |                       BOOLEAN reset
       230 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
       230 |                       BOOLEAN output
       232 |                   F32 output_previous
       236 |                   F32 transition_deviation_latched
       240 |                   F32 selected_input
       248 |               REINTICH_STRUCT first_integrator
       248 |                 REINTICH_COEFF_STRUCT * coeff
       256 |                 REINTICH_STATE_STRUCT state
       256 |                   F32 delay
       260 |                   BOOLEAN reset_on_init
       264 |                 REINTICH_INPUT_STRUCT input
       264 |                   F32 IC
       268 |                   F32 input
       272 |                   BOOLEAN run
       273 |                   BOOLEAN hold
       276 |                 REINTICH_OUTPUT_STRUCT output
       276 |                   F32 output
       280 |               REINTICH_STRUCT second_integrator
       280 |                 REINTICH_COEFF_STRUCT * coeff
       288 |                 REINTICH_STATE_STRUCT state
       288 |                   F32 delay
       292 |                   BOOLEAN reset_on_init
       296 |                 REINTICH_INPUT_STRUCT input
       296 |                   F32 IC
       300 |                   F32 input
       304 |                   BOOLEAN run
       305 |                   BOOLEAN hold
       308 |                 REINTICH_OUTPUT_STRUCT output
       308 |                   F32 output
       312 |               F32 first_feedback_delay
       316 |               F32 second_feedback_delay
       320 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       320 |               F32 input_one
       324 |               F32 input_two
       328 |               BOOLEAN switch_flag
       332 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       332 |               F32 output
       336 |           REINTICH_STRUCT reintich
       336 |             REINTICH_COEFF_STRUCT * coeff
       344 |             REINTICH_STATE_STRUCT state
       344 |               F32 delay
       348 |               BOOLEAN reset_on_init
       352 |             REINTICH_INPUT_STRUCT input
       352 |               F32 IC
       356 |               F32 input
       360 |               BOOLEAN run
       361 |               BOOLEAN hold
       364 |             REINTICH_OUTPUT_STRUCT output
       364 |               F32 output
       368 |           REINTICHS_STRUCT reintichs
       368 |             REINTICHS_COEFF_STRUCT * coeff
       376 |             REINTICHS_STATE_STRUCT state
       376 |               F32 IC_delay
       380 |               F32 rail_bounce
       384 |               BOOLEAN prev_sat_UL
       385 |               BOOLEAN prev_sat_LL
       386 |               BOOLEAN prev_sat_inv
       387 |               BOOLEAN prev_reset_int
       388 |               BOOLEAN prev_reset_sat
       392 |               REINTICH_STRUCT integrator
       392 |                 REINTICH_COEFF_STRUCT * coeff
       400 |                 REINTICH_STATE_STRUCT state
       400 |                   F32 delay
       404 |                   BOOLEAN reset_on_init
       408 |                 REINTICH_INPUT_STRUCT input
       408 |                   F32 IC
       412 |                   F32 input
       416 |                   BOOLEAN run
       417 |                   BOOLEAN hold
       420 |                 REINTICH_OUTPUT_STRUCT output
       420 |                   F32 output
       424 |               SATURATIONVF_STRUCT sat
       424 |                 SATURATIONVF_COEFF_STRUCT * coeff
       432 |                 SATURATIONVF_STATE_STRUCT state
       432 |                   F32 delay
       436 |                   BOOLEAN reset_on_init
       440 |                 SATURATIONVF_INPUT_STRUCT input
       440 |                   F32 IC
       444 |                   F32 input
       448 |                   BOOLEAN reset
       452 |                 SATURATIONVF_OUTPUT_STRUCT output
       452 |                   F32 output
       456 |                   BOOLEAN inv
       457 |                   BOOLEAN satLo
       458 |                   BOOLEAN satHi
       464 |             REINTICHS_INPUT_STRUCT input
       464 |               F32 IC
       468 |               F32 input
       472 |               BOOLEAN run
       473 |               BOOLEAN hold
       476 |             REINTICHS_OUTPUT_STRUCT output
       476 |               F32 output
       480 |               BOOLEAN sat_UL
       481 |               BOOLEAN sat_LL
       482 |               BOOLEAN inv
       488 |           BOOLEAN prev_run
       496 |       ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       496 |         ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       504 |         ATTITUDE_CONTROLLER_INPUT_STRUCT input
       504 |           F32 rate_cross_axis
       508 |           F32 rate_near_axis
       512 |           F32 attitude_near_axis
       516 |           F32 adp_roll_cmd
       520 |           F32 adp_pitch_cmd
       524 |           BOOLEAN run_mode
       525 |           BOOLEAN uar_mode
       528 |         ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       528 |           F32 output
       536 |         ATTITUDE_CONTROLLER_STATE_STRUCT state
       536 |           SWITCH_SECOND_ORDER_STRUCT rate_switch
       536 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       544 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
       544 |               SWITCH_COMMON_STRUCT common
       544 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       552 |                 SWITCH_COMMON_STATE_STRUCT state
       552 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
       552 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       560 |                     PERSISTENT1SHOT_STATE_STRUCT state
       560 |                       BOOLEAN init
       564 |                       U32 iteration
       568 |                       BOOLEAN prev_input
       572 |                     PERSISTENT1SHOT_INPUT_STRUCT input
       572 |                       BOOLEAN input
       573 |                       BOOLEAN reset
       574 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
       574 |                       BOOLEAN output
       576 |                   F32 output_previous
       580 |                   F32 transition_deviation_latched
       584 |                   F32 selected_input
       592 |               REINTICH_STRUCT first_integrator
       592 |                 REINTICH_COEFF_STRUCT * coeff
       600 |                 REINTICH_STATE_STRUCT state
       600 |                   F32 delay
       604 |                   BOOLEAN reset_on_init
       608 |                 REINTICH_INPUT_STRUCT input
       608 |                   F32 IC
       612 |                   F32 input
       616 |                   BOOLEAN run
       617 |                   BOOLEAN hold
       620 |                 REINTICH_OUTPUT_STRUCT output
       620 |                   F32 output
       624 |               REINTICH_STRUCT second_integrator
       624 |                 REINTICH_COEFF_STRUCT * coeff
       632 |                 REINTICH_STATE_STRUCT state
       632 |                   F32 delay
       636 |                   BOOLEAN reset_on_init
       640 |                 REINTICH_INPUT_STRUCT input
       640 |                   F32 IC
       644 |                   F32 input
       648 |                   BOOLEAN run
       649 |                   BOOLEAN hold
       652 |                 REINTICH_OUTPUT_STRUCT output
       652 |                   F32 output
       656 |               F32 first_feedback_delay
       660 |               F32 second_feedback_delay
       664 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       664 |               F32 input_one
       668 |               F32 input_two
       672 |               BOOLEAN switch_flag
       676 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       676 |               F32 output
       680 |           SWITCH_SECOND_ORDER_STRUCT attitude_switch
       680 |             SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       688 |             SWITCH_SECOND_ORDER_STATE_STRUCT state
       688 |               SWITCH_COMMON_STRUCT common
       688 |                 SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       696 |                 SWITCH_COMMON_STATE_STRUCT state
       696 |                   PERSISTENT1SHOT_STRUCT transition_one_shot
       696 |                     PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       704 |                     PERSISTENT1SHOT_STATE_STRUCT state
       704 |                       BOOLEAN init
       708 |                       U32 iteration
       712 |                       BOOLEAN prev_input
       716 |                     PERSISTENT1SHOT_INPUT_STRUCT input
       716 |                       BOOLEAN input
       717 |                       BOOLEAN reset
       718 |                     PERSISTENT1SHOT_OUTPUT_STRUCT output
       718 |                       BOOLEAN output
       720 |                   F32 output_previous
       724 |                   F32 transition_deviation_latched
       728 |                   F32 selected_input
       736 |               REINTICH_STRUCT first_integrator
       736 |                 REINTICH_COEFF_STRUCT * coeff
       744 |                 REINTICH_STATE_STRUCT state
       744 |                   F32 delay
       748 |                   BOOLEAN reset_on_init
       752 |                 REINTICH_INPUT_STRUCT input
       752 |                   F32 IC
       756 |                   F32 input
       760 |                   BOOLEAN run
       761 |                   BOOLEAN hold
       764 |                 REINTICH_OUTPUT_STRUCT output
       764 |                   F32 output
       768 |               REINTICH_STRUCT second_integrator
       768 |                 REINTICH_COEFF_STRUCT * coeff
       776 |                 REINTICH_STATE_STRUCT state
       776 |                   F32 delay
       780 |                   BOOLEAN reset_on_init
       784 |                 REINTICH_INPUT_STRUCT input
       784 |                   F32 IC
       788 |                   F32 input
       792 |                   BOOLEAN run
       793 |                   BOOLEAN hold
       796 |                 REINTICH_OUTPUT_STRUCT output
       796 |                   F32 output
       800 |               F32 first_feedback_delay
       804 |               F32 second_feedback_delay
       808 |             SWITCH_SECOND_ORDER_INPUT_STRUCT input
       808 |               F32 input_one
       812 |               F32 input_two
       816 |               BOOLEAN switch_flag
       820 |             SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       820 |               F32 output
       824 |           REINTICH_STRUCT reintich
       824 |             REINTICH_COEFF_STRUCT * coeff
       832 |             REINTICH_STATE_STRUCT state
       832 |               F32 delay
       836 |               BOOLEAN reset_on_init
       840 |             REINTICH_INPUT_STRUCT input
       840 |               F32 IC
       844 |               F32 input
       848 |               BOOLEAN run
       849 |               BOOLEAN hold
       852 |             REINTICH_OUTPUT_STRUCT output
       852 |               F32 output
       856 |           REINTICHS_STRUCT reintichs
       856 |             REINTICHS_COEFF_STRUCT * coeff
       864 |             REINTICHS_STATE_STRUCT state
       864 |               F32 IC_delay
       868 |               F32 rail_bounce
       872 |               BOOLEAN prev_sat_UL
       873 |               BOOLEAN prev_sat_LL
       874 |               BOOLEAN prev_sat_inv
       875 |               BOOLEAN prev_reset_int
       876 |               BOOLEAN prev_reset_sat
       880 |               REINTICH_STRUCT integrator
       880 |                 REINTICH_COEFF_STRUCT * coeff
       888 |                 REINTICH_STATE_STRUCT state
       888 |                   F32 delay
       892 |                   BOOLEAN reset_on_init
       896 |                 REINTICH_INPUT_STRUCT input
       896 |                   F32 IC
       900 |                   F32 input
       904 |                   BOOLEAN run
       905 |                   BOOLEAN hold
       908 |                 REINTICH_OUTPUT_STRUCT output
       908 |                   F32 output
       912 |               SATURATIONVF_STRUCT sat
       912 |                 SATURATIONVF_COEFF_STRUCT * coeff
       920 |                 SATURATIONVF_STATE_STRUCT state
       920 |                   F32 delay
       924 |                   BOOLEAN reset_on_init
       928 |                 SATURATIONVF_INPUT_STRUCT input
       928 |                   F32 IC
       932 |                   F32 input
       936 |                   BOOLEAN reset
       940 |                 SATURATIONVF_OUTPUT_STRUCT output
       940 |                   F32 output
       944 |                   BOOLEAN inv
       945 |                   BOOLEAN satLo
       946 |                   BOOLEAN satHi
       952 |             REINTICHS_INPUT_STRUCT input
       952 |               F32 IC
       956 |               F32 input
       960 |               BOOLEAN run
       961 |               BOOLEAN hold
       964 |             REINTICHS_OUTPUT_STRUCT output
       964 |               F32 output
       968 |               BOOLEAN sat_UL
       969 |               BOOLEAN sat_LL
       970 |               BOOLEAN inv
       976 |           BOOLEAN prev_run
       984 |       F32 roll_rate_limiter_previous_state
       988 |       F32 pitch_rate_limiter_previous_state
       992 |       SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
       992 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1000 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
      1000 |           SWITCH_COMMON_STRUCT common
      1000 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1008 |             SWITCH_COMMON_STATE_STRUCT state
      1008 |               PERSISTENT1SHOT_STRUCT transition_one_shot
      1008 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1016 |                 PERSISTENT1SHOT_STATE_STRUCT state
      1016 |                   BOOLEAN init
      1020 |                   U32 iteration
      1024 |                   BOOLEAN prev_input
      1028 |                 PERSISTENT1SHOT_INPUT_STRUCT input
      1028 |                   BOOLEAN input
      1029 |                   BOOLEAN reset
      1030 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
      1030 |                   BOOLEAN output
      1032 |               F32 output_previous
      1036 |               F32 transition_deviation_latched
      1040 |               F32 selected_input
      1048 |           REINTICH_STRUCT first_integrator
      1048 |             REINTICH_COEFF_STRUCT * coeff
      1056 |             REINTICH_STATE_STRUCT state
      1056 |               F32 delay
      1060 |               BOOLEAN reset_on_init
      1064 |             REINTICH_INPUT_STRUCT input
      1064 |               F32 IC
      1068 |               F32 input
      1072 |               BOOLEAN run
      1073 |               BOOLEAN hold
      1076 |             REINTICH_OUTPUT_STRUCT output
      1076 |               F32 output
      1080 |           REINTICH_STRUCT second_integrator
      1080 |             REINTICH_COEFF_STRUCT * coeff
      1088 |             REINTICH_STATE_STRUCT state
      1088 |               F32 delay
      1092 |               BOOLEAN reset_on_init
      1096 |             REINTICH_INPUT_STRUCT input
      1096 |               F32 IC
      1100 |               F32 input
      1104 |               BOOLEAN run
      1105 |               BOOLEAN hold
      1108 |             REINTICH_OUTPUT_STRUCT output
      1108 |               F32 output
      1112 |           F32 first_feedback_delay
      1116 |           F32 second_feedback_delay
      1120 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1120 |           F32 input_one
      1124 |           F32 input_two
      1128 |           BOOLEAN switch_flag
      1132 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1132 |           F32 output
      1136 |       SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1136 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1144 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
      1144 |           SWITCH_COMMON_STRUCT common
      1144 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1152 |             SWITCH_COMMON_STATE_STRUCT state
      1152 |               PERSISTENT1SHOT_STRUCT transition_one_shot
      1152 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1160 |                 PERSISTENT1SHOT_STATE_STRUCT state
      1160 |                   BOOLEAN init
      1164 |                   U32 iteration
      1168 |                   BOOLEAN prev_input
      1172 |                 PERSISTENT1SHOT_INPUT_STRUCT input
      1172 |                   BOOLEAN input
      1173 |                   BOOLEAN reset
      1174 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
      1174 |                   BOOLEAN output
      1176 |               F32 output_previous
      1180 |               F32 transition_deviation_latched
      1184 |               F32 selected_input
      1192 |           REINTICH_STRUCT first_integrator
      1192 |             REINTICH_COEFF_STRUCT * coeff
      1200 |             REINTICH_STATE_STRUCT state
      1200 |               F32 delay
      1204 |               BOOLEAN reset_on_init
      1208 |             REINTICH_INPUT_STRUCT input
      1208 |               F32 IC
      1212 |               F32 input
      1216 |               BOOLEAN run
      1217 |               BOOLEAN hold
      1220 |             REINTICH_OUTPUT_STRUCT output
      1220 |               F32 output
      1224 |           REINTICH_STRUCT second_integrator
      1224 |             REINTICH_COEFF_STRUCT * coeff
      1232 |             REINTICH_STATE_STRUCT state
      1232 |               F32 delay
      1236 |               BOOLEAN reset_on_init
      1240 |             REINTICH_INPUT_STRUCT input
      1240 |               F32 IC
      1244 |               F32 input
      1248 |               BOOLEAN run
      1249 |               BOOLEAN hold
      1252 |             REINTICH_OUTPUT_STRUCT output
      1252 |               F32 output
      1256 |           F32 first_feedback_delay
      1260 |           F32 second_feedback_delay
      1264 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1264 |           F32 input_one
      1268 |           F32 input_two
      1272 |           BOOLEAN switch_flag
      1276 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1276 |           F32 output
      1280 |       TEST_PORT_STRUCT roll_testport
      1280 |         TEST_PORT_COEFF_STRUCT * coeff
      1288 |         TEST_PORT_INPUT_STRUCT input
      1288 |           F32 input
      1292 |         TEST_PORT_OUTPUT_STRUCT output
      1292 |           F32 output
      1296 |       TEST_PORT_STRUCT pitch_testport
      1296 |         TEST_PORT_COEFF_STRUCT * coeff
      1304 |         TEST_PORT_INPUT_STRUCT input
      1304 |           F32 input
      1308 |         TEST_PORT_OUTPUT_STRUCT output
      1308 |           F32 output
      1312 |       BOOLEAN first_frame
      1320 |       SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1320 |         SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1328 |         SWITCH_SECOND_ORDER_STATE_STRUCT state
      1328 |           SWITCH_COMMON_STRUCT common
      1328 |             SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1336 |             SWITCH_COMMON_STATE_STRUCT state
      1336 |               PERSISTENT1SHOT_STRUCT transition_one_shot
      1336 |                 PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1344 |                 PERSISTENT1SHOT_STATE_STRUCT state
      1344 |                   BOOLEAN init
      1348 |                   U32 iteration
      1352 |                   BOOLEAN prev_input
      1356 |                 PERSISTENT1SHOT_INPUT_STRUCT input
      1356 |                   BOOLEAN input
      1357 |                   BOOLEAN reset
      1358 |                 PERSISTENT1SHOT_OUTPUT_STRUCT output
      1358 |                   BOOLEAN output
      1360 |               F32 output_previous
      1364 |               F32 transition_deviation_latched
      1368 |               F32 selected_input
      1376 |           REINTICH_STRUCT first_integrator
      1376 |             REINTICH_COEFF_STRUCT * coeff
      1384 |             REINTICH_STATE_STRUCT state
      1384 |               F32 delay
      1388 |               BOOLEAN reset_on_init
      1392 |             REINTICH_INPUT_STRUCT input
      1392 |               F32 IC
      1396 |               F32 input
      1400 |               BOOLEAN run
      1401 |               BOOLEAN hold
      1404 |             REINTICH_OUTPUT_STRUCT output
      1404 |               F32 output
      1408 |           REINTICH_STRUCT second_integrator
      1408 |             REINTICH_COEFF_STRUCT * coeff
      1416 |             REINTICH_STATE_STRUCT state
      1416 |               F32 delay
      1420 |               BOOLEAN reset_on_init
      1424 |             REINTICH_INPUT_STRUCT input
      1424 |               F32 IC
      1428 |               F32 input
      1432 |               BOOLEAN run
      1433 |               BOOLEAN hold
      1436 |             REINTICH_OUTPUT_STRUCT output
      1436 |               F32 output
      1440 |           F32 first_feedback_delay
      1444 |           F32 second_feedback_delay
      1448 |         SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1448 |           F32 input_one
      1452 |           F32 input_two
      1456 |           BOOLEAN switch_flag
      1460 |         SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1460 |           F32 output
      1464 |       F32 switched_heading_rate
      1468 |       F32 roll_test_input
      1472 |       F32 pitch_test_input
      1480 |     CYCLIC_FEEDBACK_INPUT_STRUCT input
      1480 |       F32 adp_phi_cmd
      1484 |       F32 adp_theta_cmd
      1488 |       F32 phi
      1492 |       F32 phi_dot
      1496 |       F32 psi_dot
      1500 |       F32 theta
      1504 |       F32 theta_dot
      1508 |       F32 p
      1512 |       F32 q
      1516 |       BOOLEAN reset
      1517 |       BOOLEAN UAR_mode
      1518 |       BOOLEAN triplex_fault
      1520 |   UARMODELOGIC_STRUCT uar_mode_logic
      1520 |     UARMODELOGIC_COEFF_STRUCT * coeff_ptr
      1528 |     UARMODELOGIC_INPUT_STRUCT input
      1528 |       F32 phi
      1532 |       F32 theta
      1536 |       F32 p_filt
      1540 |       F32 q_filt
      1544 |       BOOLEAN run
      1545 |       BOOLEAN adp_fail
      1546 |       BOOLEAN disable_ADP
      1548 |     UARMODELOGIC_OUTPUT_STRUCT output
      1548 |       BOOLEAN phi_range_valid
      1549 |       BOOLEAN theta_range_valid
      1550 |       BOOLEAN uar_mode
      1552 |     UARMODELOGIC_STATE_STRUCT state
      1552 |       ROS_FLIPFLOP_STRUCT uar_mode_ff
      1552 |         ROS_FLIPFLOP_STATE_STRUCT state
      1552 |           F32 s1
      1556 |         ROS_FLIPFLOP_INPUT_STRUCT input
      1556 |           BOOLEAN set
      1557 |           BOOLEAN reset
      1558 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
      1558 |           BOOLEAN output
      1560 |       ROS_FLIPFLOP_STRUCT phi_range_ff
      1560 |         ROS_FLIPFLOP_STATE_STRUCT state
      1560 |           F32 s1
      1564 |         ROS_FLIPFLOP_INPUT_STRUCT input
      1564 |           BOOLEAN set
      1565 |           BOOLEAN reset
      1566 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
      1566 |           BOOLEAN output
      1568 |       ROS_FLIPFLOP_STRUCT theta_range_ff
      1568 |         ROS_FLIPFLOP_STATE_STRUCT state
      1568 |           F32 s1
      1572 |         ROS_FLIPFLOP_INPUT_STRUCT input
      1572 |           BOOLEAN set
      1573 |           BOOLEAN reset
      1574 |         ROS_FLIPFLOP_OUTPUT_STRUCT output
      1574 |           BOOLEAN output
      1576 |       PERSISTENT1SHOT_STRUCT run_p1shot
      1576 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1584 |         PERSISTENT1SHOT_STATE_STRUCT state
      1584 |           BOOLEAN init
      1588 |           U32 iteration
      1592 |           BOOLEAN prev_input
      1596 |         PERSISTENT1SHOT_INPUT_STRUCT input
      1596 |           BOOLEAN input
      1597 |           BOOLEAN reset
      1598 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
      1598 |           BOOLEAN output
      1600 |       PERSISTENT1SHOT_STRUCT uar_hold_p1shot
      1600 |         PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1608 |         PERSISTENT1SHOT_STATE_STRUCT state
      1608 |           BOOLEAN init
      1612 |           U32 iteration
      1616 |           BOOLEAN prev_input
      1620 |         PERSISTENT1SHOT_INPUT_STRUCT input
      1620 |           BOOLEAN input
      1621 |           BOOLEAN reset
      1622 |         PERSISTENT1SHOT_OUTPUT_STRUCT output
      1622 |           BOOLEAN output
           | [sizeof=1624, align=8]

*** Dumping AST Record Layout
         0 | MCP_CONTROL_PRODUCER_STRUCT
         0 |   MCP_CONTROL_PRODUCER_COEFF_STRUCT * coeff_ptr
         8 |   MCP_CONTROL_PRODUCER_INPUT_STRUCT input
         8 |     BOOLEAN run
        12 |   MCP_CONTROL_PRODUCER_OUTPUT_STRUCT output
        12 |     CYCLIC_STRUCT feedback
        12 |       F32 roll
        16 |       F32 pitch
        20 |     BOOLEAN uar_mode
        21 |     BOOLEAN run_adp
        22 |     BOOLEAN phi_valid
        23 |     BOOLEAN theta_valid
        24 |   MCP_CONTROL_PRODUCER_STATE_STRUCT state
        24 |     CYCLIC_FEEDBACK_STRUCT cyclic_feedback
        24 |       CYCLIC_FEEDBACK_COEFF_STRUCT * coeff
        32 |       CYCLIC_FEEDBACK_STATE_STRUCT state
        32 |         ATTITUDE_CONTROLLER_STRUCT Roll_AttitudeController
        32 |           ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
        40 |           ATTITUDE_CONTROLLER_INPUT_STRUCT input
        40 |             F32 rate_cross_axis
        44 |             F32 rate_near_axis
        48 |             F32 attitude_near_axis
        52 |             F32 adp_roll_cmd
        56 |             F32 adp_pitch_cmd
        60 |             BOOLEAN run_mode
        61 |             BOOLEAN uar_mode
        64 |           ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
        64 |             F32 output
        72 |           ATTITUDE_CONTROLLER_STATE_STRUCT state
        72 |             SWITCH_SECOND_ORDER_STRUCT rate_switch
        72 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
        80 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
        80 |                 SWITCH_COMMON_STRUCT common
        80 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
        88 |                   SWITCH_COMMON_STATE_STRUCT state
        88 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
        88 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
        96 |                       PERSISTENT1SHOT_STATE_STRUCT state
        96 |                         BOOLEAN init
       100 |                         U32 iteration
       104 |                         BOOLEAN prev_input
       108 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       108 |                         BOOLEAN input
       109 |                         BOOLEAN reset
       110 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       110 |                         BOOLEAN output
       112 |                     F32 output_previous
       116 |                     F32 transition_deviation_latched
       120 |                     F32 selected_input
       128 |                 REINTICH_STRUCT first_integrator
       128 |                   REINTICH_COEFF_STRUCT * coeff
       136 |                   REINTICH_STATE_STRUCT state
       136 |                     F32 delay
       140 |                     BOOLEAN reset_on_init
       144 |                   REINTICH_INPUT_STRUCT input
       144 |                     F32 IC
       148 |                     F32 input
       152 |                     BOOLEAN run
       153 |                     BOOLEAN hold
       156 |                   REINTICH_OUTPUT_STRUCT output
       156 |                     F32 output
       160 |                 REINTICH_STRUCT second_integrator
       160 |                   REINTICH_COEFF_STRUCT * coeff
       168 |                   REINTICH_STATE_STRUCT state
       168 |                     F32 delay
       172 |                     BOOLEAN reset_on_init
       176 |                   REINTICH_INPUT_STRUCT input
       176 |                     F32 IC
       180 |                     F32 input
       184 |                     BOOLEAN run
       185 |                     BOOLEAN hold
       188 |                   REINTICH_OUTPUT_STRUCT output
       188 |                     F32 output
       192 |                 F32 first_feedback_delay
       196 |                 F32 second_feedback_delay
       200 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       200 |                 F32 input_one
       204 |                 F32 input_two
       208 |                 BOOLEAN switch_flag
       212 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       212 |                 F32 output
       216 |             SWITCH_SECOND_ORDER_STRUCT attitude_switch
       216 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       224 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
       224 |                 SWITCH_COMMON_STRUCT common
       224 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       232 |                   SWITCH_COMMON_STATE_STRUCT state
       232 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
       232 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       240 |                       PERSISTENT1SHOT_STATE_STRUCT state
       240 |                         BOOLEAN init
       244 |                         U32 iteration
       248 |                         BOOLEAN prev_input
       252 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       252 |                         BOOLEAN input
       253 |                         BOOLEAN reset
       254 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       254 |                         BOOLEAN output
       256 |                     F32 output_previous
       260 |                     F32 transition_deviation_latched
       264 |                     F32 selected_input
       272 |                 REINTICH_STRUCT first_integrator
       272 |                   REINTICH_COEFF_STRUCT * coeff
       280 |                   REINTICH_STATE_STRUCT state
       280 |                     F32 delay
       284 |                     BOOLEAN reset_on_init
       288 |                   REINTICH_INPUT_STRUCT input
       288 |                     F32 IC
       292 |                     F32 input
       296 |                     BOOLEAN run
       297 |                     BOOLEAN hold
       300 |                   REINTICH_OUTPUT_STRUCT output
       300 |                     F32 output
       304 |                 REINTICH_STRUCT second_integrator
       304 |                   REINTICH_COEFF_STRUCT * coeff
       312 |                   REINTICH_STATE_STRUCT state
       312 |                     F32 delay
       316 |                     BOOLEAN reset_on_init
       320 |                   REINTICH_INPUT_STRUCT input
       320 |                     F32 IC
       324 |                     F32 input
       328 |                     BOOLEAN run
       329 |                     BOOLEAN hold
       332 |                   REINTICH_OUTPUT_STRUCT output
       332 |                     F32 output
       336 |                 F32 first_feedback_delay
       340 |                 F32 second_feedback_delay
       344 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       344 |                 F32 input_one
       348 |                 F32 input_two
       352 |                 BOOLEAN switch_flag
       356 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       356 |                 F32 output
       360 |             REINTICH_STRUCT reintich
       360 |               REINTICH_COEFF_STRUCT * coeff
       368 |               REINTICH_STATE_STRUCT state
       368 |                 F32 delay
       372 |                 BOOLEAN reset_on_init
       376 |               REINTICH_INPUT_STRUCT input
       376 |                 F32 IC
       380 |                 F32 input
       384 |                 BOOLEAN run
       385 |                 BOOLEAN hold
       388 |               REINTICH_OUTPUT_STRUCT output
       388 |                 F32 output
       392 |             REINTICHS_STRUCT reintichs
       392 |               REINTICHS_COEFF_STRUCT * coeff
       400 |               REINTICHS_STATE_STRUCT state
       400 |                 F32 IC_delay
       404 |                 F32 rail_bounce
       408 |                 BOOLEAN prev_sat_UL
       409 |                 BOOLEAN prev_sat_LL
       410 |                 BOOLEAN prev_sat_inv
       411 |                 BOOLEAN prev_reset_int
       412 |                 BOOLEAN prev_reset_sat
       416 |                 REINTICH_STRUCT integrator
       416 |                   REINTICH_COEFF_STRUCT * coeff
       424 |                   REINTICH_STATE_STRUCT state
       424 |                     F32 delay
       428 |                     BOOLEAN reset_on_init
       432 |                   REINTICH_INPUT_STRUCT input
       432 |                     F32 IC
       436 |                     F32 input
       440 |                     BOOLEAN run
       441 |                     BOOLEAN hold
       444 |                   REINTICH_OUTPUT_STRUCT output
       444 |                     F32 output
       448 |                 SATURATIONVF_STRUCT sat
       448 |                   SATURATIONVF_COEFF_STRUCT * coeff
       456 |                   SATURATIONVF_STATE_STRUCT state
       456 |                     F32 delay
       460 |                     BOOLEAN reset_on_init
       464 |                   SATURATIONVF_INPUT_STRUCT input
       464 |                     F32 IC
       468 |                     F32 input
       472 |                     BOOLEAN reset
       476 |                   SATURATIONVF_OUTPUT_STRUCT output
       476 |                     F32 output
       480 |                     BOOLEAN inv
       481 |                     BOOLEAN satLo
       482 |                     BOOLEAN satHi
       488 |               REINTICHS_INPUT_STRUCT input
       488 |                 F32 IC
       492 |                 F32 input
       496 |                 BOOLEAN run
       497 |                 BOOLEAN hold
       500 |               REINTICHS_OUTPUT_STRUCT output
       500 |                 F32 output
       504 |                 BOOLEAN sat_UL
       505 |                 BOOLEAN sat_LL
       506 |                 BOOLEAN inv
       512 |             BOOLEAN prev_run
       520 |         ATTITUDE_CONTROLLER_STRUCT Pitch_AttitudeController
       520 |           ATTITUDE_CONTROLLER_COEFF_STRUCT * coeff_ptr
       528 |           ATTITUDE_CONTROLLER_INPUT_STRUCT input
       528 |             F32 rate_cross_axis
       532 |             F32 rate_near_axis
       536 |             F32 attitude_near_axis
       540 |             F32 adp_roll_cmd
       544 |             F32 adp_pitch_cmd
       548 |             BOOLEAN run_mode
       549 |             BOOLEAN uar_mode
       552 |           ATTITUDE_CONTROLLER_OUTPUT_STRUCT output
       552 |             F32 output
       560 |           ATTITUDE_CONTROLLER_STATE_STRUCT state
       560 |             SWITCH_SECOND_ORDER_STRUCT rate_switch
       560 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       568 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
       568 |                 SWITCH_COMMON_STRUCT common
       568 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       576 |                   SWITCH_COMMON_STATE_STRUCT state
       576 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
       576 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       584 |                       PERSISTENT1SHOT_STATE_STRUCT state
       584 |                         BOOLEAN init
       588 |                         U32 iteration
       592 |                         BOOLEAN prev_input
       596 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       596 |                         BOOLEAN input
       597 |                         BOOLEAN reset
       598 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       598 |                         BOOLEAN output
       600 |                     F32 output_previous
       604 |                     F32 transition_deviation_latched
       608 |                     F32 selected_input
       616 |                 REINTICH_STRUCT first_integrator
       616 |                   REINTICH_COEFF_STRUCT * coeff
       624 |                   REINTICH_STATE_STRUCT state
       624 |                     F32 delay
       628 |                     BOOLEAN reset_on_init
       632 |                   REINTICH_INPUT_STRUCT input
       632 |                     F32 IC
       636 |                     F32 input
       640 |                     BOOLEAN run
       641 |                     BOOLEAN hold
       644 |                   REINTICH_OUTPUT_STRUCT output
       644 |                     F32 output
       648 |                 REINTICH_STRUCT second_integrator
       648 |                   REINTICH_COEFF_STRUCT * coeff
       656 |                   REINTICH_STATE_STRUCT state
       656 |                     F32 delay
       660 |                     BOOLEAN reset_on_init
       664 |                   REINTICH_INPUT_STRUCT input
       664 |                     F32 IC
       668 |                     F32 input
       672 |                     BOOLEAN run
       673 |                     BOOLEAN hold
       676 |                   REINTICH_OUTPUT_STRUCT output
       676 |                     F32 output
       680 |                 F32 first_feedback_delay
       684 |                 F32 second_feedback_delay
       688 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       688 |                 F32 input_one
       692 |                 F32 input_two
       696 |                 BOOLEAN switch_flag
       700 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       700 |                 F32 output
       704 |             SWITCH_SECOND_ORDER_STRUCT attitude_switch
       704 |               SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
       712 |               SWITCH_SECOND_ORDER_STATE_STRUCT state
       712 |                 SWITCH_COMMON_STRUCT common
       712 |                   SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
       720 |                   SWITCH_COMMON_STATE_STRUCT state
       720 |                     PERSISTENT1SHOT_STRUCT transition_one_shot
       720 |                       PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
       728 |                       PERSISTENT1SHOT_STATE_STRUCT state
       728 |                         BOOLEAN init
       732 |                         U32 iteration
       736 |                         BOOLEAN prev_input
       740 |                       PERSISTENT1SHOT_INPUT_STRUCT input
       740 |                         BOOLEAN input
       741 |                         BOOLEAN reset
       742 |                       PERSISTENT1SHOT_OUTPUT_STRUCT output
       742 |                         BOOLEAN output
       744 |                     F32 output_previous
       748 |                     F32 transition_deviation_latched
       752 |                     F32 selected_input
       760 |                 REINTICH_STRUCT first_integrator
       760 |                   REINTICH_COEFF_STRUCT * coeff
       768 |                   REINTICH_STATE_STRUCT state
       768 |                     F32 delay
       772 |                     BOOLEAN reset_on_init
       776 |                   REINTICH_INPUT_STRUCT input
       776 |                     F32 IC
       780 |                     F32 input
       784 |                     BOOLEAN run
       785 |                     BOOLEAN hold
       788 |                   REINTICH_OUTPUT_STRUCT output
       788 |                     F32 output
       792 |                 REINTICH_STRUCT second_integrator
       792 |                   REINTICH_COEFF_STRUCT * coeff
       800 |                   REINTICH_STATE_STRUCT state
       800 |                     F32 delay
       804 |                     BOOLEAN reset_on_init
       808 |                   REINTICH_INPUT_STRUCT input
       808 |                     F32 IC
       812 |                     F32 input
       816 |                     BOOLEAN run
       817 |                     BOOLEAN hold
       820 |                   REINTICH_OUTPUT_STRUCT output
       820 |                     F32 output
       824 |                 F32 first_feedback_delay
       828 |                 F32 second_feedback_delay
       832 |               SWITCH_SECOND_ORDER_INPUT_STRUCT input
       832 |                 F32 input_one
       836 |                 F32 input_two
       840 |                 BOOLEAN switch_flag
       844 |               SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
       844 |                 F32 output
       848 |             REINTICH_STRUCT reintich
       848 |               REINTICH_COEFF_STRUCT * coeff
       856 |               REINTICH_STATE_STRUCT state
       856 |                 F32 delay
       860 |                 BOOLEAN reset_on_init
       864 |               REINTICH_INPUT_STRUCT input
       864 |                 F32 IC
       868 |                 F32 input
       872 |                 BOOLEAN run
       873 |                 BOOLEAN hold
       876 |               REINTICH_OUTPUT_STRUCT output
       876 |                 F32 output
       880 |             REINTICHS_STRUCT reintichs
       880 |               REINTICHS_COEFF_STRUCT * coeff
       888 |               REINTICHS_STATE_STRUCT state
       888 |                 F32 IC_delay
       892 |                 F32 rail_bounce
       896 |                 BOOLEAN prev_sat_UL
       897 |                 BOOLEAN prev_sat_LL
       898 |                 BOOLEAN prev_sat_inv
       899 |                 BOOLEAN prev_reset_int
       900 |                 BOOLEAN prev_reset_sat
       904 |                 REINTICH_STRUCT integrator
       904 |                   REINTICH_COEFF_STRUCT * coeff
       912 |                   REINTICH_STATE_STRUCT state
       912 |                     F32 delay
       916 |                     BOOLEAN reset_on_init
       920 |                   REINTICH_INPUT_STRUCT input
       920 |                     F32 IC
       924 |                     F32 input
       928 |                     BOOLEAN run
       929 |                     BOOLEAN hold
       932 |                   REINTICH_OUTPUT_STRUCT output
       932 |                     F32 output
       936 |                 SATURATIONVF_STRUCT sat
       936 |                   SATURATIONVF_COEFF_STRUCT * coeff
       944 |                   SATURATIONVF_STATE_STRUCT state
       944 |                     F32 delay
       948 |                     BOOLEAN reset_on_init
       952 |                   SATURATIONVF_INPUT_STRUCT input
       952 |                     F32 IC
       956 |                     F32 input
       960 |                     BOOLEAN reset
       964 |                   SATURATIONVF_OUTPUT_STRUCT output
       964 |                     F32 output
       968 |                     BOOLEAN inv
       969 |                     BOOLEAN satLo
       970 |                     BOOLEAN satHi
       976 |               REINTICHS_INPUT_STRUCT input
       976 |                 F32 IC
       980 |                 F32 input
       984 |                 BOOLEAN run
       985 |                 BOOLEAN hold
       988 |               REINTICHS_OUTPUT_STRUCT output
       988 |                 F32 output
       992 |                 BOOLEAN sat_UL
       993 |                 BOOLEAN sat_LL
       994 |                 BOOLEAN inv
      1000 |             BOOLEAN prev_run
      1008 |         F32 roll_rate_limiter_previous_state
      1012 |         F32 pitch_rate_limiter_previous_state
      1016 |         SWITCH_SECOND_ORDER_STRUCT adp_roll_cmd_switch
      1016 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1024 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
      1024 |             SWITCH_COMMON_STRUCT common
      1024 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1032 |               SWITCH_COMMON_STATE_STRUCT state
      1032 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
      1032 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1040 |                   PERSISTENT1SHOT_STATE_STRUCT state
      1040 |                     BOOLEAN init
      1044 |                     U32 iteration
      1048 |                     BOOLEAN prev_input
      1052 |                   PERSISTENT1SHOT_INPUT_STRUCT input
      1052 |                     BOOLEAN input
      1053 |                     BOOLEAN reset
      1054 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
      1054 |                     BOOLEAN output
      1056 |                 F32 output_previous
      1060 |                 F32 transition_deviation_latched
      1064 |                 F32 selected_input
      1072 |             REINTICH_STRUCT first_integrator
      1072 |               REINTICH_COEFF_STRUCT * coeff
      1080 |               REINTICH_STATE_STRUCT state
      1080 |                 F32 delay
      1084 |                 BOOLEAN reset_on_init
      1088 |               REINTICH_INPUT_STRUCT input
      1088 |                 F32 IC
      1092 |                 F32 input
      1096 |                 BOOLEAN run
      1097 |                 BOOLEAN hold
      1100 |               REINTICH_OUTPUT_STRUCT output
      1100 |                 F32 output
      1104 |             REINTICH_STRUCT second_integrator
      1104 |               REINTICH_COEFF_STRUCT * coeff
      1112 |               REINTICH_STATE_STRUCT state
      1112 |                 F32 delay
      1116 |                 BOOLEAN reset_on_init
      1120 |               REINTICH_INPUT_STRUCT input
      1120 |                 F32 IC
      1124 |                 F32 input
      1128 |                 BOOLEAN run
      1129 |                 BOOLEAN hold
      1132 |               REINTICH_OUTPUT_STRUCT output
      1132 |                 F32 output
      1136 |             F32 first_feedback_delay
      1140 |             F32 second_feedback_delay
      1144 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1144 |             F32 input_one
      1148 |             F32 input_two
      1152 |             BOOLEAN switch_flag
      1156 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1156 |             F32 output
      1160 |         SWITCH_SECOND_ORDER_STRUCT adp_pitch_cmd_switch
      1160 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1168 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
      1168 |             SWITCH_COMMON_STRUCT common
      1168 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1176 |               SWITCH_COMMON_STATE_STRUCT state
      1176 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
      1176 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1184 |                   PERSISTENT1SHOT_STATE_STRUCT state
      1184 |                     BOOLEAN init
      1188 |                     U32 iteration
      1192 |                     BOOLEAN prev_input
      1196 |                   PERSISTENT1SHOT_INPUT_STRUCT input
      1196 |                     BOOLEAN input
      1197 |                     BOOLEAN reset
      1198 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
      1198 |                     BOOLEAN output
      1200 |                 F32 output_previous
      1204 |                 F32 transition_deviation_latched
      1208 |                 F32 selected_input
      1216 |             REINTICH_STRUCT first_integrator
      1216 |               REINTICH_COEFF_STRUCT * coeff
      1224 |               REINTICH_STATE_STRUCT state
      1224 |                 F32 delay
      1228 |                 BOOLEAN reset_on_init
      1232 |               REINTICH_INPUT_STRUCT input
      1232 |                 F32 IC
      1236 |                 F32 input
      1240 |                 BOOLEAN run
      1241 |                 BOOLEAN hold
      1244 |               REINTICH_OUTPUT_STRUCT output
      1244 |                 F32 output
      1248 |             REINTICH_STRUCT second_integrator
      1248 |               REINTICH_COEFF_STRUCT * coeff
      1256 |               REINTICH_STATE_STRUCT state
      1256 |                 F32 delay
      1260 |                 BOOLEAN reset_on_init
      1264 |               REINTICH_INPUT_STRUCT input
      1264 |                 F32 IC
      1268 |                 F32 input
      1272 |                 BOOLEAN run
      1273 |                 BOOLEAN hold
      1276 |               REINTICH_OUTPUT_STRUCT output
      1276 |                 F32 output
      1280 |             F32 first_feedback_delay
      1284 |             F32 second_feedback_delay
      1288 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1288 |             F32 input_one
      1292 |             F32 input_two
      1296 |             BOOLEAN switch_flag
      1300 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1300 |             F32 output
      1304 |         TEST_PORT_STRUCT roll_testport
      1304 |           TEST_PORT_COEFF_STRUCT * coeff
      1312 |           TEST_PORT_INPUT_STRUCT input
      1312 |             F32 input
      1316 |           TEST_PORT_OUTPUT_STRUCT output
      1316 |             F32 output
      1320 |         TEST_PORT_STRUCT pitch_testport
      1320 |           TEST_PORT_COEFF_STRUCT * coeff
      1328 |           TEST_PORT_INPUT_STRUCT input
      1328 |             F32 input
      1332 |           TEST_PORT_OUTPUT_STRUCT output
      1332 |             F32 output
      1336 |         BOOLEAN first_frame
      1344 |         SWITCH_SECOND_ORDER_STRUCT heading_rate_switch
      1344 |           SWITCH_SECOND_ORDER_COEFF_STRUCT * coeff_ptr
      1352 |           SWITCH_SECOND_ORDER_STATE_STRUCT state
      1352 |             SWITCH_COMMON_STRUCT common
      1352 |               SWITCH_COMMON_COEFF_STRUCT * coeff_ptr
      1360 |               SWITCH_COMMON_STATE_STRUCT state
      1360 |                 PERSISTENT1SHOT_STRUCT transition_one_shot
      1360 |                   PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1368 |                   PERSISTENT1SHOT_STATE_STRUCT state
      1368 |                     BOOLEAN init
      1372 |                     U32 iteration
      1376 |                     BOOLEAN prev_input
      1380 |                   PERSISTENT1SHOT_INPUT_STRUCT input
      1380 |                     BOOLEAN input
      1381 |                     BOOLEAN reset
      1382 |                   PERSISTENT1SHOT_OUTPUT_STRUCT output
      1382 |                     BOOLEAN output
      1384 |                 F32 output_previous
      1388 |                 F32 transition_deviation_latched
      1392 |                 F32 selected_input
      1400 |             REINTICH_STRUCT first_integrator
      1400 |               REINTICH_COEFF_STRUCT * coeff
      1408 |               REINTICH_STATE_STRUCT state
      1408 |                 F32 delay
      1412 |                 BOOLEAN reset_on_init
      1416 |               REINTICH_INPUT_STRUCT input
      1416 |                 F32 IC
      1420 |                 F32 input
      1424 |                 BOOLEAN run
      1425 |                 BOOLEAN hold
      1428 |               REINTICH_OUTPUT_STRUCT output
      1428 |                 F32 output
      1432 |             REINTICH_STRUCT second_integrator
      1432 |               REINTICH_COEFF_STRUCT * coeff
      1440 |               REINTICH_STATE_STRUCT state
      1440 |                 F32 delay
      1444 |                 BOOLEAN reset_on_init
      1448 |               REINTICH_INPUT_STRUCT input
      1448 |                 F32 IC
      1452 |                 F32 input
      1456 |                 BOOLEAN run
      1457 |                 BOOLEAN hold
      1460 |               REINTICH_OUTPUT_STRUCT output
      1460 |                 F32 output
      1464 |             F32 first_feedback_delay
      1468 |             F32 second_feedback_delay
      1472 |           SWITCH_SECOND_ORDER_INPUT_STRUCT input
      1472 |             F32 input_one
      1476 |             F32 input_two
      1480 |             BOOLEAN switch_flag
      1484 |           SWITCH_SECOND_ORDER_OUTPUT_STRUCT output
      1484 |             F32 output
      1488 |         F32 switched_heading_rate
      1492 |         F32 roll_test_input
      1496 |         F32 pitch_test_input
      1504 |       CYCLIC_FEEDBACK_INPUT_STRUCT input
      1504 |         F32 adp_phi_cmd
      1508 |         F32 adp_theta_cmd
      1512 |         F32 phi
      1516 |         F32 phi_dot
      1520 |         F32 psi_dot
      1524 |         F32 theta
      1528 |         F32 theta_dot
      1532 |         F32 p
      1536 |         F32 q
      1540 |         BOOLEAN reset
      1541 |         BOOLEAN UAR_mode
      1542 |         BOOLEAN triplex_fault
      1544 |     UARMODELOGIC_STRUCT uar_mode_logic
      1544 |       UARMODELOGIC_COEFF_STRUCT * coeff_ptr
      1552 |       UARMODELOGIC_INPUT_STRUCT input
      1552 |         F32 phi
      1556 |         F32 theta
      1560 |         F32 p_filt
      1564 |         F32 q_filt
      1568 |         BOOLEAN run
      1569 |         BOOLEAN adp_fail
      1570 |         BOOLEAN disable_ADP
      1572 |       UARMODELOGIC_OUTPUT_STRUCT output
      1572 |         BOOLEAN phi_range_valid
      1573 |         BOOLEAN theta_range_valid
      1574 |         BOOLEAN uar_mode
      1576 |       UARMODELOGIC_STATE_STRUCT state
      1576 |         ROS_FLIPFLOP_STRUCT uar_mode_ff
      1576 |           ROS_FLIPFLOP_STATE_STRUCT state
      1576 |             F32 s1
      1580 |           ROS_FLIPFLOP_INPUT_STRUCT input
      1580 |             BOOLEAN set
      1581 |             BOOLEAN reset
      1582 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
      1582 |             BOOLEAN output
      1584 |         ROS_FLIPFLOP_STRUCT phi_range_ff
      1584 |           ROS_FLIPFLOP_STATE_STRUCT state
      1584 |             F32 s1
      1588 |           ROS_FLIPFLOP_INPUT_STRUCT input
      1588 |             BOOLEAN set
      1589 |             BOOLEAN reset
      1590 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
      1590 |             BOOLEAN output
      1592 |         ROS_FLIPFLOP_STRUCT theta_range_ff
      1592 |           ROS_FLIPFLOP_STATE_STRUCT state
      1592 |             F32 s1
      1596 |           ROS_FLIPFLOP_INPUT_STRUCT input
      1596 |             BOOLEAN set
      1597 |             BOOLEAN reset
      1598 |           ROS_FLIPFLOP_OUTPUT_STRUCT output
      1598 |             BOOLEAN output
      1600 |         PERSISTENT1SHOT_STRUCT run_p1shot
      1600 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1608 |           PERSISTENT1SHOT_STATE_STRUCT state
      1608 |             BOOLEAN init
      1612 |             U32 iteration
      1616 |             BOOLEAN prev_input
      1620 |           PERSISTENT1SHOT_INPUT_STRUCT input
      1620 |             BOOLEAN input
      1621 |             BOOLEAN reset
      1622 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
      1622 |             BOOLEAN output
      1624 |         PERSISTENT1SHOT_STRUCT uar_hold_p1shot
      1624 |           PERSISTENT1SHOT_COEFF_STRUCT * coeff_ptr
      1632 |           PERSISTENT1SHOT_STATE_STRUCT state
      1632 |             BOOLEAN init
      1636 |             U32 iteration
      1640 |             BOOLEAN prev_input
      1644 |           PERSISTENT1SHOT_INPUT_STRUCT input
      1644 |             BOOLEAN input
      1645 |             BOOLEAN reset
      1646 |           PERSISTENT1SHOT_OUTPUT_STRUCT output
      1646 |             BOOLEAN output
           | [sizeof=1648, align=8]

*** Dumping AST Record Layout
         0 | EULER_RATES
         0 |   F32 phi_dot
         4 |   F32 theta_dot
         8 |   F32 psi_dot
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5)
     0:0-0 |   U32 mag_valid
     0:1-1 |   U32 accel_valid
     0:2-2 |   U32 gyro_valid
     0:3-3 |   U32 oat_valid
     0:4-4 |   U32 adc0_valid
     0:5-5 |   U32 adc1_valid
     0:6-6 |   U32 remote_accel_valid
     0:7-7 |   U32 ADAHRS_valid
     1:0-0 |   U32 UAR_Mode
     1:1-1 |   U32 Pilot_Override
     1:2-2 |   U32 Autopilot_Engaged
     1:3-3 |   U32 Autopilot_Ready
     1:4-4 |   U32 CPD_Input
     1:5-5 |   U32 Video_Sync_Light_Output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | System_Flags
         0 |   U32 flags_u32
         0 |   struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5) flags_bf
     0:0-0 |     U32 mag_valid
     0:1-1 |     U32 accel_valid
     0:2-2 |     U32 gyro_valid
     0:3-3 |     U32 oat_valid
     0:4-4 |     U32 adc0_valid
     0:5-5 |     U32 adc1_valid
     0:6-6 |     U32 remote_accel_valid
     0:7-7 |     U32 ADAHRS_valid
     1:0-0 |     U32 UAR_Mode
     1:1-1 |     U32 Pilot_Override
     1:2-2 |     U32 Autopilot_Engaged
     1:3-3 |     U32 Autopilot_Ready
     1:4-4 |     U32 CPD_Input
     1:5-5 |     U32 Video_Sync_Light_Output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:100:5)
     0:0-0 |   U32 Roll_Rate_Fail
     0:1-1 |   U32 Roll_ADP_Cmd_Fail
     0:2-2 |   U32 Roll_ACT_POS_Fail
     0:3-3 |   U32 Roll_ATT_Fail
     0:4-4 |   U32 Pitch_Rate_Fail
     0:5-5 |   U32 Pitch_ADP_Cmd_Fail
     0:6-6 |   U32 Pitch_ACT_Pos_Fail
     0:7-7 |   U32 Pitch_ATT_Fail
     1:0-0 |   U32 Roll_Servoloop_CurrSatLL
     1:1-1 |   U32 Roll_Servoloop_CurrSatUL
     1:2-2 |   U32 Roll_Servoloop_PLSat
     1:3-3 |   U32 Roll_Servoloop_PLInv
     1:4-4 |   U32 Roll_Servoloop_RLSat
     1:5-5 |   U32 Pitch_Servoloop_CurrSatLL
     1:6-6 |   U32 Pitch_Servoloop_CurrSatUL
     1:7-7 |   U32 Pitch_Servoloop_PLSat
     2:0-0 |   U32 Pitch_Servoloop_PLInv
     2:1-1 |   U32 Pitch_Servoloop_RLSat
     2:2-2 |   U32 Combined_Fail_Status
     2:3-3 |   U32 Roll_Rate_Limited
     2:4-4 |   U32 Pitch_Rate_Limited
     2:5-5 |   U32 Roll_Att_Ctrl_Integ_Sat
     2:6-6 |   U32 Pitch_Att_Ctrl_Integ_Sat
     2:7-7 |   U32 Roll_ADP_Rate_Limit
     3:0-0 |   U32 Pitch_ADP_Rate_Limit
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | CLAW_Flags
         0 |   U32 flags_u32
         0 |   struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:100:5) flags_bf
     0:0-0 |     U32 Roll_Rate_Fail
     0:1-1 |     U32 Roll_ADP_Cmd_Fail
     0:2-2 |     U32 Roll_ACT_POS_Fail
     0:3-3 |     U32 Roll_ATT_Fail
     0:4-4 |     U32 Pitch_Rate_Fail
     0:5-5 |     U32 Pitch_ADP_Cmd_Fail
     0:6-6 |     U32 Pitch_ACT_Pos_Fail
     0:7-7 |     U32 Pitch_ATT_Fail
     1:0-0 |     U32 Roll_Servoloop_CurrSatLL
     1:1-1 |     U32 Roll_Servoloop_CurrSatUL
     1:2-2 |     U32 Roll_Servoloop_PLSat
     1:3-3 |     U32 Roll_Servoloop_PLInv
     1:4-4 |     U32 Roll_Servoloop_RLSat
     1:5-5 |     U32 Pitch_Servoloop_CurrSatLL
     1:6-6 |     U32 Pitch_Servoloop_CurrSatUL
     1:7-7 |     U32 Pitch_Servoloop_PLSat
     2:0-0 |     U32 Pitch_Servoloop_PLInv
     2:1-1 |     U32 Pitch_Servoloop_RLSat
     2:2-2 |     U32 Combined_Fail_Status
     2:3-3 |     U32 Roll_Rate_Limited
     2:4-4 |     U32 Pitch_Rate_Limited
     2:5-5 |     U32 Roll_Att_Ctrl_Integ_Sat
     2:6-6 |     U32 Pitch_Att_Ctrl_Integ_Sat
     2:7-7 |     U32 Roll_ADP_Rate_Limit
     3:0-0 |     U32 Pitch_ADP_Rate_Limit
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TELEMETRY_LOG_STRUCT
         0 |   EULER_ANGLES eulers
         0 |     F32 phi
         4 |     F32 theta
         8 |     F32 psi
        12 |   EULER_RATES euler_rates
        12 |     F32 phi_dot
        16 |     F32 theta_dot
        20 |     F32 psi_dot
        24 |   VECTOR3 mags
        24 |     F32 X
        28 |     F32 Y
        32 |     F32 Z
        36 |   VECTOR3 rates
        36 |     F32 X
        40 |     F32 Y
        44 |     F32 Z
        48 |   VECTOR3 accels
        48 |     F32 X
        52 |     F32 Y
        56 |     F32 Z
        60 |   CYCLIC_STRUCT actuator_positions
        60 |     F32 roll
        64 |     F32 pitch
        68 |   CYCLIC_STRUCT actuator_commands
        68 |     F32 roll
        72 |     F32 pitch
        76 |   CYCLIC_STRUCT motor_A_current
        76 |     F32 roll
        80 |     F32 pitch
        84 |   CYCLIC_STRUCT motor_B_current
        84 |     F32 roll
        88 |     F32 pitch
        92 |   CYCLIC_STRUCT actuator_mvc
        92 |     F32 roll
        96 |     F32 pitch
       100 |   F32 IAS
       104 |   F32 TAS
       108 |   F32 baro_altitude
       112 |   F32 oat
       116 |   U32 framenumber
       120 |   U32 latest_fault
       124 |   System_Flags sys_flags
       124 |     U32 flags_u32
       124 |     struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5) flags_bf
   124:0-0 |       U32 mag_valid
   124:1-1 |       U32 accel_valid
   124:2-2 |       U32 gyro_valid
   124:3-3 |       U32 oat_valid
   124:4-4 |       U32 adc0_valid
   124:5-5 |       U32 adc1_valid
   124:6-6 |       U32 remote_accel_valid
   124:7-7 |       U32 ADAHRS_valid
   125:0-0 |       U32 UAR_Mode
   125:1-1 |       U32 Pilot_Override
   125:2-2 |       U32 Autopilot_Engaged
   125:3-3 |       U32 Autopilot_Ready
   125:4-4 |       U32 CPD_Input
   125:5-5 |       U32 Video_Sync_Light_Output
       128 |   CLAW_Flags claw_flags
       128 |     U32 flags_u32
       128 |     struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:100:5) flags_bf
   128:0-0 |       U32 Roll_Rate_Fail
   128:1-1 |       U32 Roll_ADP_Cmd_Fail
   128:2-2 |       U32 Roll_ACT_POS_Fail
   128:3-3 |       U32 Roll_ATT_Fail
   128:4-4 |       U32 Pitch_Rate_Fail
   128:5-5 |       U32 Pitch_ADP_Cmd_Fail
   128:6-6 |       U32 Pitch_ACT_Pos_Fail
   128:7-7 |       U32 Pitch_ATT_Fail
   129:0-0 |       U32 Roll_Servoloop_CurrSatLL
   129:1-1 |       U32 Roll_Servoloop_CurrSatUL
   129:2-2 |       U32 Roll_Servoloop_PLSat
   129:3-3 |       U32 Roll_Servoloop_PLInv
   129:4-4 |       U32 Roll_Servoloop_RLSat
   129:5-5 |       U32 Pitch_Servoloop_CurrSatLL
   129:6-6 |       U32 Pitch_Servoloop_CurrSatUL
   129:7-7 |       U32 Pitch_Servoloop_PLSat
   130:0-0 |       U32 Pitch_Servoloop_PLInv
   130:1-1 |       U32 Pitch_Servoloop_RLSat
   130:2-2 |       U32 Combined_Fail_Status
   130:3-3 |       U32 Roll_Rate_Limited
   130:4-4 |       U32 Pitch_Rate_Limited
   130:5-5 |       U32 Roll_Att_Ctrl_Integ_Sat
   130:6-6 |       U32 Pitch_Att_Ctrl_Integ_Sat
   130:7-7 |       U32 Roll_ADP_Rate_Limit
   131:0-0 |       U32 Pitch_ADP_Rate_Limit
       132 |   U8 button_states
           | [sizeof=136, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2842b10 <..\..\..\Common\Header/HeliTrak_Types.h:222:9, line:227:1> line:222:9 struct definition
|-FullComment 0x2d99aa8 <line:217:4, line:221:76>
| |-ParagraphComment 0x2d998a8 <line:217:4, line:218:4>
| | |-TextComment 0x2d99858 <line:217:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d99878 <line:218:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d998c8 <col:5, col:26> Text=" EULER_ANGLES"
| |-ParagraphComment 0x2d99930 <line:219:1, col:4>
| | `-TextComment 0x2d99908 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d99950 <col:5, line:221:76> Name="brief"
|   `-ParagraphComment 0x2d99a68 <line:219:11, line:221:76>
|     |-TextComment 0x2d99978 <line:219:11, col:55> Text=" Structure which holds the three euler angles"
|     |-TextComment 0x2d99998 <line:220:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d999e0 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2d99a00 <col:16, col:34> Text="{HAP1-SDD-COM, 829}"
|     `-TextComment 0x2d99a20 <line:221:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2842bd0 <line:224:5, col:9> col:9 phi 'F32':'float'
|-FieldDecl 0x2842c30 <line:225:5, col:9> col:9 theta 'F32':'float'
`-FieldDecl 0x2842c90 <line:226:5, col:9> col:9 psi 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.EULER_ANGLES = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2842dd0 <..\..\..\Common\Header/HeliTrak_Types.h:235:9, line:240:1> line:235:9 struct definition
|-FullComment 0x2d99d30 <line:230:4, line:234:76>
| |-ParagraphComment 0x2d99b58 <line:230:4, line:231:4>
| | |-TextComment 0x2d99b08 <line:230:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d99b28 <line:231:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d99b78 <col:5, col:25> Text=" EULER_RATES"
| |-ParagraphComment 0x2d99be0 <line:232:1, col:4>
| | `-TextComment 0x2d99bb8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d99c00 <col:5, line:234:76> Name="brief"
|   `-ParagraphComment 0x2d99cf0 <line:232:11, line:234:76>
|     |-TextComment 0x2d99c28 <line:232:11, col:83> Text=" Structure which holds the rates of rotation about the three euler angles"
|     |-TextComment 0x2d99c48 <line:233:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d99c68 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2d99c88 <col:16, col:35> Text="{HAP1-SDD-COM, 2517}"
|     `-TextComment 0x2d99ca8 <line:234:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2842e90 <line:237:5, col:9> col:9 phi_dot 'F32':'float'
|-FieldDecl 0x2842ef0 <line:238:5, col:9> col:9 theta_dot 'F32':'float'
`-FieldDecl 0x2842f50 <line:239:5, col:9> col:9 psi_dot 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.EULER_RATES = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x28424f0 <..\..\..\Common\Header/HeliTrak_Types.h:196:9, line:201:1> line:196:9 struct definition
|-FullComment 0x2d99fb8 <line:191:4, line:195:76>
| |-ParagraphComment 0x2d99de0 <line:191:4, line:192:4>
| | |-TextComment 0x2d99d90 <line:191:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d99db0 <line:192:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d99e00 <col:5, col:21> Text=" VECTOR3"
| |-ParagraphComment 0x2d99e68 <line:193:1, col:4>
| | `-TextComment 0x2d99e40 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d99e88 <col:5, line:195:76> Name="brief"
|   `-ParagraphComment 0x2d99f78 <line:193:11, line:195:76>
|     |-TextComment 0x2d99eb0 <line:193:11, col:59> Text=" Structure which holds the elements of a 3-vector"
|     |-TextComment 0x2d99ed0 <line:194:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d99ef0 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2d99f10 <col:16, col:34> Text="{HAP1-SDD-COM, 534}"
|     `-TextComment 0x2d99f30 <line:195:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x28425d0 <line:198:5, col:9> col:9 X 'F32':'float'
|-FieldDecl 0x2842630 <line:199:5, col:9> col:9 Y 'F32':'float'
`-FieldDecl 0x2842690 <line:200:5, col:9> col:9 Z 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.VECTOR3 = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2844250 <..\..\..\Common\Header/HeliTrak_Types.h:334:9, line:338:1> line:334:9 struct definition
|-FullComment 0x2d9b268 <line:329:4, line:333:76>
| |-ParagraphComment 0x2d9a068 <line:329:4, line:330:4>
| | |-TextComment 0x2d9a018 <line:329:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d9a038 <line:330:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d9a088 <col:5, col:27> Text=" CYCLIC_STRUCT"
| |-ParagraphComment 0x2d9a0f0 <line:331:1, col:4>
| | `-TextComment 0x2d9a0c8 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d9a110 <col:5, line:333:76> Name="brief"
|   `-ParagraphComment 0x2d9b228 <line:331:11, line:333:76>
|     |-TextComment 0x2d9b160 <line:331:11, col:52> Text=" Structure which holds the pitch and roll "
|     |-TextComment 0x2d9b180 <line:332:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d9b1a0 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2d9b1c0 <col:16, col:35> Text="{HAP1-SDD-COM, 2534}"
|     `-TextComment 0x2d9b1e0 <line:333:1, col:76> Text="   ======================================================================== "
|-FieldDecl 0x2844310 <line:336:5, col:9> col:9 roll 'F32':'float'
`-FieldDecl 0x2844370 <line:337:5, col:9> col:9 pitch 'F32':'float'

Layout: <CGRecordLayout
  LLVMType:%struct.CYCLIC_STRUCT = type { float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2b99ec0 <..\..\..\Common\Header\Union_Flags.h:63:5, line:87:5> line:63:5 struct definition
|-FieldDecl 0x2b99fa8 <line:66:9, col:43> col:13 mag_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2b99f70 <col:43> 'int' 1
|-FieldDecl 0x2b9a030 <line:67:9, col:43> col:13 accel_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2b99ff8 <col:43> 'int' 1
|-FieldDecl 0x2b9a0b8 <line:68:9, col:43> col:13 gyro_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2b9a080 <col:43> 'int' 1
|-FieldDecl 0x2ba01b0 <line:69:9, col:43> col:13 oat_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2b9a108 <col:43> 'int' 1
|-FieldDecl 0x2ba0238 <line:70:9, col:43> col:13 adc0_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0200 <col:43> 'int' 1
|-FieldDecl 0x2ba02c0 <line:71:9, col:43> col:13 adc1_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0288 <col:43> 'int' 1
|-FieldDecl 0x2ba0348 <line:72:9, col:43> col:13 remote_accel_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0310 <col:43> 'int' 1
|-FieldDecl 0x2ba03d0 <line:73:9, col:43> col:13 ADAHRS_valid 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0398 <col:43> 'int' 1
|-FieldDecl 0x2ba0458 <line:76:9, col:43> col:13 UAR_Mode 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0420 <col:43> 'int' 1
|-FieldDecl 0x2ba04e0 <line:77:9, col:43> col:13 Pilot_Override 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba04a8 <col:43> 'int' 1
|-FieldDecl 0x2ba0568 <line:78:9, col:43> col:13 Autopilot_Engaged 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0530 <col:43> 'int' 1
|-FieldDecl 0x2ba05f0 <line:79:9, col:43> col:13 Autopilot_Ready 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba05b8 <col:43> 'int' 1
|-FieldDecl 0x2ba0678 <line:82:9, col:43> col:13 CPD_Input 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0640 <col:43> 'int' 1
`-FieldDecl 0x2ba0700 <line:83:9, col:43> col:13 Video_Sync_Light_Output 'U32':'unsigned long'
  `-IntegerLiteral 0x2ba06c8 <col:43> 'int' 1

Layout: <CGRecordLayout
  LLVMType:%struct.anon = type { i32 }
  IsZeroInitializable:1
  BitFields:[
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:8 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:9 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:10 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:11 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:12 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:13 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2b99db8 <..\..\..\Common\Header\Union_Flags.h:60:9, line:89:1> line:60:9 union definition
|-FullComment 0x2d9b4f0 <line:55:4, line:59:77>
| |-ParagraphComment 0x2d9b318 <line:55:4, line:56:4>
| | |-TextComment 0x2d9b2c8 <line:55:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d9b2e8 <line:56:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d9b338 <col:5, col:22> Text=" System_Flags"
| |-ParagraphComment 0x2d9b3a0 <line:57:1, col:4>
| | `-TextComment 0x2d9b378 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d9b3c0 <col:5, line:59:77> Name="brief"
|   `-ParagraphComment 0x2d9b4b0 <line:57:11, line:59:77>
|     |-TextComment 0x2d9b3e8 <line:57:11, col:62> Text=" Union of U32 and bitfields for boolean system flags"
|     |-TextComment 0x2d9b408 <line:58:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d9b428 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2d9b448 <col:16, col:33> Text="{HAP1-SDD-Com,xxx}"
|     `-TextComment 0x2d9b468 <line:59:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2b99e70 <line:62:5, col:9> col:9 flags_u32 'U32':'unsigned long'
|-RecordDecl 0x2b99ec0 <line:63:5, line:87:5> line:63:5 struct definition
| |-FieldDecl 0x2b99fa8 <line:66:9, col:43> col:13 mag_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2b99f70 <col:43> 'int' 1
| |-FieldDecl 0x2b9a030 <line:67:9, col:43> col:13 accel_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2b99ff8 <col:43> 'int' 1
| |-FieldDecl 0x2b9a0b8 <line:68:9, col:43> col:13 gyro_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2b9a080 <col:43> 'int' 1
| |-FieldDecl 0x2ba01b0 <line:69:9, col:43> col:13 oat_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2b9a108 <col:43> 'int' 1
| |-FieldDecl 0x2ba0238 <line:70:9, col:43> col:13 adc0_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0200 <col:43> 'int' 1
| |-FieldDecl 0x2ba02c0 <line:71:9, col:43> col:13 adc1_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0288 <col:43> 'int' 1
| |-FieldDecl 0x2ba0348 <line:72:9, col:43> col:13 remote_accel_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0310 <col:43> 'int' 1
| |-FieldDecl 0x2ba03d0 <line:73:9, col:43> col:13 ADAHRS_valid 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0398 <col:43> 'int' 1
| |-FieldDecl 0x2ba0458 <line:76:9, col:43> col:13 UAR_Mode 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0420 <col:43> 'int' 1
| |-FieldDecl 0x2ba04e0 <line:77:9, col:43> col:13 Pilot_Override 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba04a8 <col:43> 'int' 1
| |-FieldDecl 0x2ba0568 <line:78:9, col:43> col:13 Autopilot_Engaged 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0530 <col:43> 'int' 1
| |-FieldDecl 0x2ba05f0 <line:79:9, col:43> col:13 Autopilot_Ready 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba05b8 <col:43> 'int' 1
| |-FieldDecl 0x2ba0678 <line:82:9, col:43> col:13 CPD_Input 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0640 <col:43> 'int' 1
| `-FieldDecl 0x2ba0700 <line:83:9, col:43> col:13 Video_Sync_Light_Output 'U32':'unsigned long'
|   `-IntegerLiteral 0x2ba06c8 <col:43> 'int' 1
`-FieldDecl 0x2ba07a8 <line:63:5, line:87:7> col:7 flags_bf 'struct (anonymous struct at ..\..\..\Common\Header\Union_Flags.h:63:5)':'struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5)'

Layout: <CGRecordLayout
  LLVMType:%union.System_Flags = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2ba0a00 <..\..\..\Common\Header\Union_Flags.h:100:5, line:137:5> line:100:5 struct definition
|-FieldDecl 0x2ba0ae8 <line:103:9, col:43> col:13 Roll_Rate_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0ab0 <col:43> 'int' 1
|-FieldDecl 0x2ba0b70 <line:104:9, col:43> col:13 Roll_ADP_Cmd_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0b38 <col:43> 'int' 1
|-FieldDecl 0x2ba0bf8 <line:105:9, col:43> col:13 Roll_ACT_POS_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0bc0 <col:43> 'int' 1
|-FieldDecl 0x2ba0c80 <line:106:9, col:43> col:13 Roll_ATT_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0c48 <col:43> 'int' 1
|-FieldDecl 0x2ba0d08 <line:108:9, col:43> col:13 Pitch_Rate_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0cd0 <col:43> 'int' 1
|-FieldDecl 0x2ba0d90 <line:109:9, col:43> col:13 Pitch_ADP_Cmd_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0d58 <col:43> 'int' 1
|-FieldDecl 0x2ba0e18 <line:110:9, col:43> col:13 Pitch_ACT_Pos_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0de0 <col:43> 'int' 1
|-FieldDecl 0x2ba0ea0 <line:111:9, col:43> col:13 Pitch_ATT_Fail 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0e68 <col:43> 'int' 1
|-FieldDecl 0x2ba0f28 <line:113:9, col:43> col:13 Roll_Servoloop_CurrSatLL 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0ef0 <col:43> 'int' 1
|-FieldDecl 0x2ba0fb0 <line:114:9, col:43> col:13 Roll_Servoloop_CurrSatUL 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba0f78 <col:43> 'int' 1
|-FieldDecl 0x2ba1038 <line:115:9, col:43> col:13 Roll_Servoloop_PLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba1000 <col:43> 'int' 1
|-FieldDecl 0x2ba10c0 <line:116:9, col:43> col:13 Roll_Servoloop_PLInv 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba1088 <col:43> 'int' 1
|-FieldDecl 0x2ba1148 <line:117:9, col:43> col:13 Roll_Servoloop_RLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba1110 <col:43> 'int' 1
|-FieldDecl 0x2ba2208 <line:119:9, col:43> col:13 Pitch_Servoloop_CurrSatLL 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba21d0 <col:43> 'int' 1
|-FieldDecl 0x2ba2290 <line:120:9, col:43> col:13 Pitch_Servoloop_CurrSatUL 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2258 <col:43> 'int' 1
|-FieldDecl 0x2ba2318 <line:121:9, col:43> col:13 Pitch_Servoloop_PLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba22e0 <col:43> 'int' 1
|-FieldDecl 0x2ba23a0 <line:122:9, col:43> col:13 Pitch_Servoloop_PLInv 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2368 <col:43> 'int' 1
|-FieldDecl 0x2ba2428 <line:123:9, col:43> col:13 Pitch_Servoloop_RLSat 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba23f0 <col:43> 'int' 1
|-FieldDecl 0x2ba24b0 <line:125:9, col:43> col:13 Combined_Fail_Status 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2478 <col:43> 'int' 1
|-FieldDecl 0x2ba2538 <line:128:9, col:43> col:13 Roll_Rate_Limited 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2500 <col:43> 'int' 1
|-FieldDecl 0x2ba25c0 <line:129:9, col:43> col:13 Pitch_Rate_Limited 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2588 <col:43> 'int' 1
|-FieldDecl 0x2ba2648 <line:130:9, col:43> col:13 Roll_Att_Ctrl_Integ_Sat 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2610 <col:43> 'int' 1
|-FieldDecl 0x2ba26d0 <line:131:9, col:43> col:13 Pitch_Att_Ctrl_Integ_Sat 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2698 <col:43> 'int' 1
|-FieldDecl 0x2ba2758 <line:132:9, col:43> col:13 Roll_ADP_Rate_Limit 'U32':'unsigned long'
| `-IntegerLiteral 0x2ba2720 <col:43> 'int' 1
`-FieldDecl 0x2ba27e0 <line:133:9, col:43> col:13 Pitch_ADP_Rate_Limit 'U32':'unsigned long'
  `-IntegerLiteral 0x2ba27a8 <col:43> 'int' 1

Layout: <CGRecordLayout
  LLVMType:%struct.anon.0 = type { i32 }
  IsZeroInitializable:1
  BitFields:[
    <CGBitFieldInfo Offset:0 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:1 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:2 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:3 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:4 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:5 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:6 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:7 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:8 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:9 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:10 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:11 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:12 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:13 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:14 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:15 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:16 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:17 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:18 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:19 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:20 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:21 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:22 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:23 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
    <CGBitFieldInfo Offset:24 Size:1 IsSigned:0 StorageSize:32 StorageOffset:0>
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2ba08f0 <..\..\..\Common\Header\Union_Flags.h:97:9, line:139:1> line:97:9 union definition
|-FullComment 0x2d9b778 <line:92:4, line:96:77>
| |-ParagraphComment 0x2d9b5a0 <line:92:4, line:93:4>
| | |-TextComment 0x2d9b550 <line:92:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d9b570 <line:93:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d9b5c0 <col:5, col:20> Text=" CLAW_Flags"
| |-ParagraphComment 0x2d9b628 <line:94:1, col:4>
| | `-TextComment 0x2d9b600 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d9b648 <col:5, line:96:77> Name="brief"
|   `-ParagraphComment 0x2d9b738 <line:94:11, line:96:77>
|     |-TextComment 0x2d9b670 <line:94:11, col:67> Text=" Union of U32 and bitfields for boolean control law flags"
|     |-TextComment 0x2d9b690 <line:95:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d9b6b0 <col:5, col:15> Name="CommonReqt" RenderNormal
|     |-TextComment 0x2d9b6d0 <col:16, col:33> Text="{HAP1-SDD-Com,xxx}"
|     `-TextComment 0x2d9b6f0 <line:96:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2ba09b0 <line:99:5, col:9> col:9 flags_u32 'U32':'unsigned long'
|-RecordDecl 0x2ba0a00 <line:100:5, line:137:5> line:100:5 struct definition
| |-FieldDecl 0x2ba0ae8 <line:103:9, col:43> col:13 Roll_Rate_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0ab0 <col:43> 'int' 1
| |-FieldDecl 0x2ba0b70 <line:104:9, col:43> col:13 Roll_ADP_Cmd_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0b38 <col:43> 'int' 1
| |-FieldDecl 0x2ba0bf8 <line:105:9, col:43> col:13 Roll_ACT_POS_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0bc0 <col:43> 'int' 1
| |-FieldDecl 0x2ba0c80 <line:106:9, col:43> col:13 Roll_ATT_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0c48 <col:43> 'int' 1
| |-FieldDecl 0x2ba0d08 <line:108:9, col:43> col:13 Pitch_Rate_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0cd0 <col:43> 'int' 1
| |-FieldDecl 0x2ba0d90 <line:109:9, col:43> col:13 Pitch_ADP_Cmd_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0d58 <col:43> 'int' 1
| |-FieldDecl 0x2ba0e18 <line:110:9, col:43> col:13 Pitch_ACT_Pos_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0de0 <col:43> 'int' 1
| |-FieldDecl 0x2ba0ea0 <line:111:9, col:43> col:13 Pitch_ATT_Fail 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0e68 <col:43> 'int' 1
| |-FieldDecl 0x2ba0f28 <line:113:9, col:43> col:13 Roll_Servoloop_CurrSatLL 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0ef0 <col:43> 'int' 1
| |-FieldDecl 0x2ba0fb0 <line:114:9, col:43> col:13 Roll_Servoloop_CurrSatUL 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba0f78 <col:43> 'int' 1
| |-FieldDecl 0x2ba1038 <line:115:9, col:43> col:13 Roll_Servoloop_PLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba1000 <col:43> 'int' 1
| |-FieldDecl 0x2ba10c0 <line:116:9, col:43> col:13 Roll_Servoloop_PLInv 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba1088 <col:43> 'int' 1
| |-FieldDecl 0x2ba1148 <line:117:9, col:43> col:13 Roll_Servoloop_RLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba1110 <col:43> 'int' 1
| |-FieldDecl 0x2ba2208 <line:119:9, col:43> col:13 Pitch_Servoloop_CurrSatLL 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba21d0 <col:43> 'int' 1
| |-FieldDecl 0x2ba2290 <line:120:9, col:43> col:13 Pitch_Servoloop_CurrSatUL 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2258 <col:43> 'int' 1
| |-FieldDecl 0x2ba2318 <line:121:9, col:43> col:13 Pitch_Servoloop_PLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba22e0 <col:43> 'int' 1
| |-FieldDecl 0x2ba23a0 <line:122:9, col:43> col:13 Pitch_Servoloop_PLInv 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2368 <col:43> 'int' 1
| |-FieldDecl 0x2ba2428 <line:123:9, col:43> col:13 Pitch_Servoloop_RLSat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba23f0 <col:43> 'int' 1
| |-FieldDecl 0x2ba24b0 <line:125:9, col:43> col:13 Combined_Fail_Status 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2478 <col:43> 'int' 1
| |-FieldDecl 0x2ba2538 <line:128:9, col:43> col:13 Roll_Rate_Limited 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2500 <col:43> 'int' 1
| |-FieldDecl 0x2ba25c0 <line:129:9, col:43> col:13 Pitch_Rate_Limited 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2588 <col:43> 'int' 1
| |-FieldDecl 0x2ba2648 <line:130:9, col:43> col:13 Roll_Att_Ctrl_Integ_Sat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2610 <col:43> 'int' 1
| |-FieldDecl 0x2ba26d0 <line:131:9, col:43> col:13 Pitch_Att_Ctrl_Integ_Sat 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2698 <col:43> 'int' 1
| |-FieldDecl 0x2ba2758 <line:132:9, col:43> col:13 Roll_ADP_Rate_Limit 'U32':'unsigned long'
| | `-IntegerLiteral 0x2ba2720 <col:43> 'int' 1
| `-FieldDecl 0x2ba27e0 <line:133:9, col:43> col:13 Pitch_ADP_Rate_Limit 'U32':'unsigned long'
|   `-IntegerLiteral 0x2ba27a8 <col:43> 'int' 1
`-FieldDecl 0x2ba2888 <line:100:5, line:137:7> col:7 flags_bf 'struct (anonymous struct at ..\..\..\Common\Header\Union_Flags.h:100:5)':'struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:100:5)'

Layout: <CGRecordLayout
  LLVMType:%union.CLAW_Flags = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2ba3a00 <..\..\..\MCP\Header\Telemetry_Log.h:129:9, line:157:1> line:129:9 struct definition
|-FullComment 0x2d9bac0 <line:122:4, line:128:77>
| |-ParagraphComment 0x2d9b828 <line:122:4, line:123:4>
| | |-TextComment 0x2d9b7d8 <line:122:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d9b7f8 <line:123:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d9b848 <col:5, col:34> Text=" TELEMETRY_LOG_STRUCT"
| |-ParagraphComment 0x2d9b8b0 <line:124:1, col:4>
| | `-TextComment 0x2d9b888 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d9b8d0 <col:5, line:128:77> Name="brief"
|   `-ParagraphComment 0x2d9ba80 <line:124:11, line:128:77>
|     |-TextComment 0x2d9b8f8 <line:124:11, col:76> Text=" Stores flight data to be transmitted via CAN to a remote computer"
|     |-TextComment 0x2d9b918 <line:125:1, col:27> Text="    or data recording unit."
|     |-TextComment 0x2d9b938 <line:126:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d9b978 <col:5, col:12> Name="MCPReqt" RenderNormal
|     |-TextComment 0x2d9b998 <col:13, col:31> Text="{HAP1-SDD-MCP,4184}"
|     |-TextComment 0x2d9b9b8 <line:127:1, col:4> Text="    "
|     |-InlineCommandComment 0x2d9b9d8 <col:5, col:12> Name="MCPReqt" RenderNormal
|     |-TextComment 0x2d9b9f8 <col:13, col:30> Text="{HAP1-SDD-MCP,xxx}"
|     `-TextComment 0x2d9ba18 <line:128:1, col:77> Text="    ======================================================================== "
|-FieldDecl 0x2ba3ac0 <line:131:5, col:29> col:29 eulers 'EULER_ANGLES':'EULER_ANGLES'
|-FieldDecl 0x2ba3b20 <line:132:5, col:29> col:29 euler_rates 'EULER_RATES':'EULER_RATES'
|-FieldDecl 0x2ba3b80 <line:134:5, col:29> col:29 mags 'VECTOR3':'VECTOR3'
|-FieldDecl 0x2ba3be0 <line:135:5, col:29> col:29 rates 'VECTOR3':'VECTOR3'
|-FieldDecl 0x2ba3c40 <line:136:5, col:29> col:29 accels 'VECTOR3':'VECTOR3'
|-FieldDecl 0x2ba3ca0 <line:138:5, col:29> col:29 actuator_positions 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2ba3d00 <line:139:5, col:29> col:29 actuator_commands 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2ba3d60 <line:140:5, col:29> col:29 motor_A_current 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2ba3dc0 <line:141:5, col:29> col:29 motor_B_current 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2ba3e20 <line:142:5, col:29> col:29 actuator_mvc 'CYCLIC_STRUCT':'CYCLIC_STRUCT'
|-FieldDecl 0x2ba3e80 <line:144:5, col:29> col:29 IAS 'F32':'float'
|-FieldDecl 0x2ba3ee0 <line:145:5, col:29> col:29 TAS 'F32':'float'
|-FieldDecl 0x2ba3f40 <line:146:5, col:29> col:29 baro_altitude 'F32':'float'
|-FieldDecl 0x2ba3fa0 <line:148:5, col:29> col:29 oat 'F32':'float'
|-FieldDecl 0x2ba4000 <line:150:5, col:29> col:29 framenumber 'U32':'unsigned long'
|-FieldDecl 0x2ba4060 <line:151:5, col:29> col:29 latest_fault 'U32':'unsigned long'
|-FieldDecl 0x2ba40e0 <line:152:5, col:29> col:29 sys_flags 'System_Flags':'System_Flags'
|-FieldDecl 0x2ba4160 <line:153:5, col:29> col:29 claw_flags 'CLAW_Flags':'CLAW_Flags'
`-FieldDecl 0x2ba5200 <line:155:5, col:29> col:29 button_states 'U8':'unsigned char'

Layout: <CGRecordLayout
  LLVMType:%struct.TELEMETRY_LOG_STRUCT = type { %struct.EULER_ANGLES, %struct.EULER_RATES, %struct.VECTOR3, %struct.VECTOR3, %struct.VECTOR3, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, %struct.CYCLIC_STRUCT, float, float, float, float, i32, i32, %union.System_Flags, %union.CLAW_Flags, i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | INNER_LOOP_MONITORS_COEFF_STRUCT
         0 |   MONITOR_COEFF_STRUCT roll_coeff
         0 |     F32 rate_l_limit
         4 |     F32 rate_u_limit
         8 |     F32 attitude_l_limit
        12 |     F32 attitude_u_limit
        16 |     MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
        16 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        16 |         U32 P
        20 |         BOOLEAN ic
        21 |         BOOLEAN rising_edge
        22 |         BOOLEAN falling_edge
        24 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        24 |         U32 sample_interval
        28 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        28 |         F32 a1
        32 |         F32 b0
        36 |         F32 b1
        40 |         F32 k1
        44 |         F32 k2
        48 |       F32 wof_l_limit
        52 |       F32 wof_u_limit
        56 |     MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
        56 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
        56 |         U32 P
        60 |         BOOLEAN ic
        61 |         BOOLEAN rising_edge
        62 |         BOOLEAN falling_edge
        64 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
        64 |         U32 sample_interval
        68 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
        68 |         F32 a1
        72 |         F32 b0
        76 |         F32 b1
        80 |         F32 k1
        84 |         F32 k2
        88 |       F32 wof_l_limit
        92 |       F32 wof_u_limit
        96 |   MONITOR_COEFF_STRUCT pitch_coeff
        96 |     F32 rate_l_limit
       100 |     F32 rate_u_limit
       104 |     F32 attitude_l_limit
       108 |     F32 attitude_u_limit
       112 |     MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
       112 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       112 |         U32 P
       116 |         BOOLEAN ic
       117 |         BOOLEAN rising_edge
       118 |         BOOLEAN falling_edge
       120 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       120 |         U32 sample_interval
       124 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       124 |         F32 a1
       128 |         F32 b0
       132 |         F32 b1
       136 |         F32 k1
       140 |         F32 k2
       144 |       F32 wof_l_limit
       148 |       F32 wof_u_limit
       152 |     MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
       152 |       PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       152 |         U32 P
       156 |         BOOLEAN ic
       157 |         BOOLEAN rising_edge
       158 |         BOOLEAN falling_edge
       160 |       TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       160 |         U32 sample_interval
       164 |       FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       164 |         F32 a1
       168 |         F32 b0
       172 |         F32 b1
       176 |         F32 k1
       180 |         F32 k2
       184 |       F32 wof_l_limit
       188 |       F32 wof_u_limit
       192 |   F32 lf_l_limit
       196 |   PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
       196 |     U32 P
       200 |     BOOLEAN ic
       201 |     BOOLEAN rising_edge
       202 |     BOOLEAN falling_edge
           | [sizeof=204, align=4]

*** Dumping AST Record Layout
         0 | SCHEDULEDRATELIMITER_COEFF_STRUCT
         0 |   LINTERP_STRUCT upper_linterp
         0 |     U8 n_regions
         4 |     LINTERP_REGION_STRUCT [10] regions
       124 |   LINTERP_STRUCT lower_linterp
       124 |     U8 n_regions
       128 |     LINTERP_REGION_STRUCT [10] regions
           | [sizeof=248, align=4]

*** Dumping AST Record Layout
         0 | MCP_COEFF_STRUCT
         0 |   MCP_CONTROL_PRODUCER_COEFF_STRUCT control_coeff
         0 |     CYCLIC_FEEDBACK_COEFF_STRUCT cyclic_feedback
         0 |       F32 pitch_bias
         4 |       RATE_LIMITER_RIC_COEFF_STRUCT roll_rate_limiter
         4 |         F32 rate_limiter_lower_limit
         8 |         F32 rate_limiter_upper_limit
        12 |       RATE_LIMITER_RIC_COEFF_STRUCT pitch_rate_limiter
        12 |         F32 rate_limiter_lower_limit
        16 |         F32 rate_limiter_upper_limit
        20 |       ATTITUDE_CONTROLLER_COEFF_STRUCT Roll_AttitudeController
        20 |         F32 c_reintichs_IC
        24 |         F32 c_gamma
        28 |         F32 null_attitude
        32 |         F32 upper_sat_limit
        36 |         F32 lower_sat_limit
        40 |         F32 k_rate_to_ang_accel_cross
        44 |         F32 k_rate_to_ang_accel_uar
        48 |         F32 k_rate_to_ang_accel_normal
        52 |         F32 k_attitude_to_ang_accel_uar
        56 |         F32 k_attitude_to_ang_accel_normal
        60 |         F32 k_attitude_to_ang_accel_integral_normal
        64 |         F32 k_compensation
        68 |         F32 k_ang_accel_to_cyclic
        72 |         F32 k_integrator_curve_magnitude
        76 |         SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
        76 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
        76 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        76 |               U32 P
        80 |               BOOLEAN ic
        81 |               BOOLEAN rising_edge
        82 |               BOOLEAN falling_edge
        84 |           REINTICH_COEFF_STRUCT first_integrator_coeff
        84 |             F32 K_Ts
        88 |           REINTICH_COEFF_STRUCT second_integrator_coeff
        88 |             F32 K_Ts
        92 |         SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
        92 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
        92 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
        92 |               U32 P
        96 |               BOOLEAN ic
        97 |               BOOLEAN rising_edge
        98 |               BOOLEAN falling_edge
       100 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       100 |             F32 K_Ts
       104 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       104 |             F32 K_Ts
       108 |         REINTICH_COEFF_STRUCT reintich
       108 |           F32 K_Ts
       112 |         REINTICHS_COEFF_STRUCT reintichs
       112 |           F32 K_Ts
       116 |           F32 UL
       120 |           F32 LL
       124 |           F32 rail_bounce_divisor
       128 |           REINTICH_COEFF_STRUCT integrator_coeff
       128 |             F32 K_Ts
       132 |           SATURATIONVF_COEFF_STRUCT sat_coeff
       132 |             F32 epsilon
       136 |             F32 upper_sat_limit
       140 |             F32 lower_sat_limit
       144 |         SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       144 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       144 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       144 |               U32 P
       148 |               BOOLEAN ic
       149 |               BOOLEAN rising_edge
       150 |               BOOLEAN falling_edge
       152 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       152 |             F32 K_Ts
       156 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       156 |             F32 K_Ts
       160 |       ATTITUDE_CONTROLLER_COEFF_STRUCT Pitch_AttitudeController
       160 |         F32 c_reintichs_IC
       164 |         F32 c_gamma
       168 |         F32 null_attitude
       172 |         F32 upper_sat_limit
       176 |         F32 lower_sat_limit
       180 |         F32 k_rate_to_ang_accel_cross
       184 |         F32 k_rate_to_ang_accel_uar
       188 |         F32 k_rate_to_ang_accel_normal
       192 |         F32 k_attitude_to_ang_accel_uar
       196 |         F32 k_attitude_to_ang_accel_normal
       200 |         F32 k_attitude_to_ang_accel_integral_normal
       204 |         F32 k_compensation
       208 |         F32 k_ang_accel_to_cyclic
       212 |         F32 k_integrator_curve_magnitude
       216 |         SWITCH_SECOND_ORDER_COEFF_STRUCT rate_switch
       216 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       216 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       216 |               U32 P
       220 |               BOOLEAN ic
       221 |               BOOLEAN rising_edge
       222 |               BOOLEAN falling_edge
       224 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       224 |             F32 K_Ts
       228 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       228 |             F32 K_Ts
       232 |         SWITCH_SECOND_ORDER_COEFF_STRUCT attitude_switch
       232 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       232 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       232 |               U32 P
       236 |               BOOLEAN ic
       237 |               BOOLEAN rising_edge
       238 |               BOOLEAN falling_edge
       240 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       240 |             F32 K_Ts
       244 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       244 |             F32 K_Ts
       248 |         REINTICH_COEFF_STRUCT reintich
       248 |           F32 K_Ts
       252 |         REINTICHS_COEFF_STRUCT reintichs
       252 |           F32 K_Ts
       256 |           F32 UL
       260 |           F32 LL
       264 |           F32 rail_bounce_divisor
       268 |           REINTICH_COEFF_STRUCT integrator_coeff
       268 |             F32 K_Ts
       272 |           SATURATIONVF_COEFF_STRUCT sat_coeff
       272 |             F32 epsilon
       276 |             F32 upper_sat_limit
       280 |             F32 lower_sat_limit
       284 |         SWITCH_SECOND_ORDER_COEFF_STRUCT adp_cmd_switch_coeff
       284 |           SWITCH_COMMON_COEFF_STRUCT common_coeff
       284 |             PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       284 |               U32 P
       288 |               BOOLEAN ic
       289 |               BOOLEAN rising_edge
       290 |               BOOLEAN falling_edge
       292 |           REINTICH_COEFF_STRUCT first_integrator_coeff
       292 |             F32 K_Ts
       296 |           REINTICH_COEFF_STRUCT second_integrator_coeff
       296 |             F32 K_Ts
       300 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_roll_cmd_switch
       300 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       300 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       300 |             U32 P
       304 |             BOOLEAN ic
       305 |             BOOLEAN rising_edge
       306 |             BOOLEAN falling_edge
       308 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       308 |           F32 K_Ts
       312 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       312 |           F32 K_Ts
       316 |       SWITCH_SECOND_ORDER_COEFF_STRUCT adp_pitch_cmd_switch
       316 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       316 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       316 |             U32 P
       320 |             BOOLEAN ic
       321 |             BOOLEAN rising_edge
       322 |             BOOLEAN falling_edge
       324 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       324 |           F32 K_Ts
       328 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       328 |           F32 K_Ts
       332 |       TEST_PORT_COEFF_STRUCT roll_testport
       332 |         F32 gain
       336 |         F32 bias
       340 |       TEST_PORT_COEFF_STRUCT pitch_testport
       340 |         F32 gain
       344 |         F32 bias
       348 |       F32 K_heading_rate_to_ang_accel_uar
       352 |       SWITCH_SECOND_ORDER_COEFF_STRUCT heading_rate_switch
       352 |         SWITCH_COMMON_COEFF_STRUCT common_coeff
       352 |           PERSISTENT1SHOT_COEFF_STRUCT transition_one_shot_coeff
       352 |             U32 P
       356 |             BOOLEAN ic
       357 |             BOOLEAN rising_edge
       358 |             BOOLEAN falling_edge
       360 |         REINTICH_COEFF_STRUCT first_integrator_coeff
       360 |           F32 K_Ts
       364 |         REINTICH_COEFF_STRUCT second_integrator_coeff
       364 |           F32 K_Ts
       368 |       LINTERP_STRUCT pitch_bias_linterp
       368 |         U8 n_regions
       372 |         LINTERP_REGION_STRUCT [10] regions
       492 |     UARMODELOGIC_COEFF_STRUCT uar_mode_logic
       492 |       F32 phi_upper_limit
       496 |       F32 phi_lower_limit
       500 |       F32 theta_upper_limit
       504 |       F32 theta_lower_limit
       508 |       F32 p_filt_upper_limit
       512 |       F32 p_filt_lower_limit
       516 |       F32 q_filt_upper_limit
       520 |       F32 q_filt_lower_limit
       524 |       PERSISTENT1SHOT_COEFF_STRUCT run_p1shot
       524 |         U32 P
       528 |         BOOLEAN ic
       529 |         BOOLEAN rising_edge
       530 |         BOOLEAN falling_edge
       532 |       PERSISTENT1SHOT_COEFF_STRUCT uar_hold_p1shot
       532 |         U32 P
       536 |         BOOLEAN ic
       537 |         BOOLEAN rising_edge
       538 |         BOOLEAN falling_edge
       540 |   INNER_LOOP_MONITORS_COEFF_STRUCT monitors_coeff
       540 |     MONITOR_COEFF_STRUCT roll_coeff
       540 |       F32 rate_l_limit
       544 |       F32 rate_u_limit
       548 |       F32 attitude_l_limit
       552 |       F32 attitude_u_limit
       556 |       MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
       556 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       556 |           U32 P
       560 |           BOOLEAN ic
       561 |           BOOLEAN rising_edge
       562 |           BOOLEAN falling_edge
       564 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       564 |           U32 sample_interval
       568 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       568 |           F32 a1
       572 |           F32 b0
       576 |           F32 b1
       580 |           F32 k1
       584 |           F32 k2
       588 |         F32 wof_l_limit
       592 |         F32 wof_u_limit
       596 |       MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
       596 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       596 |           U32 P
       600 |           BOOLEAN ic
       601 |           BOOLEAN rising_edge
       602 |           BOOLEAN falling_edge
       604 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       604 |           U32 sample_interval
       608 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       608 |           F32 a1
       612 |           F32 b0
       616 |           F32 b1
       620 |           F32 k1
       624 |           F32 k2
       628 |         F32 wof_l_limit
       632 |         F32 wof_u_limit
       636 |     MONITOR_COEFF_STRUCT pitch_coeff
       636 |       F32 rate_l_limit
       640 |       F32 rate_u_limit
       644 |       F32 attitude_l_limit
       648 |       F32 attitude_u_limit
       652 |       MONITOR_COMMAND_COEFF_STRUCT adp_cmd_coeff
       652 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       652 |           U32 P
       656 |           BOOLEAN ic
       657 |           BOOLEAN rising_edge
       658 |           BOOLEAN falling_edge
       660 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       660 |           U32 sample_interval
       664 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       664 |           F32 a1
       668 |           F32 b0
       672 |           F32 b1
       676 |           F32 k1
       680 |           F32 k2
       684 |         F32 wof_l_limit
       688 |         F32 wof_u_limit
       692 |       MONITOR_COMMAND_COEFF_STRUCT act_pos_coeff
       692 |         PERSISTENT1SHOT_COEFF_STRUCT p1shot_coeff
       692 |           U32 P
       696 |           BOOLEAN ic
       697 |           BOOLEAN rising_edge
       698 |           BOOLEAN falling_edge
       700 |         TENTH_ORDER_AVERAGE_COEFF_STRUCT toa_coeff
       700 |           U32 sample_interval
       704 |         FIRSTORDERFILTER_COEFF_STRUCT wash_out_coeff
       704 |           F32 a1
       708 |           F32 b0
       712 |           F32 b1
       716 |           F32 k1
       720 |           F32 k2
       724 |         F32 wof_l_limit
       728 |         F32 wof_u_limit
       732 |     F32 lf_l_limit
       736 |     PERSISTENT1SHOT_COEFF_STRUCT pos_coeff
       736 |       U32 P
       740 |       BOOLEAN ic
       741 |       BOOLEAN rising_edge
       742 |       BOOLEAN falling_edge
       744 |   SCHEDULEDRATELIMITER_COEFF_STRUCT roll_scheduledRL_coeff
       744 |     LINTERP_STRUCT upper_linterp
       744 |       U8 n_regions
       748 |       LINTERP_REGION_STRUCT [10] regions
       868 |     LINTERP_STRUCT lower_linterp
       868 |       U8 n_regions
       872 |       LINTERP_REGION_STRUCT [10] regions
       992 |   SCHEDULEDRATELIMITER_COEFF_STRUCT pitch_scheduledRL_coeff
       992 |     LINTERP_STRUCT upper_linterp
       992 |       U8 n_regions
       996 |       LINTERP_REGION_STRUCT [10] regions
      1116 |     LINTERP_STRUCT lower_linterp
      1116 |       U8 n_regions
      1120 |       LINTERP_REGION_STRUCT [10] regions
      1240 |   TEST_PORT_COEFF_STRUCT roll_servo_testport
      1240 |     F32 gain
      1244 |     F32 bias
      1248 |   TEST_PORT_COEFF_STRUCT pitch_servo_testport
      1248 |     F32 gain
      1252 |     F32 bias
      1256 |   TEST_PORT_COEFF_STRUCT roll_cyclic_testport_coeff
      1256 |     F32 gain
      1260 |     F32 bias
      1264 |   TEST_PORT_COEFF_STRUCT pitch_cyclic_testport_coeff
      1264 |     F32 gain
      1268 |     F32 bias
      1272 |   F32 sin_wave_frequency
      1276 |   F32 sin_wave_amplitude
           | [sizeof=1280, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x2bbda48 <..\..\..\Model\Common\Header\RateLimiterRIC.h:54:9, line:59:1> line:54:9 struct definition
|-FullComment 0x2d9bf10 <line:49:4, line:53:76>
| |-ParagraphComment 0x2d9bd10 <line:49:4, line:50:4>
| | |-TextComment 0x2d9bcc0 <line:49:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2d9bce0 <line:50:1, col:4> Text="    "
| |-VerbatimLineComment 0x2d9bd30 <col:5, col:43> Text=" RATE_LIMITER_RIC_COEFF_STRUCT"
| |-ParagraphComment 0x2d9bd98 <line:51:1, col:4>
| | `-TextComment 0x2d9bd70 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2d9bdb8 <col:5, line:53:76> Name="brief"
|   `-ParagraphComment 0x2d9bed0 <line:51:11, line:53:76>
|     |-TextComment 0x2d9bde0 <line:51:11, col:49> Text=" Coefficients struct for RateLimiterRIC"
|     |-TextComment 0x2d9be00 <line:52:1, col:4> Text="    "
