
*** Dumping AST Record Layout
         0 | VECTOR3
         0 |   F32 X
         4 |   F32 Y
         8 |   F32 Z
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | SENSOR_ADC_SAMPLE_STRUCT
         0 |   S16 X
         2 |   S16 Y
         4 |   S16 Z
           | [sizeof=6, align=2]

*** Dumping AST Record Layout
         0 | PIN_PERIPH_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   U32 pin_config
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PIN_ADC_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
         8 |   SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | PERSISTENT1SHOT_COEFF_STRUCT
         0 |   U32 P
         4 |   BOOLEAN ic
         5 |   BOOLEAN rising_edge
         6 |   BOOLEAN falling_edge
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | MOMENTARY_SWITCH_COEFF_STRUCT
         0 |   U32 debounce_threshold
         4 |   U32 sustain_threshold
         8 |   PERSISTENT1SHOT_COEFF_STRUCT switch_opened_one_shot_coeff
         8 |     U32 P
        12 |     BOOLEAN ic
        13 |     BOOLEAN rising_edge
        14 |     BOOLEAN falling_edge
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | PIN_GPIO_HW_STRUCT
         0 |   U32 port
         4 |   U8 pin
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:125:5)
         0 |   PIN_GPIO_HW_STRUCT pwr_path_test
         0 |     U32 port
         4 |     U8 pin
         8 |   PIN_GPIO_HW_STRUCT brake_pwr_test
         8 |     U32 port
        12 |     U8 pin
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct (anonymous at ..\..\..\Common\Header\Target.h:169:5)
         0 |   int diag_1
         4 |   int diag_2
         8 |   int diag_3
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:178:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:187:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_external
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:196:5)
         0 |   PIN_ADC_HW_STRUCT pwr_15V
         0 |     U32 port
         4 |     U8 pin
         8 |     SIGNALS_ADC_CHANNEL_ENUM channel
        12 |   PIN_ADC_HW_STRUCT pwr_3V3
        12 |     U32 port
        16 |     U8 pin
        20 |     SIGNALS_ADC_CHANNEL_ENUM channel
        24 |   PIN_ADC_HW_STRUCT pwr_brakes
        24 |     U32 port
        28 |     U8 pin
        32 |     SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | TARGET_VOLTAGE_MONITORS_HW_UNION
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:169:5) schematic
         0 |     int diag_1
         4 |     int diag_2
         8 |     int diag_3
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:178:5) MCPA
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:187:5) MCPB
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_external
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
         0 |   struct TARGET_VOLTAGE_MONITORS_HW_UNION::(anonymous at ..\..\..\Common\Header\Target.h:196:5) MCPC
         0 |     PIN_ADC_HW_STRUCT pwr_15V
         0 |       U32 port
         4 |       U8 pin
         8 |       SIGNALS_ADC_CHANNEL_ENUM channel
        12 |     PIN_ADC_HW_STRUCT pwr_3V3
        12 |       U32 port
        16 |       U8 pin
        20 |       SIGNALS_ADC_CHANNEL_ENUM channel
        24 |     PIN_ADC_HW_STRUCT pwr_brakes
        24 |       U32 port
        28 |       U8 pin
        32 |       SIGNALS_ADC_CHANNEL_ENUM channel
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | PACKET_TYPE_STRUCT
         0 |   ADP2MCP_PACKET_TYPE packet_type
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | EULER_ANGLES
         0 |   F32 phi
         4 |   F32 theta
         8 |   F32 psi
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | EULER_RATES
         0 |   F32 phi_dot
         4 |   F32 theta_dot
         8 |   F32 psi_dot
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | CYCLIC_STRUCT
         0 |   F32 roll
         4 |   F32 pitch
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5)
     0:0-0 |   U32 mag_valid
     0:1-1 |   U32 accel_valid
     0:2-2 |   U32 gyro_valid
     0:3-3 |   U32 oat_valid
     0:4-4 |   U32 adc0_valid
     0:5-5 |   U32 adc1_valid
     0:6-6 |   U32 remote_accel_valid
     0:7-7 |   U32 static_pressure0_valid
     1:0-0 |   U32 static_pressure1_valid
     1:1-1 |   U32 differential_pressure0_valid
     1:2-2 |   U32 differential_pressure1_valid
     1:3-3 |   U32 ADAHRS_valid
     1:4-4 |   U32 UAR_Mode
     1:5-5 |   U32 Pilot_Override
     1:6-6 |   U32 Autopilot_Engaged
     1:7-7 |   U32 Autopilot_Ready
     2:0-0 |   U32 CPD_Input
     2:1-1 |   U32 Video_Sync_Light_Output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | System_Flags
         0 |   U32 flags_u32
         0 |   struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5) flags_bf
     0:0-0 |     U32 mag_valid
     0:1-1 |     U32 accel_valid
     0:2-2 |     U32 gyro_valid
     0:3-3 |     U32 oat_valid
     0:4-4 |     U32 adc0_valid
     0:5-5 |     U32 adc1_valid
     0:6-6 |     U32 remote_accel_valid
     0:7-7 |     U32 static_pressure0_valid
     1:0-0 |     U32 static_pressure1_valid
     1:1-1 |     U32 differential_pressure0_valid
     1:2-2 |     U32 differential_pressure1_valid
     1:3-3 |     U32 ADAHRS_valid
     1:4-4 |     U32 UAR_Mode
     1:5-5 |     U32 Pilot_Override
     1:6-6 |     U32 Autopilot_Engaged
     1:7-7 |     U32 Autopilot_Ready
     2:0-0 |     U32 CPD_Input
     2:1-1 |     U32 Video_Sync_Light_Output
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:106:5)
     0:0-0 |   U32 Roll_Rate_Fail
     0:1-1 |   U32 Roll_ADP_Cmd_Fail
     0:2-2 |   U32 Roll_ACT_POS_Fail
     0:3-3 |   U32 Roll_ATT_Fail
     0:4-4 |   U32 Pitch_Rate_Fail
     0:5-5 |   U32 Pitch_ADP_Cmd_Fail
     0:6-6 |   U32 Pitch_ACT_Pos_Fail
     0:7-7 |   U32 Pitch_ATT_Fail
     1:0-0 |   U32 Roll_Servoloop_CurrSatLL
     1:1-1 |   U32 Roll_Servoloop_CurrSatUL
     1:2-2 |   U32 Roll_Servoloop_PLSat
     1:3-3 |   U32 Roll_Servoloop_PLInv
     1:4-4 |   U32 Roll_Servoloop_RLSat
     1:5-5 |   U32 Pitch_Servoloop_CurrSatLL
     1:6-6 |   U32 Pitch_Servoloop_CurrSatUL
     1:7-7 |   U32 Pitch_Servoloop_PLSat
     2:0-0 |   U32 Pitch_Servoloop_PLInv
     2:1-1 |   U32 Pitch_Servoloop_RLSat
     2:2-2 |   U32 Combined_Fail_Status
     2:3-3 |   U32 Roll_Rate_Limited
     2:4-4 |   U32 Pitch_Rate_Limited
     2:5-5 |   U32 Roll_Att_Ctrl_Integ_Sat
     2:6-6 |   U32 Pitch_Att_Ctrl_Integ_Sat
     2:7-7 |   U32 Roll_ADP_Rate_Limit
     3:0-0 |   U32 Pitch_ADP_Rate_Upper_Limit
     3:1-1 |   U32 Pitch_ADP_Rate_Lower_Limit
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | CLAW_Flags
         0 |   U32 flags_u32
         0 |   struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:106:5) flags_bf
     0:0-0 |     U32 Roll_Rate_Fail
     0:1-1 |     U32 Roll_ADP_Cmd_Fail
     0:2-2 |     U32 Roll_ACT_POS_Fail
     0:3-3 |     U32 Roll_ATT_Fail
     0:4-4 |     U32 Pitch_Rate_Fail
     0:5-5 |     U32 Pitch_ADP_Cmd_Fail
     0:6-6 |     U32 Pitch_ACT_Pos_Fail
     0:7-7 |     U32 Pitch_ATT_Fail
     1:0-0 |     U32 Roll_Servoloop_CurrSatLL
     1:1-1 |     U32 Roll_Servoloop_CurrSatUL
     1:2-2 |     U32 Roll_Servoloop_PLSat
     1:3-3 |     U32 Roll_Servoloop_PLInv
     1:4-4 |     U32 Roll_Servoloop_RLSat
     1:5-5 |     U32 Pitch_Servoloop_CurrSatLL
     1:6-6 |     U32 Pitch_Servoloop_CurrSatUL
     1:7-7 |     U32 Pitch_Servoloop_PLSat
     2:0-0 |     U32 Pitch_Servoloop_PLInv
     2:1-1 |     U32 Pitch_Servoloop_RLSat
     2:2-2 |     U32 Combined_Fail_Status
     2:3-3 |     U32 Roll_Rate_Limited
     2:4-4 |     U32 Pitch_Rate_Limited
     2:5-5 |     U32 Roll_Att_Ctrl_Integ_Sat
     2:6-6 |     U32 Pitch_Att_Ctrl_Integ_Sat
     2:7-7 |     U32 Roll_ADP_Rate_Limit
     3:0-0 |     U32 Pitch_ADP_Rate_Upper_Limit
     3:1-1 |     U32 Pitch_ADP_Rate_Lower_Limit
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | TELEMETRY_LOG_STRUCT
         0 |   EULER_ANGLES eulers
         0 |     F32 phi
         4 |     F32 theta
         8 |     F32 psi
        12 |   EULER_RATES euler_rates
        12 |     F32 phi_dot
        16 |     F32 theta_dot
        20 |     F32 psi_dot
        24 |   VECTOR3 rates
        24 |     F32 X
        28 |     F32 Y
        32 |     F32 Z
        36 |   VECTOR3 accels
        36 |     F32 X
        40 |     F32 Y
        44 |     F32 Z
        48 |   CYCLIC_STRUCT actuator_positions
        48 |     F32 roll
        52 |     F32 pitch
        56 |   CYCLIC_STRUCT actuator_commands
        56 |     F32 roll
        60 |     F32 pitch
        64 |   CYCLIC_STRUCT motor_A_current
        64 |     F32 roll
        68 |     F32 pitch
        72 |   CYCLIC_STRUCT motor_B_current
        72 |     F32 roll
        76 |     F32 pitch
        80 |   CYCLIC_STRUCT actuator_mvc
        80 |     F32 roll
        84 |     F32 pitch
        88 |   F32 TAS
        92 |   F32 oat
        96 |   F32 IAS
       100 |   F32 baro_altitude
       104 |   U32 framenumber
       108 |   U32 latest_fault
       112 |   System_Flags sys_flags
       112 |     U32 flags_u32
       112 |     struct System_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:63:5) flags_bf
   112:0-0 |       U32 mag_valid
   112:1-1 |       U32 accel_valid
   112:2-2 |       U32 gyro_valid
   112:3-3 |       U32 oat_valid
   112:4-4 |       U32 adc0_valid
   112:5-5 |       U32 adc1_valid
   112:6-6 |       U32 remote_accel_valid
   112:7-7 |       U32 static_pressure0_valid
   113:0-0 |       U32 static_pressure1_valid
   113:1-1 |       U32 differential_pressure0_valid
   113:2-2 |       U32 differential_pressure1_valid
   113:3-3 |       U32 ADAHRS_valid
   113:4-4 |       U32 UAR_Mode
   113:5-5 |       U32 Pilot_Override
   113:6-6 |       U32 Autopilot_Engaged
   113:7-7 |       U32 Autopilot_Ready
   114:0-0 |       U32 CPD_Input
   114:1-1 |       U32 Video_Sync_Light_Output
       116 |   CLAW_Flags claw_flags
       116 |     U32 flags_u32
       116 |     struct CLAW_Flags::(anonymous at ..\..\..\Common\Header\Union_Flags.h:106:5) flags_bf
   116:0-0 |       U32 Roll_Rate_Fail
   116:1-1 |       U32 Roll_ADP_Cmd_Fail
   116:2-2 |       U32 Roll_ACT_POS_Fail
   116:3-3 |       U32 Roll_ATT_Fail
   116:4-4 |       U32 Pitch_Rate_Fail
   116:5-5 |       U32 Pitch_ADP_Cmd_Fail
   116:6-6 |       U32 Pitch_ACT_Pos_Fail
   116:7-7 |       U32 Pitch_ATT_Fail
   117:0-0 |       U32 Roll_Servoloop_CurrSatLL
   117:1-1 |       U32 Roll_Servoloop_CurrSatUL
   117:2-2 |       U32 Roll_Servoloop_PLSat
   117:3-3 |       U32 Roll_Servoloop_PLInv
   117:4-4 |       U32 Roll_Servoloop_RLSat
   117:5-5 |       U32 Pitch_Servoloop_CurrSatLL
   117:6-6 |       U32 Pitch_Servoloop_CurrSatUL
   117:7-7 |       U32 Pitch_Servoloop_PLSat
   118:0-0 |       U32 Pitch_Servoloop_PLInv
   118:1-1 |       U32 Pitch_Servoloop_RLSat
   118:2-2 |       U32 Combined_Fail_Status
   118:3-3 |       U32 Roll_Rate_Limited
   118:4-4 |       U32 Pitch_Rate_Limited
   118:5-5 |       U32 Roll_Att_Ctrl_Integ_Sat
   118:6-6 |       U32 Pitch_Att_Ctrl_Integ_Sat
   118:7-7 |       U32 Roll_ADP_Rate_Limit
   119:0-0 |       U32 Pitch_ADP_Rate_Upper_Limit
   119:1-1 |       U32 Pitch_ADP_Rate_Lower_Limit
       120 |   U8 button_states
           | [sizeof=124, align=4]

*** Dumping IRgen Record Layout
Record: RecordDecl 0x26e2b10 <..\..\..\Common\Header/HeliTrak_Types.h:227:9, line:232:1> line:227:9 struct definition
|-FullComment 0x2bc3da0 <line:222:4, line:226:76>
| |-ParagraphComment 0x2bc3ba0 <line:222:4, line:223:4>
| | |-TextComment 0x2bc3b50 <line:222:4, col:76> Text=" ========================================================================"
| | `-TextComment 0x2bc3b70 <line:223:1, col:4> Text="    "
| |-VerbatimLineComment 0x2bc3bc0 <col:5, col:26> Text=" EULER_ANGLES"
| |-ParagraphComment 0x2bc3c28 <line:224:1, col:4>
| | `-TextComment 0x2bc3c00 <col:1, col:4> Text="    "
| `-BlockCommandComment 0x2bc3c48 <col:5, line:226:76> Name="brief"
|   `-ParagraphComment 0x2bc3d60 <line:224:11, line:226:76>
|     |-TextComment 0x2bc3c70 <line:224:11, col:55> Text=" Structure which holds the three euler angles"
|     |-TextComment 0x2bc3c90 <line:225:1, col:4> Text="    "
