top: 0  VECTOR3
  0000 .X : F32
  0004 .Y : F32
  0008 .Z : F32
got attribs: [sizeof=12, align=4]

top: 0 Z SENSOR_ADC_SAMPLE_STRUCT
  0000 .X : S16
  0002 .Y : S16
  0004 .Z : S16
got attribs: [sizeof=6, align=2]

top: 0 Z PIN_PERIPH_HW_STRUCT
  0000 .port : U32
  0004 .pin : U8
  0008 .pin_config : U32
got attribs: [sizeof=12, align=4]

top: 0 pin_config PIN_ADC_HW_STRUCT
  0000 .port : U32
  0004 .pin : U8
got attribs: [sizeof=12, align=4]

top: 0 channel PERSISTENT1SHOT_COEFF_STRUCT
  0000 .P : U32
  0004 .ic : BOOLEAN
  0005 .rising_edge : BOOLEAN
  0006 .falling_edge : BOOLEAN
got attribs: [sizeof=8, align=4]

top: 0 falling_edge MOMENTARY_SWITCH_COEFF_STRUCT
  0000 .debounce_threshold : U32
  0004 .sustain_threshold : U32
  0008 switch_opened_one_shot_coeff.P : U32
  0012 switch_opened_one_shot_coeff.ic : BOOLEAN
  0013 switch_opened_one_shot_coeff.rising_edge : BOOLEAN
  0014 switch_opened_one_shot_coeff.falling_edge : BOOLEAN
got attribs: [sizeof=16, align=4]

top: 0 falling_edge PIN_GPIO_HW_STRUCT
  0000 .port : U32
  0004 .pin : U8
got attribs: [sizeof=8, align=4]

  0000 pwr_path_test.port : U32
  0004 pwr_path_test.pin : U8
  0008 brake_pwr_test.port : U32
  0012 brake_pwr_test.pin : U8
got attribs: [sizeof=16, align=4]

top: 0 pin diag_1
top: 4 pin diag_1
top: 8 pin diag_1
got attribs: [sizeof=12, align=4]

  0000 pwr_15V.port : U32
  0004 pwr_15V.pin : U8
  0012 pwr_15V.port : U32
  0016 pwr_15V.pin : U8
  0024 pwr_15V.port : U32
  0028 pwr_15V.pin : U8
got attribs: [sizeof=36, align=4]

  0000 pwr_15V.pwr_15V.port : U32
  0004 pwr_15V.pwr_15V.pin : U8
  0012 pwr_15V.pwr_15V.port : U32
  0016 pwr_15V.pwr_15V.pin : U8
  0024 pwr_15V.pwr_15V.port : U32
  0028 pwr_15V.pwr_15V.pin : U8
got attribs: [sizeof=36, align=4]

  0000 pwr_15V.pwr_15V.pwr_15V.port : U32
  0004 pwr_15V.pwr_15V.pwr_15V.pin : U8
  0012 pwr_15V.pwr_15V.pwr_15V.port : U32
  0016 pwr_15V.pwr_15V.pwr_15V.pin : U8
  0024 pwr_15V.pwr_15V.pwr_15V.port : U32
  0028 pwr_15V.pwr_15V.pwr_15V.pin : U8
got attribs: [sizeof=36, align=4]

top: 0 channel TARGET_VOLTAGE_MONITORS_HW_UNION
top: 0 channel TARGET_VOLTAGE_MONITORS_HW_UNION
top: 4 channel TARGET_VOLTAGE_MONITORS_HW_UNION
top: 8 channel TARGET_VOLTAGE_MONITORS_HW_UNION
top: 5 channel TARGET_VOLTAGE_MONITORS_HW_UNION
  0000 pwr_15V.port : U32
  0004 pwr_15V.pin : U8
  0012 pwr_15V.port : U32
  0016 pwr_15V.pin : U8
  0024 pwr_15V.port : U32
  0028 pwr_15V.pin : U8
top: 5 channel TARGET_VOLTAGE_MONITORS_HW_UNION
  0000 .port : U32
  0004 .pin : U8
  0012 .port : U32
  0016 .pin : U8
  0024 .port : U32
  0028 .pin : U8
top: 5 channel TARGET_VOLTAGE_MONITORS_HW_UNION
  0000 .port : U32
  0004 .pin : U8
  0012 .port : U32
  0016 .pin : U8
  0024 .port : U32
  0028 .pin : U8
got attribs: [sizeof=36, align=4]

top: 0 channel PACKET_TYPE_STRUCT
got attribs: [sizeof=4, align=4]

top: 0 packet_type PERSISTENT1SHOT_STATE_STRUCT
  0000 .init : BOOLEAN
  0004 .iteration : U32
  0008 .prev_input : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 prev_input PERSISTENT1SHOT_INPUT_STRUCT
  0000 .input : BOOLEAN
  0001 .reset : BOOLEAN
got attribs: [sizeof=2, align=1]

top: 0 reset PERSISTENT1SHOT_OUTPUT_STRUCT
  0000 .output : BOOLEAN
got attribs: [sizeof=1, align=1]

top: 0 output PERSISTENT1SHOT_STRUCT
  0008 state.init : BOOLEAN
  0012 state.iteration : U32
  0016 state.prev_input : BOOLEAN
  0020 input.input : BOOLEAN
  0021 input.reset : BOOLEAN
  0022 output.output : BOOLEAN
got attribs: [sizeof=24, align=8]

top: 0 output SWITCH_COMMON_COEFF_STRUCT
  0000 .P : U32
  0004 .ic : BOOLEAN
  0005 .rising_edge : BOOLEAN
  0006 .falling_edge : BOOLEAN
got attribs: [sizeof=8, align=4]

top: 0 falling_edge SWITCH_COMMON_STATE_STRUCT
  0008 state.init : BOOLEAN
  0012 state.iteration : U32
  0016 state.prev_input : BOOLEAN
  0020 input.input : BOOLEAN
  0021 input.reset : BOOLEAN
  0022 output.output : BOOLEAN
  0024 output.output_previous : F32
  0028 output.transition_deviation_latched : F32
  0032 output.selected_input : F32
got attribs: [sizeof=40, align=8]

top: 0 selected_input SWITCH_COMMON_STRUCT
  0016 state.transition_one_shot.state.init : BOOLEAN
  0020 state.transition_one_shot.state.iteration : U32
  0024 state.transition_one_shot.state.prev_input : BOOLEAN
  0028 state.transition_one_shot.input.input : BOOLEAN
  0029 state.transition_one_shot.input.reset : BOOLEAN
  0030 state.transition_one_shot.output.output : BOOLEAN
  0032 state.transition_one_shot.output.output_previous : F32
  0036 state.transition_one_shot.output.transition_deviation_latched : F32
  0040 state.transition_one_shot.output.selected_input : F32
got attribs: [sizeof=48, align=8]

top: 0 selected_input LINTERP_REGION_STRUCT
  0000 .breakpoint : F32
  0004 .value : F32
  0008 .slope : F32
got attribs: [sizeof=12, align=4]

top: 0 slope REINTICH_STATE_STRUCT
  0000 .delay : F32
  0004 .reset_on_init : BOOLEAN
got attribs: [sizeof=8, align=4]

top: 0 reset_on_init REINTICH_INPUT_STRUCT
  0000 .IC : F32
  0004 .input : F32
  0008 .run : BOOLEAN
  0009 .hold : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 hold REINTICH_OUTPUT_STRUCT
  0000 .output : F32
got attribs: [sizeof=4, align=4]

top: 0 output REINTICH_STRUCT
  0008 state.delay : F32
  0012 state.reset_on_init : BOOLEAN
  0016 input.IC : F32
  0020 input.input : F32
  0024 input.run : BOOLEAN
  0025 input.hold : BOOLEAN
  0028 output.output : F32
got attribs: [sizeof=32, align=8]

top: 0 output SWITCH_SECOND_ORDER_STATE_STRUCT
  0016 state.transition_one_shot.state.init : BOOLEAN
  0020 state.transition_one_shot.state.iteration : U32
  0024 state.transition_one_shot.state.prev_input : BOOLEAN
  0028 state.transition_one_shot.input.input : BOOLEAN
  0029 state.transition_one_shot.input.reset : BOOLEAN
  0030 state.transition_one_shot.output.output : BOOLEAN
  0032 state.transition_one_shot.output.output_previous : F32
  0036 state.transition_one_shot.output.transition_deviation_latched : F32
  0040 state.transition_one_shot.output.selected_input : F32
  0056 state.first_integrator.state.delay : F32
  0060 state.first_integrator.state.reset_on_init : BOOLEAN
  0064 state.first_integrator.input.IC : F32
  0068 state.first_integrator.input.input : F32
  0072 state.first_integrator.input.run : BOOLEAN
  0073 state.first_integrator.input.hold : BOOLEAN
  0076 state.first_integrator.output.output : F32
  0088 state.second_integrator.state.delay : F32
  0092 state.second_integrator.state.reset_on_init : BOOLEAN
  0096 state.second_integrator.input.IC : F32
  0100 state.second_integrator.input.input : F32
  0104 state.second_integrator.input.run : BOOLEAN
  0105 state.second_integrator.input.hold : BOOLEAN
  0108 state.second_integrator.output.output : F32
  0112 state.second_integrator.output.first_feedback_delay : F32
  0116 state.second_integrator.output.second_feedback_delay : F32
got attribs: [sizeof=120, align=8]

top: 0 second_feedback_delay SWITCH_SECOND_ORDER_INPUT_STRUCT
  0000 .input_one : F32
  0004 .input_two : F32
  0008 .switch_flag : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 switch_flag SWITCH_SECOND_ORDER_OUTPUT_STRUCT
  0000 .output : F32
got attribs: [sizeof=4, align=4]

top: 0 output SWITCH_SECOND_ORDER_STRUCT
  0024 state.common.state.transition_one_shot.state.init : BOOLEAN
  0028 state.common.state.transition_one_shot.state.iteration : U32
  0032 state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0036 state.common.state.transition_one_shot.input.input : BOOLEAN
  0037 state.common.state.transition_one_shot.input.reset : BOOLEAN
  0038 state.common.state.transition_one_shot.output.output : BOOLEAN
  0040 state.common.state.transition_one_shot.output.output_previous : F32
  0044 state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0048 state.common.state.transition_one_shot.output.selected_input : F32
  0064 state.common.state.first_integrator.state.delay : F32
  0068 state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0072 state.common.state.first_integrator.input.IC : F32
  0076 state.common.state.first_integrator.input.input : F32
  0080 state.common.state.first_integrator.input.run : BOOLEAN
  0081 state.common.state.first_integrator.input.hold : BOOLEAN
  0084 state.common.state.first_integrator.output.output : F32
  0096 state.common.state.second_integrator.state.delay : F32
  0100 state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0104 state.common.state.second_integrator.input.IC : F32
  0108 state.common.state.second_integrator.input.input : F32
  0112 state.common.state.second_integrator.input.run : BOOLEAN
  0113 state.common.state.second_integrator.input.hold : BOOLEAN
  0116 state.common.state.second_integrator.output.output : F32
  0120 state.common.state.second_integrator.output.first_feedback_delay : F32
  0124 state.common.state.second_integrator.output.second_feedback_delay : F32
  0128 state.common.state.second_integrator.input.input_one : F32
  0132 state.common.state.second_integrator.input.input_two : F32
  0136 state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0140 state.common.state.second_integrator.output.output : F32
got attribs: [sizeof=144, align=8]

top: 0 output ATTITUDE_CONTROLLER_INPUT_STRUCT
  0000 .rate_cross_axis : F32
  0004 .rate_near_axis : F32
  0008 .attitude_near_axis : F32
  0012 .adp_roll_cmd : F32
  0016 .adp_pitch_cmd : F32
  0020 .run_mode : BOOLEAN
  0021 .uar_mode : BOOLEAN
got attribs: [sizeof=24, align=4]

top: 0 uar_mode ATTITUDE_CONTROLLER_OUTPUT_STRUCT
  0000 .output : F32
got attribs: [sizeof=4, align=4]

top: 0 output SATURATIONVF_STATE_STRUCT
  0000 .delay : F32
  0004 .reset_on_init : BOOLEAN
got attribs: [sizeof=8, align=4]

top: 0 reset_on_init SATURATIONVF_INPUT_STRUCT
  0000 .IC : F32
  0004 .input : F32
  0008 .reset : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 reset SATURATIONVF_OUTPUT_STRUCT
  0000 .output : F32
  0004 .inv : BOOLEAN
  0005 .satLo : BOOLEAN
  0006 .satHi : BOOLEAN
got attribs: [sizeof=8, align=4]

top: 0 satHi SATURATIONVF_STRUCT
  0008 state.delay : F32
  0012 state.reset_on_init : BOOLEAN
  0016 input.IC : F32
  0020 input.input : F32
  0024 input.reset : BOOLEAN
  0028 output.output : F32
  0032 output.inv : BOOLEAN
  0033 output.satLo : BOOLEAN
  0034 output.satHi : BOOLEAN
got attribs: [sizeof=40, align=8]

top: 0 satHi REINTICHS_STATE_STRUCT
  0000 .IC_delay : F32
  0004 .rail_bounce : F32
  0008 .prev_sat_UL : BOOLEAN
  0009 .prev_sat_LL : BOOLEAN
  0010 .prev_sat_inv : BOOLEAN
  0011 .prev_reset_int : BOOLEAN
  0012 .prev_reset_sat : BOOLEAN
  0024 integrator.state.delay : F32
  0028 integrator.state.reset_on_init : BOOLEAN
  0032 integrator.input.IC : F32
  0036 integrator.input.input : F32
  0040 integrator.input.run : BOOLEAN
  0041 integrator.input.hold : BOOLEAN
  0044 integrator.output.output : F32
  0056 sat.state.delay : F32
  0060 sat.state.reset_on_init : BOOLEAN
  0064 sat.input.IC : F32
  0068 sat.input.input : F32
  0072 sat.input.reset : BOOLEAN
  0076 sat.output.output : F32
  0080 sat.output.inv : BOOLEAN
  0081 sat.output.satLo : BOOLEAN
  0082 sat.output.satHi : BOOLEAN
got attribs: [sizeof=88, align=8]

top: 0 satHi REINTICHS_INPUT_STRUCT
  0000 .IC : F32
  0004 .input : F32
  0008 .run : BOOLEAN
  0009 .hold : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 hold REINTICHS_OUTPUT_STRUCT
  0000 .output : F32
  0004 .sat_UL : BOOLEAN
  0005 .sat_LL : BOOLEAN
  0006 .inv : BOOLEAN
got attribs: [sizeof=8, align=4]

top: 0 inv REINTICHS_STRUCT
  0008 state.IC_delay : F32
  0012 state.rail_bounce : F32
  0016 state.prev_sat_UL : BOOLEAN
  0017 state.prev_sat_LL : BOOLEAN
  0018 state.prev_sat_inv : BOOLEAN
  0019 state.prev_reset_int : BOOLEAN
  0020 state.prev_reset_sat : BOOLEAN
  0032 state.integrator.state.delay : F32
  0036 state.integrator.state.reset_on_init : BOOLEAN
  0040 state.integrator.input.IC : F32
  0044 state.integrator.input.input : F32
  0048 state.integrator.input.run : BOOLEAN
  0049 state.integrator.input.hold : BOOLEAN
  0052 state.integrator.output.output : F32
  0064 state.sat.state.delay : F32
  0068 state.sat.state.reset_on_init : BOOLEAN
  0072 state.sat.input.IC : F32
  0076 state.sat.input.input : F32
  0080 state.sat.input.reset : BOOLEAN
  0084 state.sat.output.output : F32
  0088 state.sat.output.inv : BOOLEAN
  0089 state.sat.output.satLo : BOOLEAN
  0090 state.sat.output.satHi : BOOLEAN
  0096 input.IC : F32
  0100 input.input : F32
  0104 input.run : BOOLEAN
  0105 input.hold : BOOLEAN
  0108 output.output : F32
  0112 output.sat_UL : BOOLEAN
  0113 output.sat_LL : BOOLEAN
  0114 output.inv : BOOLEAN
got attribs: [sizeof=120, align=8]

top: 0 inv ATTITUDE_CONTROLLER_STATE_STRUCT
  0024 state.common.state.transition_one_shot.state.init : BOOLEAN
  0028 state.common.state.transition_one_shot.state.iteration : U32
  0032 state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0036 state.common.state.transition_one_shot.input.input : BOOLEAN
  0037 state.common.state.transition_one_shot.input.reset : BOOLEAN
  0038 state.common.state.transition_one_shot.output.output : BOOLEAN
  0040 state.common.state.transition_one_shot.output.output_previous : F32
  0044 state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0048 state.common.state.transition_one_shot.output.selected_input : F32
  0064 state.common.state.first_integrator.state.delay : F32
  0068 state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0072 state.common.state.first_integrator.input.IC : F32
  0076 state.common.state.first_integrator.input.input : F32
  0080 state.common.state.first_integrator.input.run : BOOLEAN
  0081 state.common.state.first_integrator.input.hold : BOOLEAN
  0084 state.common.state.first_integrator.output.output : F32
  0096 state.common.state.second_integrator.state.delay : F32
  0100 state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0104 state.common.state.second_integrator.input.IC : F32
  0108 state.common.state.second_integrator.input.input : F32
  0112 state.common.state.second_integrator.input.run : BOOLEAN
  0113 state.common.state.second_integrator.input.hold : BOOLEAN
  0116 state.common.state.second_integrator.output.output : F32
  0120 state.common.state.second_integrator.output.first_feedback_delay : F32
  0124 state.common.state.second_integrator.output.second_feedback_delay : F32
  0128 state.common.state.second_integrator.input.input_one : F32
  0132 state.common.state.second_integrator.input.input_two : F32
  0136 state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0140 state.common.state.second_integrator.output.output : F32
  0168 state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0172 state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0176 state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0180 state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0181 state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0182 state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0184 state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0188 state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0192 state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0208 state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0212 state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0216 state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0220 state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0224 state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0225 state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0228 state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0240 state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0244 state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0248 state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0252 state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0256 state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0257 state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0260 state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0264 state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0268 state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0272 state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0276 state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0280 state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0284 state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0296 state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0300 state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0304 state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0308 state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0312 state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0313 state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0316 state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0328 state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0332 state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0336 state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0337 state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0338 state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0339 state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0340 state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0352 state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0356 state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0360 state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0364 state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0368 state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0369 state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0372 state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0384 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0388 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0392 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0396 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0400 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0404 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0408 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0409 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0410 state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0416 state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0420 state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0424 state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0425 state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0428 state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0432 state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0433 state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0434 state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0440 state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0441 state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
got attribs: [sizeof=448, align=8]

top: 0 integ_sat ATTITUDE_CONTROLLER_STRUCT
  0008 input.rate_cross_axis : F32
  0012 input.rate_near_axis : F32
  0016 input.attitude_near_axis : F32
  0020 input.adp_roll_cmd : F32
  0024 input.adp_pitch_cmd : F32
  0028 input.run_mode : BOOLEAN
  0029 input.uar_mode : BOOLEAN
  0032 output.output : F32
  0064 state.rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0068 state.rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  0072 state.rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0076 state.rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0077 state.rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0078 state.rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0080 state.rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0084 state.rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0088 state.rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0104 state.rate_switch.state.common.state.first_integrator.state.delay : F32
  0108 state.rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0112 state.rate_switch.state.common.state.first_integrator.input.IC : F32
  0116 state.rate_switch.state.common.state.first_integrator.input.input : F32
  0120 state.rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0121 state.rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0124 state.rate_switch.state.common.state.first_integrator.output.output : F32
  0136 state.rate_switch.state.common.state.second_integrator.state.delay : F32
  0140 state.rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0144 state.rate_switch.state.common.state.second_integrator.input.IC : F32
  0148 state.rate_switch.state.common.state.second_integrator.input.input : F32
  0152 state.rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0153 state.rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0156 state.rate_switch.state.common.state.second_integrator.output.output : F32
  0160 state.rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0164 state.rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0168 state.rate_switch.state.common.state.second_integrator.input.input_one : F32
  0172 state.rate_switch.state.common.state.second_integrator.input.input_two : F32
  0176 state.rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0180 state.rate_switch.state.common.state.second_integrator.output.output : F32
  0208 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0212 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0216 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0220 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0221 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0222 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0224 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0228 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0232 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0248 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0252 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0256 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0260 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0264 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0265 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0268 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0280 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0284 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0288 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0292 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0296 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0297 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0300 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0304 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0308 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0312 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0316 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0320 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0324 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0336 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0340 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0344 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0348 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0352 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0353 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0356 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0368 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0372 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0376 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0377 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0378 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0379 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0380 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0392 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0396 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0400 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0404 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0408 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0409 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0412 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0424 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0428 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0432 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0436 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0440 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0444 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0448 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0449 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0450 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0456 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0460 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0464 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0465 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0468 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0472 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0473 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0474 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0480 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0481 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
got attribs: [sizeof=488, align=8]

top: 0 integ_sat ROS_FLIPFLOP_STATE_STRUCT
  0000 .s1 : F32
got attribs: [sizeof=4, align=4]

top: 0 s1 ROS_FLIPFLOP_INPUT_STRUCT
  0000 .set : BOOLEAN
  0001 .reset : BOOLEAN
got attribs: [sizeof=2, align=1]

top: 0 reset ROS_FLIPFLOP_OUTPUT_STRUCT
  0000 .output : BOOLEAN
got attribs: [sizeof=1, align=1]

top: 0 output ROS_FLIPFLOP_STRUCT
  0000 state.s1 : F32
  0004 input.set : BOOLEAN
  0005 input.reset : BOOLEAN
  0006 output.output : BOOLEAN
got attribs: [sizeof=8, align=4]

top: 0 output REINTICH_COEFF_STRUCT
  0000 .K_Ts : F32
got attribs: [sizeof=4, align=4]

top: 0 K_Ts SWITCH_SECOND_ORDER_COEFF_STRUCT
  0000 common_coeff.transition_one_shot_coeff.P : U32
  0004 common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0005 common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0006 common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0008 first_integrator_coeff.K_Ts : F32
  0012 second_integrator_coeff.K_Ts : F32
got attribs: [sizeof=16, align=4]

top: 0 K_Ts SATURATIONVF_COEFF_STRUCT
  0000 .epsilon : F32
  0004 .upper_sat_limit : F32
  0008 .lower_sat_limit : F32
got attribs: [sizeof=12, align=4]

top: 0 lower_sat_limit REINTICHS_COEFF_STRUCT
  0000 .K_Ts : F32
  0004 .Gain : F32
  0008 .UL : F32
  0012 .LL : F32
  0016 .rail_bounce_divisor : F32
  0020 integrator_coeff.K_Ts : F32
  0024 sat_coeff.epsilon : F32
  0028 sat_coeff.upper_sat_limit : F32
  0032 sat_coeff.lower_sat_limit : F32
got attribs: [sizeof=36, align=4]

top: 0 lower_sat_limit ATTITUDE_CONTROLLER_COEFF_STRUCT
  0000 .c_reintichs_IC : F32
  0004 .c_gamma : F32
  0008 .null_attitude : F32
  0012 .upper_sat_limit : F32
  0016 .lower_sat_limit : F32
  0020 .k_rate_to_ang_accel_cross : F32
  0024 .k_rate_to_ang_accel_uar : F32
  0028 .k_rate_to_ang_accel_normal : F32
  0032 .k_attitude_to_ang_accel_uar : F32
  0036 .k_attitude_to_ang_accel_normal : F32
  0040 .k_attitude_to_ang_accel_integral_normal : F32
  0044 .k_compensation : F32
  0048 .k_ang_accel_to_cyclic : F32
  0052 .k_integrator_curve_magnitude : F32
  0056 rate_switch.common_coeff.transition_one_shot_coeff.P : U32
  0060 rate_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0061 rate_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0062 rate_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0064 rate_switch.first_integrator_coeff.K_Ts : F32
  0068 rate_switch.second_integrator_coeff.K_Ts : F32
  0072 attitude_switch.common_coeff.transition_one_shot_coeff.P : U32
  0076 attitude_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0077 attitude_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0078 attitude_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0080 attitude_switch.first_integrator_coeff.K_Ts : F32
  0084 attitude_switch.second_integrator_coeff.K_Ts : F32
  0088 reintich.K_Ts : F32
  0092 reintichs.K_Ts : F32
  0096 reintichs.Gain : F32
  0100 reintichs.UL : F32
  0104 reintichs.LL : F32
  0108 reintichs.rail_bounce_divisor : F32
  0112 reintichs.integrator_coeff.K_Ts : F32
  0116 reintichs.sat_coeff.epsilon : F32
  0120 reintichs.sat_coeff.upper_sat_limit : F32
  0124 reintichs.sat_coeff.lower_sat_limit : F32
  0128 adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.P : U32
  0132 adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0133 adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0134 adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0136 adp_cmd_switch_coeff.first_integrator_coeff.K_Ts : F32
  0140 adp_cmd_switch_coeff.second_integrator_coeff.K_Ts : F32
got attribs: [sizeof=144, align=4]

top: 0 K_Ts TEST_PORT_COEFF_STRUCT
  0000 .gain : F32
  0004 .bias : F32
got attribs: [sizeof=8, align=4]

top: 0 bias LINTERP_STRUCT
  0000 .n_regions : U8
got attribs: [sizeof=124, align=4]

top: 0 regions CYCLIC_FEEDBACK_COEFF_STRUCT
  0000 .pitch_bias : F32
  0004 .roll_rate_limiter_upper_limit : F32
  0008 .roll_rate_limiter_lower_limit : F32
  0012 .pitch_rate_limiter_upper_limit : F32
  0016 .pitch_rate_limiter_lower_limit : F32
  0020 Roll_AttitudeController.c_reintichs_IC : F32
  0024 Roll_AttitudeController.c_gamma : F32
  0028 Roll_AttitudeController.null_attitude : F32
  0032 Roll_AttitudeController.upper_sat_limit : F32
  0036 Roll_AttitudeController.lower_sat_limit : F32
  0040 Roll_AttitudeController.k_rate_to_ang_accel_cross : F32
  0044 Roll_AttitudeController.k_rate_to_ang_accel_uar : F32
  0048 Roll_AttitudeController.k_rate_to_ang_accel_normal : F32
  0052 Roll_AttitudeController.k_attitude_to_ang_accel_uar : F32
  0056 Roll_AttitudeController.k_attitude_to_ang_accel_normal : F32
  0060 Roll_AttitudeController.k_attitude_to_ang_accel_integral_normal : F32
  0064 Roll_AttitudeController.k_compensation : F32
  0068 Roll_AttitudeController.k_ang_accel_to_cyclic : F32
  0072 Roll_AttitudeController.k_integrator_curve_magnitude : F32
  0076 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.P : U32
  0080 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0081 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0082 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0084 Roll_AttitudeController.rate_switch.first_integrator_coeff.K_Ts : F32
  0088 Roll_AttitudeController.rate_switch.second_integrator_coeff.K_Ts : F32
  0092 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.P : U32
  0096 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0097 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0098 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0100 Roll_AttitudeController.attitude_switch.first_integrator_coeff.K_Ts : F32
  0104 Roll_AttitudeController.attitude_switch.second_integrator_coeff.K_Ts : F32
  0108 Roll_AttitudeController.reintich.K_Ts : F32
  0112 Roll_AttitudeController.reintichs.K_Ts : F32
  0116 Roll_AttitudeController.reintichs.Gain : F32
  0120 Roll_AttitudeController.reintichs.UL : F32
  0124 Roll_AttitudeController.reintichs.LL : F32
  0128 Roll_AttitudeController.reintichs.rail_bounce_divisor : F32
  0132 Roll_AttitudeController.reintichs.integrator_coeff.K_Ts : F32
  0136 Roll_AttitudeController.reintichs.sat_coeff.epsilon : F32
  0140 Roll_AttitudeController.reintichs.sat_coeff.upper_sat_limit : F32
  0144 Roll_AttitudeController.reintichs.sat_coeff.lower_sat_limit : F32
  0148 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.P : U32
  0152 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0153 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0154 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0156 Roll_AttitudeController.adp_cmd_switch_coeff.first_integrator_coeff.K_Ts : F32
  0160 Roll_AttitudeController.adp_cmd_switch_coeff.second_integrator_coeff.K_Ts : F32
  0164 Pitch_AttitudeController.c_reintichs_IC : F32
  0168 Pitch_AttitudeController.c_gamma : F32
  0172 Pitch_AttitudeController.null_attitude : F32
  0176 Pitch_AttitudeController.upper_sat_limit : F32
  0180 Pitch_AttitudeController.lower_sat_limit : F32
  0184 Pitch_AttitudeController.k_rate_to_ang_accel_cross : F32
  0188 Pitch_AttitudeController.k_rate_to_ang_accel_uar : F32
  0192 Pitch_AttitudeController.k_rate_to_ang_accel_normal : F32
  0196 Pitch_AttitudeController.k_attitude_to_ang_accel_uar : F32
  0200 Pitch_AttitudeController.k_attitude_to_ang_accel_normal : F32
  0204 Pitch_AttitudeController.k_attitude_to_ang_accel_integral_normal : F32
  0208 Pitch_AttitudeController.k_compensation : F32
  0212 Pitch_AttitudeController.k_ang_accel_to_cyclic : F32
  0216 Pitch_AttitudeController.k_integrator_curve_magnitude : F32
  0220 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.P : U32
  0224 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0225 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0226 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0228 Pitch_AttitudeController.rate_switch.first_integrator_coeff.K_Ts : F32
  0232 Pitch_AttitudeController.rate_switch.second_integrator_coeff.K_Ts : F32
  0236 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.P : U32
  0240 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0241 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0242 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0244 Pitch_AttitudeController.attitude_switch.first_integrator_coeff.K_Ts : F32
  0248 Pitch_AttitudeController.attitude_switch.second_integrator_coeff.K_Ts : F32
  0252 Pitch_AttitudeController.reintich.K_Ts : F32
  0256 Pitch_AttitudeController.reintichs.K_Ts : F32
  0260 Pitch_AttitudeController.reintichs.Gain : F32
  0264 Pitch_AttitudeController.reintichs.UL : F32
  0268 Pitch_AttitudeController.reintichs.LL : F32
  0272 Pitch_AttitudeController.reintichs.rail_bounce_divisor : F32
  0276 Pitch_AttitudeController.reintichs.integrator_coeff.K_Ts : F32
  0280 Pitch_AttitudeController.reintichs.sat_coeff.epsilon : F32
  0284 Pitch_AttitudeController.reintichs.sat_coeff.upper_sat_limit : F32
  0288 Pitch_AttitudeController.reintichs.sat_coeff.lower_sat_limit : F32
  0292 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.P : U32
  0296 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0297 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0298 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0300 Pitch_AttitudeController.adp_cmd_switch_coeff.first_integrator_coeff.K_Ts : F32
  0304 Pitch_AttitudeController.adp_cmd_switch_coeff.second_integrator_coeff.K_Ts : F32
  0308 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.P : U32
  0312 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0313 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0314 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0316 adp_roll_cmd_switch.first_integrator_coeff.K_Ts : F32
  0320 adp_roll_cmd_switch.second_integrator_coeff.K_Ts : F32
  0324 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.P : U32
  0328 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0329 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0330 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0332 adp_pitch_cmd_switch.first_integrator_coeff.K_Ts : F32
  0336 adp_pitch_cmd_switch.second_integrator_coeff.K_Ts : F32
  0340 roll_testport.gain : F32
  0344 roll_testport.bias : F32
  0348 pitch_testport.gain : F32
  0352 pitch_testport.bias : F32
  0356 pitch_testport.K_heading_rate_to_ang_accel_uar : F32
  0360 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.P : U32
  0364 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0365 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0366 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0368 pitch_testport.heading_rate_switch.first_integrator_coeff.K_Ts : F32
  0372 pitch_testport.heading_rate_switch.second_integrator_coeff.K_Ts : F32
  0376 pitch_testport.pitch_bias_linterp.n_regions : U8
  0500 pitch_testport.pitch_bias_linterp.regions.tune_mode : F32
got attribs: [sizeof=504, align=4]

top: 0 tune_mode CYCLIC_STRUCT
  0000 .roll : F32
  0004 .pitch : F32
got attribs: [sizeof=8, align=4]

top: 0 pitch TEST_PORT_INPUT_STRUCT
  0000 .input : F32
got attribs: [sizeof=4, align=4]

top: 0 input TEST_PORT_OUTPUT_STRUCT
  0000 .output : F32
got attribs: [sizeof=4, align=4]

top: 0 output TEST_PORT_STRUCT
  0008 input.input : F32
  0012 output.output : F32
got attribs: [sizeof=16, align=8]

top: 0 output CYCLIC_FEEDBACK_STATE_STRUCT
  0008 input.rate_cross_axis : F32
  0012 input.rate_near_axis : F32
  0016 input.attitude_near_axis : F32
  0020 input.adp_roll_cmd : F32
  0024 input.adp_pitch_cmd : F32
  0028 input.run_mode : BOOLEAN
  0029 input.uar_mode : BOOLEAN
  0032 output.output : F32
  0064 state.rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0068 state.rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  0072 state.rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0076 state.rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0077 state.rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0078 state.rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0080 state.rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0084 state.rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0088 state.rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0104 state.rate_switch.state.common.state.first_integrator.state.delay : F32
  0108 state.rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0112 state.rate_switch.state.common.state.first_integrator.input.IC : F32
  0116 state.rate_switch.state.common.state.first_integrator.input.input : F32
  0120 state.rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0121 state.rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0124 state.rate_switch.state.common.state.first_integrator.output.output : F32
  0136 state.rate_switch.state.common.state.second_integrator.state.delay : F32
  0140 state.rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0144 state.rate_switch.state.common.state.second_integrator.input.IC : F32
  0148 state.rate_switch.state.common.state.second_integrator.input.input : F32
  0152 state.rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0153 state.rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0156 state.rate_switch.state.common.state.second_integrator.output.output : F32
  0160 state.rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0164 state.rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0168 state.rate_switch.state.common.state.second_integrator.input.input_one : F32
  0172 state.rate_switch.state.common.state.second_integrator.input.input_two : F32
  0176 state.rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0180 state.rate_switch.state.common.state.second_integrator.output.output : F32
  0208 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0212 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0216 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0220 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0221 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0222 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0224 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0228 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0232 state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0248 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0252 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0256 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0260 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0264 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0265 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0268 state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0280 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0284 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0288 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0292 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0296 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0297 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0300 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0304 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0308 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0312 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0316 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0320 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0324 state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0336 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0340 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0344 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0348 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0352 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0353 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0356 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0368 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0372 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0376 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0377 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0378 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0379 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0380 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0392 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0396 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0400 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0404 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0408 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0409 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0412 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0424 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0428 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0432 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0436 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0440 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0444 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0448 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0449 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0450 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0456 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0460 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0464 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0465 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0468 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0472 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0473 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0474 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0480 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0481 state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
  0496 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.rate_cross_axis : F32
  0500 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.rate_near_axis : F32
  0504 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.attitude_near_axis : F32
  0508 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.adp_roll_cmd : F32
  0512 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.adp_pitch_cmd : F32
  0516 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.run_mode : BOOLEAN
  0517 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.uar_mode : BOOLEAN
  0520 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.output.output : F32
  0552 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0556 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  0560 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0564 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0565 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0566 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0568 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0572 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0576 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0592 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.delay : F32
  0596 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0600 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.IC : F32
  0604 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.input : F32
  0608 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0609 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0612 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.output.output : F32
  0624 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.delay : F32
  0628 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0632 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.IC : F32
  0636 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input : F32
  0640 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0641 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0644 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0648 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0652 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0656 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_one : F32
  0660 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_two : F32
  0664 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0668 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0696 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0700 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0704 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0708 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0709 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0710 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0712 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0716 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0720 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0736 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0740 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0744 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0748 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0752 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0753 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0756 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0768 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0772 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0776 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0780 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0784 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0785 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0788 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0792 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0796 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0800 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0804 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0808 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0812 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0824 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0828 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0832 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0836 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0840 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0841 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0844 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0856 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0860 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0864 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0865 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0866 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0867 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0868 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0880 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0884 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0888 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0892 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0896 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0897 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0900 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0912 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0916 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0920 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0924 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0928 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0932 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0936 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0937 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0938 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0944 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0948 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0952 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0953 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0956 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0960 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0961 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0962 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0968 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0969 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
  0976 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.roll_rate_limiter_previous_state : F32
  0980 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.pitch_rate_limiter_previous_state : F32
  1008 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1012 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.iteration : U32
  1016 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1020 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1021 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1022 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1024 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1028 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1032 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1048 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.state.delay : F32
  1052 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1056 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.IC : F32
  1060 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.input : F32
  1064 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1065 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1068 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.output.output : F32
  1080 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.state.delay : F32
  1084 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1088 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.IC : F32
  1092 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input : F32
  1096 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1097 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1100 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.output : F32
  1104 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1108 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1112 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input_one : F32
  1116 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input_two : F32
  1120 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1124 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.output : F32
  1152 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1156 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.iteration : U32
  1160 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1164 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1165 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1166 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1168 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1172 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1176 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1192 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.state.delay : F32
  1196 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1200 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.IC : F32
  1204 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.input : F32
  1208 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1209 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1212 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.output.output : F32
  1224 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.state.delay : F32
  1228 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1232 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.IC : F32
  1236 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input : F32
  1240 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1241 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1244 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.output : F32
  1248 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1252 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1256 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input_one : F32
  1260 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input_two : F32
  1264 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1268 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.output : F32
  1280 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.roll_testport.input.input : F32
  1284 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.roll_testport.output.output : F32
  1296 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.input.input : F32
  1300 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.output : F32
  1304 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.first_frame : BOOLEAN
  1305 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.adp_roll_rate_limited : BOOLEAN
  1306 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.adp_pitch_rate_limited : BOOLEAN
  1336 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1340 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  1344 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1348 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1349 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1350 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1352 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1356 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1360 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1376 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.state.delay : F32
  1380 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1384 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.IC : F32
  1388 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.input : F32
  1392 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1393 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1396 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.output.output : F32
  1408 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.state.delay : F32
  1412 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1416 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.IC : F32
  1420 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input : F32
  1424 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1425 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1428 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.output : F32
  1432 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1436 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1440 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input_one : F32
  1444 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input_two : F32
  1448 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1452 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.output : F32
  1456 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.switched_heading_rate : F32
  1460 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.roll_test_input : F32
  1464 state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.pitch_test_input : F32
got attribs: [sizeof=1472, align=8]

top: 0 pitch_test_input CYCLIC_FEEDBACK_INPUT_STRUCT
  0000 .adp_phi_cmd : F32
  0004 .adp_theta_cmd : F32
  0008 .phi : F32
  0012 .phi_dot : F32
  0016 .psi_dot : F32
  0020 .theta : F32
  0024 .theta_dot : F32
  0028 .p : F32
  0032 .q : F32
  0036 .reset : BOOLEAN
  0037 .UAR_mode : BOOLEAN
  0038 .triplex_fault : BOOLEAN
got attribs: [sizeof=40, align=4]

top: 0 triplex_fault CYCLIC_FEEDBACK_STRUCT
  0016 state.Roll_AttitudeController.input.rate_cross_axis : F32
  0020 state.Roll_AttitudeController.input.rate_near_axis : F32
  0024 state.Roll_AttitudeController.input.attitude_near_axis : F32
  0028 state.Roll_AttitudeController.input.adp_roll_cmd : F32
  0032 state.Roll_AttitudeController.input.adp_pitch_cmd : F32
  0036 state.Roll_AttitudeController.input.run_mode : BOOLEAN
  0037 state.Roll_AttitudeController.input.uar_mode : BOOLEAN
  0040 state.Roll_AttitudeController.output.output : F32
  0072 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0076 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  0080 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0084 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0085 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0086 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0088 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0092 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0096 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0112 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.delay : F32
  0116 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0120 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.IC : F32
  0124 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.input : F32
  0128 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0129 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0132 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.output.output : F32
  0144 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.delay : F32
  0148 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0152 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.IC : F32
  0156 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input : F32
  0160 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0161 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0164 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0168 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0172 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0176 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_one : F32
  0180 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_two : F32
  0184 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0188 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0216 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0220 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0224 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0228 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0229 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0230 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0232 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0236 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0240 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0256 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0260 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0264 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0268 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0272 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0273 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0276 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0288 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0292 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0296 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0300 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0304 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0305 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0308 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0312 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0316 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0320 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0324 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0328 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0332 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0344 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0348 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0352 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0356 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0360 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0361 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0364 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0376 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0380 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0384 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0385 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0386 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0387 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0388 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0400 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0404 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0408 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0412 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0416 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0417 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0420 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0432 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0436 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0440 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0444 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0448 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0452 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0456 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0457 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0458 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0464 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0468 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0472 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0473 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0476 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0480 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0481 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0482 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0488 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0489 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
  0504 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.rate_cross_axis : F32
  0508 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.rate_near_axis : F32
  0512 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.attitude_near_axis : F32
  0516 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.adp_roll_cmd : F32
  0520 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.adp_pitch_cmd : F32
  0524 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.run_mode : BOOLEAN
  0525 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.uar_mode : BOOLEAN
  0528 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.output.output : F32
  0560 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0564 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  0568 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0572 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0573 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0574 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0576 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0580 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0584 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0600 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.delay : F32
  0604 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0608 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.IC : F32
  0612 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.input : F32
  0616 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0617 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0620 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.output.output : F32
  0632 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.delay : F32
  0636 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0640 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.IC : F32
  0644 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input : F32
  0648 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0649 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0652 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0656 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0660 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0664 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_one : F32
  0668 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_two : F32
  0672 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0676 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0704 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0708 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0712 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0716 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0717 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0718 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0720 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0724 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0728 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0744 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0748 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0752 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0756 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0760 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0761 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0764 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0776 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0780 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0784 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0788 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0792 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0793 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0796 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0800 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0804 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0808 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0812 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0816 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0820 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0832 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0836 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0840 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0844 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0848 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0849 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0852 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0864 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0868 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0872 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0873 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0874 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0875 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0876 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0888 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0892 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0896 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0900 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0904 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0905 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0908 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0920 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0924 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0928 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0932 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0936 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0940 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0944 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0945 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0946 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0952 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0956 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0960 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0961 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0964 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0968 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0969 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0970 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0976 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0977 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
  0984 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.roll_rate_limiter_previous_state : F32
  0988 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.pitch_rate_limiter_previous_state : F32
  1016 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1020 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.iteration : U32
  1024 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1028 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1029 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1030 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1032 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1036 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1040 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1056 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.state.delay : F32
  1060 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1064 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.IC : F32
  1068 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.input : F32
  1072 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1073 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1076 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.output.output : F32
  1088 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.state.delay : F32
  1092 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1096 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.IC : F32
  1100 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input : F32
  1104 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1105 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1108 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.output : F32
  1112 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1116 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1120 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input_one : F32
  1124 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input_two : F32
  1128 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1132 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.output : F32
  1160 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1164 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.iteration : U32
  1168 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1172 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1173 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1174 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1176 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1180 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1184 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1200 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.state.delay : F32
  1204 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1208 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.IC : F32
  1212 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.input : F32
  1216 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1217 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1220 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.output.output : F32
  1232 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.state.delay : F32
  1236 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1240 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.IC : F32
  1244 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input : F32
  1248 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1249 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1252 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.output : F32
  1256 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1260 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1264 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input_one : F32
  1268 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input_two : F32
  1272 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1276 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.output : F32
  1288 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.roll_testport.input.input : F32
  1292 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.roll_testport.output.output : F32
  1304 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.input.input : F32
  1308 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.output : F32
  1312 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.first_frame : BOOLEAN
  1313 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.adp_roll_rate_limited : BOOLEAN
  1314 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.adp_pitch_rate_limited : BOOLEAN
  1344 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1348 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  1352 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1356 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1357 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1358 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1360 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1364 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1368 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1384 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.state.delay : F32
  1388 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1392 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.IC : F32
  1396 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.input : F32
  1400 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1401 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1404 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.output.output : F32
  1416 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.state.delay : F32
  1420 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1424 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.IC : F32
  1428 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input : F32
  1432 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1433 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1436 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.output : F32
  1440 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1444 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1448 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input_one : F32
  1452 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input_two : F32
  1456 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1460 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.output : F32
  1464 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.switched_heading_rate : F32
  1468 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.roll_test_input : F32
  1472 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.pitch_test_input : F32
  1480 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.adp_phi_cmd : F32
  1484 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.adp_theta_cmd : F32
  1488 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.phi : F32
  1492 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.phi_dot : F32
  1496 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.psi_dot : F32
  1500 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.theta : F32
  1504 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.theta_dot : F32
  1508 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.p : F32
  1512 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.q : F32
  1516 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.reset : BOOLEAN
  1517 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.UAR_mode : BOOLEAN
  1518 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.triplex_fault : BOOLEAN
got attribs: [sizeof=1520, align=8]

top: 0 triplex_fault MONITOR_COMMAND_INPUT_STRUCT
  0000 .run : BOOLEAN
got attribs: [sizeof=1, align=1]

top: 0 run MONITOR_COMMAND_OUTPUT_STRUCT
  0000 .command_fail : BOOLEAN
got attribs: [sizeof=1, align=1]

top: 0 command_fail TENTH_ORDER_AVERAGE_STATE_STRUCT
  0000 .regfile : F32
  0040 .regfile_index : U32
  0044 .sum : F32
  0048 .average : F32
  0052 .sample_interval : U16
  0054 .do_first_frame : BOOLEAN
got attribs: [sizeof=56, align=4]

top: 0 do_first_frame TENTH_ORDER_AVERAGE_INPUT_STRUCT
  0000 .input : F32
  0004 .input_IC : F32
  0008 .reset : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 reset TENTH_ORDER_AVERAGE_OUTPUT_STRUCT
  0000 .output : F32
got attribs: [sizeof=4, align=4]

top: 0 output TENTH_ORDER_AVERAGE_STRUCT
  0008 state.regfile : F32
  0048 state.regfile_index : U32
  0052 state.sum : F32
  0056 state.average : F32
  0060 state.sample_interval : U16
  0062 state.do_first_frame : BOOLEAN
  0064 input.input : F32
  0068 input.input_IC : F32
  0072 input.reset : BOOLEAN
  0076 output.output : F32
got attribs: [sizeof=80, align=8]

top: 0 output FIRSTORDERFILTER_STATE_STRUCT
  0000 .s1 : F32
  0004 .s2 : F32
  0008 .do_first_frame : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 do_first_frame FIRSTORDERFILTER_INPUT_STRUCT
  0000 .input : F32
  0004 .input_IC : F32
  0008 .reset : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 reset FIRSTORDERFILTER_OUTPUT_STRUCT
  0000 .output : F32
got attribs: [sizeof=4, align=4]

top: 0 output FIRSTORDERFILTER_STRUCT
  0008 state.s1 : F32
  0012 state.s2 : F32
  0016 state.do_first_frame : BOOLEAN
  0020 input.input : F32
  0024 input.input_IC : F32
  0028 input.reset : BOOLEAN
  0032 output.output : F32
got attribs: [sizeof=40, align=8]

top: 0 output MONITOR_COMMAND_STATE_STRUCT
  0008 state.init : BOOLEAN
  0012 state.iteration : U32
  0016 state.prev_input : BOOLEAN
  0020 input.input : BOOLEAN
  0021 input.reset : BOOLEAN
  0022 output.output : BOOLEAN
  0032 toa.state.regfile : F32
  0072 toa.state.regfile_index : U32
  0076 toa.state.sum : F32
  0080 toa.state.average : F32
  0084 toa.state.sample_interval : U16
  0086 toa.state.do_first_frame : BOOLEAN
  0088 toa.input.input : F32
  0092 toa.input.input_IC : F32
  0096 toa.input.reset : BOOLEAN
  0100 toa.output.output : F32
  0112 wash_out.state.s1 : F32
  0116 wash_out.state.s2 : F32
  0120 wash_out.state.do_first_frame : BOOLEAN
  0124 wash_out.input.input : F32
  0128 wash_out.input.input_IC : F32
  0132 wash_out.input.reset : BOOLEAN
  0136 wash_out.output.output : F32
  0144 ros_ff.state.s1 : F32
  0148 ros_ff.input.set : BOOLEAN
  0149 ros_ff.input.reset : BOOLEAN
  0150 ros_ff.output.output : BOOLEAN
got attribs: [sizeof=152, align=8]

top: 0 output MONITOR_COMMAND_STRUCT
  0008 .run : BOOLEAN
  0009 .command_fail : BOOLEAN
  0024 p1shot.state.init : BOOLEAN
  0028 p1shot.state.iteration : U32
  0032 p1shot.state.prev_input : BOOLEAN
  0036 p1shot.input.input : BOOLEAN
  0037 p1shot.input.reset : BOOLEAN
  0038 p1shot.output.output : BOOLEAN
  0048 toa.state.regfile : F32
  0088 toa.state.regfile_index : U32
  0092 toa.state.sum : F32
  0096 toa.state.average : F32
  0100 toa.state.sample_interval : U16
  0102 toa.state.do_first_frame : BOOLEAN
  0104 toa.input.input : F32
  0108 toa.input.input_IC : F32
  0112 toa.input.reset : BOOLEAN
  0116 toa.output.output : F32
  0128 wash_out.state.s1 : F32
  0132 wash_out.state.s2 : F32
  0136 wash_out.state.do_first_frame : BOOLEAN
  0140 wash_out.input.input : F32
  0144 wash_out.input.input_IC : F32
  0148 wash_out.input.reset : BOOLEAN
  0152 wash_out.output.output : F32
  0160 ros_ff.state.s1 : F32
  0164 ros_ff.input.set : BOOLEAN
  0165 ros_ff.input.reset : BOOLEAN
  0166 ros_ff.output.output : BOOLEAN
got attribs: [sizeof=168, align=8]

top: 0 output TENTH_ORDER_AVERAGE_COEFF_STRUCT
  0000 .sample_interval : U32
got attribs: [sizeof=4, align=4]

top: 0 sample_interval FIRSTORDERFILTER_COEFF_STRUCT
  0000 .a1 : F32
  0004 .b0 : F32
  0008 .b1 : F32
  0012 .k1 : F32
  0016 .k2 : F32
got attribs: [sizeof=20, align=4]

top: 0 k2 MONITOR_COMMAND_COEFF_STRUCT
  0000 p1shot_coeff.P : U32
  0004 p1shot_coeff.ic : BOOLEAN
  0005 p1shot_coeff.rising_edge : BOOLEAN
  0006 p1shot_coeff.falling_edge : BOOLEAN
  0008 toa_coeff.sample_interval : U32
  0012 wash_out_coeff.a1 : F32
  0016 wash_out_coeff.b0 : F32
  0020 wash_out_coeff.b1 : F32
  0024 wash_out_coeff.k1 : F32
  0028 wash_out_coeff.k2 : F32
  0032 wash_out_coeff.wof_l_limit : F32
  0036 wash_out_coeff.wof_u_limit : F32
got attribs: [sizeof=40, align=4]

top: 0 wof_u_limit MONITOR_COEFF_STRUCT
  0000 .rate_l_limit : F32
  0004 .rate_u_limit : F32
  0008 .attitude_l_limit : F32
  0012 .attitude_u_limit : F32
  0016 adp_cmd_coeff.p1shot_coeff.P : U32
  0020 adp_cmd_coeff.p1shot_coeff.ic : BOOLEAN
  0021 adp_cmd_coeff.p1shot_coeff.rising_edge : BOOLEAN
  0022 adp_cmd_coeff.p1shot_coeff.falling_edge : BOOLEAN
  0024 adp_cmd_coeff.toa_coeff.sample_interval : U32
  0028 adp_cmd_coeff.wash_out_coeff.a1 : F32
  0032 adp_cmd_coeff.wash_out_coeff.b0 : F32
  0036 adp_cmd_coeff.wash_out_coeff.b1 : F32
  0040 adp_cmd_coeff.wash_out_coeff.k1 : F32
  0044 adp_cmd_coeff.wash_out_coeff.k2 : F32
  0048 adp_cmd_coeff.wash_out_coeff.wof_l_limit : F32
  0052 adp_cmd_coeff.wash_out_coeff.wof_u_limit : F32
  0056 adp_cmd_coeff.act_pos_coeff.p1shot_coeff.P : U32
  0060 adp_cmd_coeff.act_pos_coeff.p1shot_coeff.ic : BOOLEAN
  0061 adp_cmd_coeff.act_pos_coeff.p1shot_coeff.rising_edge : BOOLEAN
  0062 adp_cmd_coeff.act_pos_coeff.p1shot_coeff.falling_edge : BOOLEAN
  0064 adp_cmd_coeff.act_pos_coeff.toa_coeff.sample_interval : U32
  0068 adp_cmd_coeff.act_pos_coeff.wash_out_coeff.a1 : F32
  0072 adp_cmd_coeff.act_pos_coeff.wash_out_coeff.b0 : F32
  0076 adp_cmd_coeff.act_pos_coeff.wash_out_coeff.b1 : F32
  0080 adp_cmd_coeff.act_pos_coeff.wash_out_coeff.k1 : F32
  0084 adp_cmd_coeff.act_pos_coeff.wash_out_coeff.k2 : F32
  0088 adp_cmd_coeff.act_pos_coeff.wash_out_coeff.wof_l_limit : F32
  0092 adp_cmd_coeff.act_pos_coeff.wash_out_coeff.wof_u_limit : F32
got attribs: [sizeof=96, align=4]

top: 0 wof_u_limit MONITOR_INPUT_STRUCT
  0000 .rate : F32
  0004 .attitude : F32
  0008 .uar_mode : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 uar_mode MONITOR_OUTPUT_STRUCT
  0000 .rate_fail : BOOLEAN
  0001 .attitude_fail : BOOLEAN
  0002 .adp_command_fail : BOOLEAN
  0003 .actuator_position_fail : BOOLEAN
got attribs: [sizeof=4, align=1]

top: 0 actuator_position_fail MONITOR_STATE_STRUCT
  0008 adp_cmd.input.run : BOOLEAN
  0009 adp_cmd.output.command_fail : BOOLEAN
  0024 adp_cmd.state.p1shot.state.init : BOOLEAN
  0028 adp_cmd.state.p1shot.state.iteration : U32
  0032 adp_cmd.state.p1shot.state.prev_input : BOOLEAN
  0036 adp_cmd.state.p1shot.input.input : BOOLEAN
  0037 adp_cmd.state.p1shot.input.reset : BOOLEAN
  0038 adp_cmd.state.p1shot.output.output : BOOLEAN
  0048 adp_cmd.state.toa.state.regfile : F32
  0088 adp_cmd.state.toa.state.regfile_index : U32
  0092 adp_cmd.state.toa.state.sum : F32
  0096 adp_cmd.state.toa.state.average : F32
  0100 adp_cmd.state.toa.state.sample_interval : U16
  0102 adp_cmd.state.toa.state.do_first_frame : BOOLEAN
  0104 adp_cmd.state.toa.input.input : F32
  0108 adp_cmd.state.toa.input.input_IC : F32
  0112 adp_cmd.state.toa.input.reset : BOOLEAN
  0116 adp_cmd.state.toa.output.output : F32
  0128 adp_cmd.state.wash_out.state.s1 : F32
  0132 adp_cmd.state.wash_out.state.s2 : F32
  0136 adp_cmd.state.wash_out.state.do_first_frame : BOOLEAN
  0140 adp_cmd.state.wash_out.input.input : F32
  0144 adp_cmd.state.wash_out.input.input_IC : F32
  0148 adp_cmd.state.wash_out.input.reset : BOOLEAN
  0152 adp_cmd.state.wash_out.output.output : F32
  0160 adp_cmd.state.ros_ff.state.s1 : F32
  0164 adp_cmd.state.ros_ff.input.set : BOOLEAN
  0165 adp_cmd.state.ros_ff.input.reset : BOOLEAN
  0166 adp_cmd.state.ros_ff.output.output : BOOLEAN
  0176 act_pos.input.run : BOOLEAN
  0177 act_pos.output.command_fail : BOOLEAN
  0192 act_pos.state.p1shot.state.init : BOOLEAN
  0196 act_pos.state.p1shot.state.iteration : U32
  0200 act_pos.state.p1shot.state.prev_input : BOOLEAN
  0204 act_pos.state.p1shot.input.input : BOOLEAN
  0205 act_pos.state.p1shot.input.reset : BOOLEAN
  0206 act_pos.state.p1shot.output.output : BOOLEAN
  0216 act_pos.state.toa.state.regfile : F32
  0256 act_pos.state.toa.state.regfile_index : U32
  0260 act_pos.state.toa.state.sum : F32
  0264 act_pos.state.toa.state.average : F32
  0268 act_pos.state.toa.state.sample_interval : U16
  0270 act_pos.state.toa.state.do_first_frame : BOOLEAN
  0272 act_pos.state.toa.input.input : F32
  0276 act_pos.state.toa.input.input_IC : F32
  0280 act_pos.state.toa.input.reset : BOOLEAN
  0284 act_pos.state.toa.output.output : F32
  0296 act_pos.state.wash_out.state.s1 : F32
  0300 act_pos.state.wash_out.state.s2 : F32
  0304 act_pos.state.wash_out.state.do_first_frame : BOOLEAN
  0308 act_pos.state.wash_out.input.input : F32
  0312 act_pos.state.wash_out.input.input_IC : F32
  0316 act_pos.state.wash_out.input.reset : BOOLEAN
  0320 act_pos.state.wash_out.output.output : F32
  0328 act_pos.state.ros_ff.state.s1 : F32
  0332 act_pos.state.ros_ff.input.set : BOOLEAN
  0333 act_pos.state.ros_ff.input.reset : BOOLEAN
  0334 act_pos.state.ros_ff.output.output : BOOLEAN
got attribs: [sizeof=336, align=8]

top: 0 output MONITOR_STRUCT
  0008 .rate : F32
  0012 .attitude : F32
  0016 .uar_mode : BOOLEAN
  0020 .rate_fail : BOOLEAN
  0021 .attitude_fail : BOOLEAN
  0022 .adp_command_fail : BOOLEAN
  0023 .actuator_position_fail : BOOLEAN
  0032 adp_cmd.input.run : BOOLEAN
  0033 adp_cmd.output.command_fail : BOOLEAN
  0048 adp_cmd.state.p1shot.state.init : BOOLEAN
  0052 adp_cmd.state.p1shot.state.iteration : U32
  0056 adp_cmd.state.p1shot.state.prev_input : BOOLEAN
  0060 adp_cmd.state.p1shot.input.input : BOOLEAN
  0061 adp_cmd.state.p1shot.input.reset : BOOLEAN
  0062 adp_cmd.state.p1shot.output.output : BOOLEAN
  0072 adp_cmd.state.toa.state.regfile : F32
  0112 adp_cmd.state.toa.state.regfile_index : U32
  0116 adp_cmd.state.toa.state.sum : F32
  0120 adp_cmd.state.toa.state.average : F32
  0124 adp_cmd.state.toa.state.sample_interval : U16
  0126 adp_cmd.state.toa.state.do_first_frame : BOOLEAN
  0128 adp_cmd.state.toa.input.input : F32
  0132 adp_cmd.state.toa.input.input_IC : F32
  0136 adp_cmd.state.toa.input.reset : BOOLEAN
  0140 adp_cmd.state.toa.output.output : F32
  0152 adp_cmd.state.wash_out.state.s1 : F32
  0156 adp_cmd.state.wash_out.state.s2 : F32
  0160 adp_cmd.state.wash_out.state.do_first_frame : BOOLEAN
  0164 adp_cmd.state.wash_out.input.input : F32
  0168 adp_cmd.state.wash_out.input.input_IC : F32
  0172 adp_cmd.state.wash_out.input.reset : BOOLEAN
  0176 adp_cmd.state.wash_out.output.output : F32
  0184 adp_cmd.state.ros_ff.state.s1 : F32
  0188 adp_cmd.state.ros_ff.input.set : BOOLEAN
  0189 adp_cmd.state.ros_ff.input.reset : BOOLEAN
  0190 adp_cmd.state.ros_ff.output.output : BOOLEAN
  0200 act_pos.input.run : BOOLEAN
  0201 act_pos.output.command_fail : BOOLEAN
  0216 act_pos.state.p1shot.state.init : BOOLEAN
  0220 act_pos.state.p1shot.state.iteration : U32
  0224 act_pos.state.p1shot.state.prev_input : BOOLEAN
  0228 act_pos.state.p1shot.input.input : BOOLEAN
  0229 act_pos.state.p1shot.input.reset : BOOLEAN
  0230 act_pos.state.p1shot.output.output : BOOLEAN
  0240 act_pos.state.toa.state.regfile : F32
  0280 act_pos.state.toa.state.regfile_index : U32
  0284 act_pos.state.toa.state.sum : F32
  0288 act_pos.state.toa.state.average : F32
  0292 act_pos.state.toa.state.sample_interval : U16
  0294 act_pos.state.toa.state.do_first_frame : BOOLEAN
  0296 act_pos.state.toa.input.input : F32
  0300 act_pos.state.toa.input.input_IC : F32
  0304 act_pos.state.toa.input.reset : BOOLEAN
  0308 act_pos.state.toa.output.output : F32
  0320 act_pos.state.wash_out.state.s1 : F32
  0324 act_pos.state.wash_out.state.s2 : F32
  0328 act_pos.state.wash_out.state.do_first_frame : BOOLEAN
  0332 act_pos.state.wash_out.input.input : F32
  0336 act_pos.state.wash_out.input.input_IC : F32
  0340 act_pos.state.wash_out.input.reset : BOOLEAN
  0344 act_pos.state.wash_out.output.output : F32
  0352 act_pos.state.ros_ff.state.s1 : F32
  0356 act_pos.state.ros_ff.input.set : BOOLEAN
  0357 act_pos.state.ros_ff.input.reset : BOOLEAN
  0358 act_pos.state.ros_ff.output.output : BOOLEAN
got attribs: [sizeof=360, align=8]

top: 0 output UARMODELOGIC_COEFF_STRUCT
  0000 .phi_upper_limit : F32
  0004 .phi_lower_limit : F32
  0008 .theta_upper_limit : F32
  0012 .theta_lower_limit : F32
  0016 .p_filt_upper_limit : F32
  0020 .p_filt_lower_limit : F32
  0024 .q_filt_upper_limit : F32
  0028 .q_filt_lower_limit : F32
  0032 run_p1shot.P : U32
  0036 run_p1shot.ic : BOOLEAN
  0037 run_p1shot.rising_edge : BOOLEAN
  0038 run_p1shot.falling_edge : BOOLEAN
  0040 uar_hold_p1shot.P : U32
  0044 uar_hold_p1shot.ic : BOOLEAN
  0045 uar_hold_p1shot.rising_edge : BOOLEAN
  0046 uar_hold_p1shot.falling_edge : BOOLEAN
got attribs: [sizeof=48, align=4]

top: 0 falling_edge MCP_CONTROL_PRODUCER_COEFF_STRUCT
  0000 .pitch_bias : F32
  0004 .roll_rate_limiter_upper_limit : F32
  0008 .roll_rate_limiter_lower_limit : F32
  0012 .pitch_rate_limiter_upper_limit : F32
  0016 .pitch_rate_limiter_lower_limit : F32
  0020 Roll_AttitudeController.c_reintichs_IC : F32
  0024 Roll_AttitudeController.c_gamma : F32
  0028 Roll_AttitudeController.null_attitude : F32
  0032 Roll_AttitudeController.upper_sat_limit : F32
  0036 Roll_AttitudeController.lower_sat_limit : F32
  0040 Roll_AttitudeController.k_rate_to_ang_accel_cross : F32
  0044 Roll_AttitudeController.k_rate_to_ang_accel_uar : F32
  0048 Roll_AttitudeController.k_rate_to_ang_accel_normal : F32
  0052 Roll_AttitudeController.k_attitude_to_ang_accel_uar : F32
  0056 Roll_AttitudeController.k_attitude_to_ang_accel_normal : F32
  0060 Roll_AttitudeController.k_attitude_to_ang_accel_integral_normal : F32
  0064 Roll_AttitudeController.k_compensation : F32
  0068 Roll_AttitudeController.k_ang_accel_to_cyclic : F32
  0072 Roll_AttitudeController.k_integrator_curve_magnitude : F32
  0076 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.P : U32
  0080 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0081 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0082 Roll_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0084 Roll_AttitudeController.rate_switch.first_integrator_coeff.K_Ts : F32
  0088 Roll_AttitudeController.rate_switch.second_integrator_coeff.K_Ts : F32
  0092 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.P : U32
  0096 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0097 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0098 Roll_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0100 Roll_AttitudeController.attitude_switch.first_integrator_coeff.K_Ts : F32
  0104 Roll_AttitudeController.attitude_switch.second_integrator_coeff.K_Ts : F32
  0108 Roll_AttitudeController.reintich.K_Ts : F32
  0112 Roll_AttitudeController.reintichs.K_Ts : F32
  0116 Roll_AttitudeController.reintichs.Gain : F32
  0120 Roll_AttitudeController.reintichs.UL : F32
  0124 Roll_AttitudeController.reintichs.LL : F32
  0128 Roll_AttitudeController.reintichs.rail_bounce_divisor : F32
  0132 Roll_AttitudeController.reintichs.integrator_coeff.K_Ts : F32
  0136 Roll_AttitudeController.reintichs.sat_coeff.epsilon : F32
  0140 Roll_AttitudeController.reintichs.sat_coeff.upper_sat_limit : F32
  0144 Roll_AttitudeController.reintichs.sat_coeff.lower_sat_limit : F32
  0148 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.P : U32
  0152 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0153 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0154 Roll_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0156 Roll_AttitudeController.adp_cmd_switch_coeff.first_integrator_coeff.K_Ts : F32
  0160 Roll_AttitudeController.adp_cmd_switch_coeff.second_integrator_coeff.K_Ts : F32
  0164 Pitch_AttitudeController.c_reintichs_IC : F32
  0168 Pitch_AttitudeController.c_gamma : F32
  0172 Pitch_AttitudeController.null_attitude : F32
  0176 Pitch_AttitudeController.upper_sat_limit : F32
  0180 Pitch_AttitudeController.lower_sat_limit : F32
  0184 Pitch_AttitudeController.k_rate_to_ang_accel_cross : F32
  0188 Pitch_AttitudeController.k_rate_to_ang_accel_uar : F32
  0192 Pitch_AttitudeController.k_rate_to_ang_accel_normal : F32
  0196 Pitch_AttitudeController.k_attitude_to_ang_accel_uar : F32
  0200 Pitch_AttitudeController.k_attitude_to_ang_accel_normal : F32
  0204 Pitch_AttitudeController.k_attitude_to_ang_accel_integral_normal : F32
  0208 Pitch_AttitudeController.k_compensation : F32
  0212 Pitch_AttitudeController.k_ang_accel_to_cyclic : F32
  0216 Pitch_AttitudeController.k_integrator_curve_magnitude : F32
  0220 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.P : U32
  0224 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0225 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0226 Pitch_AttitudeController.rate_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0228 Pitch_AttitudeController.rate_switch.first_integrator_coeff.K_Ts : F32
  0232 Pitch_AttitudeController.rate_switch.second_integrator_coeff.K_Ts : F32
  0236 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.P : U32
  0240 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0241 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0242 Pitch_AttitudeController.attitude_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0244 Pitch_AttitudeController.attitude_switch.first_integrator_coeff.K_Ts : F32
  0248 Pitch_AttitudeController.attitude_switch.second_integrator_coeff.K_Ts : F32
  0252 Pitch_AttitudeController.reintich.K_Ts : F32
  0256 Pitch_AttitudeController.reintichs.K_Ts : F32
  0260 Pitch_AttitudeController.reintichs.Gain : F32
  0264 Pitch_AttitudeController.reintichs.UL : F32
  0268 Pitch_AttitudeController.reintichs.LL : F32
  0272 Pitch_AttitudeController.reintichs.rail_bounce_divisor : F32
  0276 Pitch_AttitudeController.reintichs.integrator_coeff.K_Ts : F32
  0280 Pitch_AttitudeController.reintichs.sat_coeff.epsilon : F32
  0284 Pitch_AttitudeController.reintichs.sat_coeff.upper_sat_limit : F32
  0288 Pitch_AttitudeController.reintichs.sat_coeff.lower_sat_limit : F32
  0292 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.P : U32
  0296 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0297 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0298 Pitch_AttitudeController.adp_cmd_switch_coeff.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0300 Pitch_AttitudeController.adp_cmd_switch_coeff.first_integrator_coeff.K_Ts : F32
  0304 Pitch_AttitudeController.adp_cmd_switch_coeff.second_integrator_coeff.K_Ts : F32
  0308 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.P : U32
  0312 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0313 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0314 adp_roll_cmd_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0316 adp_roll_cmd_switch.first_integrator_coeff.K_Ts : F32
  0320 adp_roll_cmd_switch.second_integrator_coeff.K_Ts : F32
  0324 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.P : U32
  0328 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0329 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0330 adp_pitch_cmd_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0332 adp_pitch_cmd_switch.first_integrator_coeff.K_Ts : F32
  0336 adp_pitch_cmd_switch.second_integrator_coeff.K_Ts : F32
  0340 roll_testport.gain : F32
  0344 roll_testport.bias : F32
  0348 pitch_testport.gain : F32
  0352 pitch_testport.bias : F32
  0356 pitch_testport.K_heading_rate_to_ang_accel_uar : F32
  0360 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.P : U32
  0364 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.ic : BOOLEAN
  0365 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.rising_edge : BOOLEAN
  0366 pitch_testport.heading_rate_switch.common_coeff.transition_one_shot_coeff.falling_edge : BOOLEAN
  0368 pitch_testport.heading_rate_switch.first_integrator_coeff.K_Ts : F32
  0372 pitch_testport.heading_rate_switch.second_integrator_coeff.K_Ts : F32
  0376 pitch_testport.pitch_bias_linterp.n_regions : U8
  0500 pitch_testport.pitch_bias_linterp.regions.tune_mode : F32
  0504 pitch_testport.pitch_bias_linterp.uar_mode_logic.phi_upper_limit : F32
  0508 pitch_testport.pitch_bias_linterp.uar_mode_logic.phi_lower_limit : F32
  0512 pitch_testport.pitch_bias_linterp.uar_mode_logic.theta_upper_limit : F32
  0516 pitch_testport.pitch_bias_linterp.uar_mode_logic.theta_lower_limit : F32
  0520 pitch_testport.pitch_bias_linterp.uar_mode_logic.p_filt_upper_limit : F32
  0524 pitch_testport.pitch_bias_linterp.uar_mode_logic.p_filt_lower_limit : F32
  0528 pitch_testport.pitch_bias_linterp.uar_mode_logic.q_filt_upper_limit : F32
  0532 pitch_testport.pitch_bias_linterp.uar_mode_logic.q_filt_lower_limit : F32
  0536 pitch_testport.pitch_bias_linterp.uar_mode_logic.run_p1shot.P : U32
  0540 pitch_testport.pitch_bias_linterp.uar_mode_logic.run_p1shot.ic : BOOLEAN
  0541 pitch_testport.pitch_bias_linterp.uar_mode_logic.run_p1shot.rising_edge : BOOLEAN
  0542 pitch_testport.pitch_bias_linterp.uar_mode_logic.run_p1shot.falling_edge : BOOLEAN
  0544 pitch_testport.pitch_bias_linterp.uar_mode_logic.uar_hold_p1shot.P : U32
  0548 pitch_testport.pitch_bias_linterp.uar_mode_logic.uar_hold_p1shot.ic : BOOLEAN
  0549 pitch_testport.pitch_bias_linterp.uar_mode_logic.uar_hold_p1shot.rising_edge : BOOLEAN
  0550 pitch_testport.pitch_bias_linterp.uar_mode_logic.uar_hold_p1shot.falling_edge : BOOLEAN
got attribs: [sizeof=552, align=4]

top: 0 falling_edge MCP_CONTROL_PRODUCER_INPUT_STRUCT
  0000 .run : BOOLEAN
got attribs: [sizeof=1, align=1]

top: 0 run MCP_CONTROL_PRODUCER_OUTPUT_STRUCT
  0000 feedback.roll : F32
  0004 feedback.pitch : F32
  0008 feedback.uar_mode : BOOLEAN
  0009 feedback.run_adp : BOOLEAN
  0010 feedback.phi_valid : BOOLEAN
  0011 feedback.theta_valid : BOOLEAN
got attribs: [sizeof=12, align=4]

top: 0 theta_valid UARMODELOGIC_INPUT_STRUCT
  0000 .phi : F32
  0004 .theta : F32
  0008 .p_filt : F32
  0012 .q_filt : F32
  0016 .run : BOOLEAN
  0017 .adp_fail : BOOLEAN
  0018 .disable_ADP : BOOLEAN
got attribs: [sizeof=20, align=4]

top: 0 disable_ADP UARMODELOGIC_OUTPUT_STRUCT
  0000 .phi_range_valid : BOOLEAN
  0001 .theta_range_valid : BOOLEAN
  0002 .uar_mode : BOOLEAN
got attribs: [sizeof=3, align=1]

top: 0 uar_mode UARMODELOGIC_STATE_STRUCT
  0000 uar_mode_ff.state.s1 : F32
  0004 uar_mode_ff.input.set : BOOLEAN
  0005 uar_mode_ff.input.reset : BOOLEAN
  0006 uar_mode_ff.output.output : BOOLEAN
  0008 phi_range_ff.state.s1 : F32
  0012 phi_range_ff.input.set : BOOLEAN
  0013 phi_range_ff.input.reset : BOOLEAN
  0014 phi_range_ff.output.output : BOOLEAN
  0016 theta_range_ff.state.s1 : F32
  0020 theta_range_ff.input.set : BOOLEAN
  0021 theta_range_ff.input.reset : BOOLEAN
  0022 theta_range_ff.output.output : BOOLEAN
  0032 run_p1shot.state.init : BOOLEAN
  0036 run_p1shot.state.iteration : U32
  0040 run_p1shot.state.prev_input : BOOLEAN
  0044 run_p1shot.input.input : BOOLEAN
  0045 run_p1shot.input.reset : BOOLEAN
  0046 run_p1shot.output.output : BOOLEAN
  0056 uar_hold_p1shot.state.init : BOOLEAN
  0060 uar_hold_p1shot.state.iteration : U32
  0064 uar_hold_p1shot.state.prev_input : BOOLEAN
  0068 uar_hold_p1shot.input.input : BOOLEAN
  0069 uar_hold_p1shot.input.reset : BOOLEAN
  0070 uar_hold_p1shot.output.output : BOOLEAN
got attribs: [sizeof=72, align=8]

top: 0 output UARMODELOGIC_STRUCT
  0008 .phi : F32
  0012 .theta : F32
  0016 .p_filt : F32
  0020 .q_filt : F32
  0024 .run : BOOLEAN
  0025 .adp_fail : BOOLEAN
  0026 .disable_ADP : BOOLEAN
  0028 .phi_range_valid : BOOLEAN
  0029 .theta_range_valid : BOOLEAN
  0030 .uar_mode : BOOLEAN
  0032 uar_mode_ff.state.s1 : F32
  0036 uar_mode_ff.input.set : BOOLEAN
  0037 uar_mode_ff.input.reset : BOOLEAN
  0038 uar_mode_ff.output.output : BOOLEAN
  0040 phi_range_ff.state.s1 : F32
  0044 phi_range_ff.input.set : BOOLEAN
  0045 phi_range_ff.input.reset : BOOLEAN
  0046 phi_range_ff.output.output : BOOLEAN
  0048 theta_range_ff.state.s1 : F32
  0052 theta_range_ff.input.set : BOOLEAN
  0053 theta_range_ff.input.reset : BOOLEAN
  0054 theta_range_ff.output.output : BOOLEAN
  0064 run_p1shot.state.init : BOOLEAN
  0068 run_p1shot.state.iteration : U32
  0072 run_p1shot.state.prev_input : BOOLEAN
  0076 run_p1shot.input.input : BOOLEAN
  0077 run_p1shot.input.reset : BOOLEAN
  0078 run_p1shot.output.output : BOOLEAN
  0088 uar_hold_p1shot.state.init : BOOLEAN
  0092 uar_hold_p1shot.state.iteration : U32
  0096 uar_hold_p1shot.state.prev_input : BOOLEAN
  0100 uar_hold_p1shot.input.input : BOOLEAN
  0101 uar_hold_p1shot.input.reset : BOOLEAN
  0102 uar_hold_p1shot.output.output : BOOLEAN
got attribs: [sizeof=104, align=8]

top: 0 output MCP_CONTROL_PRODUCER_STATE_STRUCT
  0016 state.Roll_AttitudeController.input.rate_cross_axis : F32
  0020 state.Roll_AttitudeController.input.rate_near_axis : F32
  0024 state.Roll_AttitudeController.input.attitude_near_axis : F32
  0028 state.Roll_AttitudeController.input.adp_roll_cmd : F32
  0032 state.Roll_AttitudeController.input.adp_pitch_cmd : F32
  0036 state.Roll_AttitudeController.input.run_mode : BOOLEAN
  0037 state.Roll_AttitudeController.input.uar_mode : BOOLEAN
  0040 state.Roll_AttitudeController.output.output : F32
  0072 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0076 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  0080 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0084 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0085 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0086 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0088 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0092 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0096 state.Roll_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0112 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.delay : F32
  0116 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0120 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.IC : F32
  0124 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.input : F32
  0128 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0129 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0132 state.Roll_AttitudeController.state.rate_switch.state.common.state.first_integrator.output.output : F32
  0144 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.delay : F32
  0148 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0152 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.IC : F32
  0156 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input : F32
  0160 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0161 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0164 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0168 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0172 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0176 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_one : F32
  0180 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_two : F32
  0184 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0188 state.Roll_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0216 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0220 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0224 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0228 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0229 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0230 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0232 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0236 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0240 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0256 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0260 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0264 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0268 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0272 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0273 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0276 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0288 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0292 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0296 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0300 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0304 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0305 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0308 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0312 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0316 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0320 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0324 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0328 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0332 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0344 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0348 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0352 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0356 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0360 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0361 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0364 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0376 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0380 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0384 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0385 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0386 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0387 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0388 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0400 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0404 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0408 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0412 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0416 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0417 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0420 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0432 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0436 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0440 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0444 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0448 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0452 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0456 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0457 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0458 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0464 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0468 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0472 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0473 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0476 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0480 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0481 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0482 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0488 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0489 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
  0504 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.rate_cross_axis : F32
  0508 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.rate_near_axis : F32
  0512 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.attitude_near_axis : F32
  0516 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.adp_roll_cmd : F32
  0520 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.adp_pitch_cmd : F32
  0524 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.run_mode : BOOLEAN
  0525 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.input.uar_mode : BOOLEAN
  0528 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.output.output : F32
  0560 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0564 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  0568 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0572 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0573 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0574 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0576 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0580 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0584 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0600 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.delay : F32
  0604 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0608 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.IC : F32
  0612 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.input : F32
  0616 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0617 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0620 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.first_integrator.output.output : F32
  0632 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.delay : F32
  0636 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0640 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.IC : F32
  0644 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input : F32
  0648 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0649 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0652 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0656 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0660 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0664 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_one : F32
  0668 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.input_two : F32
  0672 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0676 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.second_integrator.output.output : F32
  0704 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  0708 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.iteration : U32
  0712 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  0716 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  0717 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  0718 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  0720 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.output_previous : F32
  0724 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  0728 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.transition_one_shot.output.selected_input : F32
  0744 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.delay : F32
  0748 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  0752 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.IC : F32
  0756 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.input : F32
  0760 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.run : BOOLEAN
  0761 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  0764 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.first_integrator.output.output : F32
  0776 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.delay : F32
  0780 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  0784 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.IC : F32
  0788 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input : F32
  0792 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.run : BOOLEAN
  0793 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  0796 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0800 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  0804 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  0808 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_one : F32
  0812 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.input_two : F32
  0816 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  0820 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.second_integrator.output.output : F32
  0832 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.delay : F32
  0836 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.state.reset_on_init : BOOLEAN
  0840 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.IC : F32
  0844 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.input : F32
  0848 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.run : BOOLEAN
  0849 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.input.hold : BOOLEAN
  0852 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintich.output.output : F32
  0864 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.IC_delay : F32
  0868 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.rail_bounce : F32
  0872 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_UL : BOOLEAN
  0873 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_LL : BOOLEAN
  0874 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_sat_inv : BOOLEAN
  0875 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_int : BOOLEAN
  0876 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.prev_reset_sat : BOOLEAN
  0888 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.delay : F32
  0892 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.state.reset_on_init : BOOLEAN
  0896 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.IC : F32
  0900 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.input : F32
  0904 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.run : BOOLEAN
  0905 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.input.hold : BOOLEAN
  0908 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.integrator.output.output : F32
  0920 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.delay : F32
  0924 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.state.reset_on_init : BOOLEAN
  0928 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.IC : F32
  0932 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.input : F32
  0936 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.input.reset : BOOLEAN
  0940 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.output : F32
  0944 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.inv : BOOLEAN
  0945 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satLo : BOOLEAN
  0946 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.state.sat.output.satHi : BOOLEAN
  0952 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.IC : F32
  0956 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.input : F32
  0960 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.run : BOOLEAN
  0961 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.input.hold : BOOLEAN
  0964 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.output : F32
  0968 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_UL : BOOLEAN
  0969 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.sat_LL : BOOLEAN
  0970 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.inv : BOOLEAN
  0976 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.prev_run : BOOLEAN
  0977 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.integ_sat : BOOLEAN
  0984 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.roll_rate_limiter_previous_state : F32
  0988 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.pitch_rate_limiter_previous_state : F32
  1016 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1020 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.iteration : U32
  1024 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1028 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1029 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1030 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1032 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1036 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1040 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1056 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.state.delay : F32
  1060 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1064 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.IC : F32
  1068 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.input : F32
  1072 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1073 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1076 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.first_integrator.output.output : F32
  1088 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.state.delay : F32
  1092 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1096 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.IC : F32
  1100 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input : F32
  1104 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1105 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1108 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.output : F32
  1112 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1116 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1120 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input_one : F32
  1124 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.input_two : F32
  1128 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1132 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.second_integrator.output.output : F32
  1160 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1164 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.iteration : U32
  1168 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1172 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1173 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1174 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1176 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1180 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1184 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1200 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.state.delay : F32
  1204 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1208 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.IC : F32
  1212 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.input : F32
  1216 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1217 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1220 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.first_integrator.output.output : F32
  1232 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.state.delay : F32
  1236 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1240 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.IC : F32
  1244 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input : F32
  1248 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1249 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1252 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.output : F32
  1256 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1260 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1264 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input_one : F32
  1268 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.input_two : F32
  1272 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1276 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.second_integrator.output.output : F32
  1288 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.roll_testport.input.input : F32
  1292 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.roll_testport.output.output : F32
  1304 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.input.input : F32
  1308 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.output : F32
  1312 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.first_frame : BOOLEAN
  1313 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.adp_roll_rate_limited : BOOLEAN
  1314 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.adp_pitch_rate_limited : BOOLEAN
  1344 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.init : BOOLEAN
  1348 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.iteration : U32
  1352 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.state.prev_input : BOOLEAN
  1356 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.input.input : BOOLEAN
  1357 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.input.reset : BOOLEAN
  1358 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.output : BOOLEAN
  1360 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.output_previous : F32
  1364 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.transition_deviation_latched : F32
  1368 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.transition_one_shot.output.selected_input : F32
  1384 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.state.delay : F32
  1388 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.state.reset_on_init : BOOLEAN
  1392 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.IC : F32
  1396 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.input : F32
  1400 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.run : BOOLEAN
  1401 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.input.hold : BOOLEAN
  1404 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.first_integrator.output.output : F32
  1416 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.state.delay : F32
  1420 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.state.reset_on_init : BOOLEAN
  1424 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.IC : F32
  1428 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input : F32
  1432 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.run : BOOLEAN
  1433 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.hold : BOOLEAN
  1436 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.output : F32
  1440 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.first_feedback_delay : F32
  1444 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.second_feedback_delay : F32
  1448 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input_one : F32
  1452 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.input_two : F32
  1456 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.switch_flag : BOOLEAN
  1460 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.output : F32
  1464 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.switched_heading_rate : F32
  1468 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.roll_test_input : F32
  1472 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.output.pitch_test_input : F32
  1480 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.adp_phi_cmd : F32
  1484 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.adp_theta_cmd : F32
  1488 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.phi : F32
  1492 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.phi_dot : F32
  1496 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.psi_dot : F32
  1500 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.theta : F32
  1504 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.theta_dot : F32
  1508 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.p : F32
  1512 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.q : F32
  1516 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.reset : BOOLEAN
  1517 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.UAR_mode : BOOLEAN
  1518 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.second_integrator.input.triplex_fault : BOOLEAN
  1528 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.input.phi : F32
  1532 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.input.theta : F32
  1536 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.input.p_filt : F32
  1540 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.input.q_filt : F32
  1544 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.input.run : BOOLEAN
  1545 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.input.adp_fail : BOOLEAN
  1546 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.input.disable_ADP : BOOLEAN
  1548 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.output.phi_range_valid : BOOLEAN
  1549 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.output.theta_range_valid : BOOLEAN
  1550 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.output.uar_mode : BOOLEAN
  1552 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.uar_mode_ff.state.s1 : F32
  1556 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.uar_mode_ff.input.set : BOOLEAN
  1557 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.uar_mode_ff.input.reset : BOOLEAN
  1558 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.uar_mode_ff.output.output : BOOLEAN
  1560 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.phi_range_ff.state.s1 : F32
  1564 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.phi_range_ff.input.set : BOOLEAN
  1565 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.phi_range_ff.input.reset : BOOLEAN
  1566 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.phi_range_ff.output.output : BOOLEAN
  1568 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.theta_range_ff.state.s1 : F32
  1572 state.Roll_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.Pitch_AttitudeController.state.rate_switch.state.common.state.attitude_switch.state.common.state.reintichs.output.adp_roll_cmd_switch.state.common.state.adp_pitch_cmd_switch.state.common.state.pitch_testport.output.heading_rate_switch.state.common.state.uar_mode_logic.state.theta_range_ff.input.set : BOOLEAN
